{"contentItems": [{"content": "When a page is loaded the css and js files priority is not respected. So as result, users can see side-effects because is loaded after other css files and overwrites the expected rules This issue is provoked by changes regarding new location and new logic regarding ForceVersion and Framework properties in Client Resource files. +Expected+ The file should be loaded the first one if it is requested. The rest of DNN priorities should be respected as well.. CKEditor Provider shows a \"Not Auahotirzed\" error on Browser component. The Browser page of shows a \"Not Authorized\" error on Browser component when a registered user tries to browse the server. This error occurs in a child site, it doesn't happen on a parent site. Steps Create a child site Enter in that site Create a folder and deny access to Registered users Go to Host HTML Editor Manager and allow Register User to use the File Browser on provider Create a page and allow Registered Users to edit it As a registered User, enter in the above page in edit mode Edit content of a HTML module Click on Link button and after that on Browse Server button Actual A \"Not Authorized\" error is shown Instead showing the Browser page. See the attached image to see the error message Expected The Browser page should be shown and Child Site folder should be shown in the tree explorer. CKEditor dialogs do not show the Browse Server button when permissions are allowed. CKEditor dialogs do not show the \"Browse Server\" button when permissions are allowed. So Register Users cannot browse server folder and choose an stored file or image for linking into the content. Steps As Host, go to Host HTML Editor Manager Ensure that you have selected provider as your default provider Go to File Browser Settings Tab, ensure that File Browser dropdown is Standard Allow some roles clicking the corresponding checkbox. Registered Users Save Create a new page. Add Edit permissions to Registered User on that page Add a HTML Module As Registered User, go to page created in the above step Edit page Go to Edit Content for the module created above In the Editor, click on Image icon Actual Beside the URL field, user should see the Browse Server button since he has been allowed, but the button does not appear. See the following screencast to see all details regarding these steps: Expected Beside the URL field, user should see the Browse Server button and he should be able to choose a file image. When you are in Host HTML Editor Manager page and you try to press \"Enter\" key, nothing occurs and the browser console shows a bad request. But that request is regarding the ControlBar Switch Site feature +Steps+ As Host, go to Host HTML Editor Manager Go to Custom Toolbar tab Click on a Toolbar group name. The name is converted to a textbox control. Try to change the name and put the focus on that control Press the \"Enter\" key +Actual+ Nothing happens. The name should be changed. An error appears in the browser console See the follow screen cast: +Expected+ Toolbar name should be changed No error in browser console. With Browser Console open. - Log in as host, goto home page and edit the page - Edit the first top banner, change some words purposely with wrong Grammar. for instance, change \"We have\" to be \"We has\". - Bring up \"Spell checker Check Spelling Grammar\". - Click on the \"X\" button to close it. - Bring up this dialog again. Error in Object doesn't support property or method 'isVisible'. DCC API - Remove PortalId field from table. When you create or modify a template, you could replaced an existing file without any UI advice. +Steps+ As host, enter in Admin Dynamic Content Type Manager Click on Templates tab. Create a new template with some body Check the FileSystem. The above template file should be created Create other new template with a different body but using the same name as above +Actual+ There is only one file with the chosen file name and it contains the body of the last template. +Expected+ The templates creation dialog should not allow an existing file and should show an alert informing about that when it occur. DCC - Templates creation does not check existing template files. DCC - The template file is not deleted after changing the template file name. EVOQCONTENT - PB Asset Manager's folder picker does not return correct search results. DNNFileUpload should register all its needed dependencies. Noticed this with IE. Also it is reproducible in a local fresh install with any user with Edit permissions. Host users Steps: (bring up DeveloperTool) - Log in as Host, and edit any page - Mouse hover on any module header to bring up module menu. - From the gear like icon drop-down menu, click out \"Help\" Result: SCRIPT438: Object doesn't support property or method 'jScrollPane' File: 382, Line: 103, Column: 13. EVOQSOCIAL - Module Action menus should be created only under the main page body. For Platform there are already customer with experimenting this problem have a valid zip file to be added to an existing site: . That does not need any upgrade process, only unzip it.. When a user sets a host page to be a link to other url and enables the option \"Open Link In New Browser Window\" it does not work: the link is always opened in the same browser window and the check is disabled again in the UI (although the associated TabSetting is updated in database). - Login as host - Go to Admin - Page Management - Check Manage \"Host Pages\" - Select any host page, \"Extensions\" - Click on the Link section - Select the option Link- Url - Enter a url. - Check the option \"Open Link In New Browser Window\" - Click on the Update button (Please note that the option checked in the previous step is unchecked again, which is unexpected) - Clear Cache. Tools - Clear Cache - Click on the Update Page. Following the examples: Host - Extensions - The url is opened in a new browser window - The url is opened in A decision should be made about the correct behavior: - Option 1. Hide the option \"Open Link In New Browser Window\" for Host Pages. - Option 2. Make the option to work for Host Pages as well. This issue only happens for Host Pages.. EVOQCONTENT - Page Properties provoke an error on Edit Profile page. When you upgrade from or earlier you can run into a SQL Script error when script is run. See the attached image The log shows the following error It seems that PortalSettings table could store invalid data integer setting +Steps+ Upgrade to a version upper to using the method +Expected+ No errors when upgrading the website. Issue description: Cannot upload a file with same name into standard and secure folders when Versioning is enabled with Direct Publish workflow Steps: 1, As Host, create a page, put it in site menu, add DAM module to the page 2, Create a standard under Root 3, Upload a few files into the folder 6, Upload a files into the folder and select Replace Actual results: The FileManager fires the Metadata changed event before file content is added. That could be incoherent and external event handlers could run into problems Expected results: No error with file being replaced with the new uploaded. EVOQCONTENT Workflow Notifications: Disable Toast by default. When a specific tab version is requested via URL, sometimes the page doesn't show the corresponding Module version to the requested tab version.. System tabs should not be seen in Admin Page Management Pre-condition: Create at least 1 System Tab. a page template Steps: - Log in as Admin, goto Admin - Page Management You won't see the newly page - Log in as Host, goto Admin - Page Management The newly page is there. Expected: - No users should ever see any System Tab from this screen.. EVOQCONTENT - Cannot create child site with saved template. EVOQCONTENT - Digest Emails contains no appropriate tokens not replaced. Issue description: Page with future Start Date is not accessible by CM or Host Steps: Set up a site Create a user and assign the user Content Manager role As CM, create a page and put it in site menu As Host, go to Page Settings - Advanced Settings - Other Settings - Start Date, and set a future date ** Or check the Disable checkbox Try to access the page as Host or CM Actual results: A message - Page cannot be found, no page content is displayed Expected results: Event a page is set a future Start Date or is disabled, the page should be still visible for CM and Host. With this improvent we will be able to create and manage System Tabs. A System Tab could be considered as a special tab, created by solution purposes, different fron tabs created by users. As these tabs may have a specific functionality, we should add some restrictions on the solution ir order to not break that functionality or not create corrupted data. TabController should manage System Tabs as they are other normal tabs Tab will be just a new field in the TabInfo entity we need to ensure that some existing features doesn't manage System Tabs, as following: - Export Site: System Tabs are specific for a portal and installation, therefore they should not be exported - Sitemap: System Tabs are not pages created by users, they should not be part of the explicit navigation, therefore they should not appear in the Sitemap - Content Localization: System Tabs are not pages created by users, they should not be localized - Search: System Tabs should not appear as search results. Add Page missing events in Platform. Page events were missed from the linked story. We need to ensure there are additional events for the following (will be useful in Content): - Page Restored - Page marked as Published. h2. Card: As a user, I want to be able to set the number of versions to keep in the system. but it should not have special reference to files. EVOQCONTENT - Site Settings File Version Settings Remove references to Digital Assets. When a user who is a member of the group is trying to add an Existing Module to a page not all the pages modules appear in the drop-down list. Brief Description of Issue: - Clear Steps to Reproduce: - Install DNN - Goto Admin Security Roles Add New Role : TESTRole Role : False Role : False Mode: SecurityRole Approved Update - Create new user and assgine the new role to that user. - Goto Home page Page Permissions Give full control to the new role 'TESTRole'. - Give full control to the any HTML Pro Module on home page. - Add new page \"TESTPAGE\" and give that role full permission. - Logout and login with new user. - Browse to TESTPAGE - Click add existing module from ControlBar - The drop-down list emply and it will display the page if user searches.. +As a site administrator, I want an easy way to add a new group or user to the permissions grid of a content piece so that I can quickly achieve my h3. Conversation The current permissions grid design works well for the default installed list of users. However, it does not scale well when large lists of groups are created. Current Grid design: The existing permissions grid will be replaced with a new design. The new design lists only those permissions which are already set, and provides a way of adding new groups to have a permission configured. 1. Permissions grid default view 2. Permissions grid when Add Role is clicked 3. Permissions grid newly added role 4. When the permissions grid is expanded beyond the ability to view horizontally, then it should scroll horizontally, leaving the role name and actions column visible. h3. Confirmation - When the permissions grid loads, it shows only those permissions which are currently used for the object that the grid refers to - The Add Role function is always visible to users who have the authority to change the permissions - When the Add Role button is clicked, a row will be added to the top of the grid, and will briefly change color to highlight that it has just been added, as feedback to the user. - The correct resources file, and the English confirmation should be: o Title : Confirm Role Permission Delete o Question : Are you sure you wish to delete the permissions for ? o Buttons : Yes No or OK Cancel.. Environment: Only happen on IE, but works fine in Chrome and Firefox. Steps: - Log in as Host - Goto Admin File Management - Browse any folder to show files - Right-click on one of the file, in pop-up menu, click \"View Properties\" to bring up file property page. - Do nothing, just click on \"Cancel\" to dismiss this pop-up - Try to click on the page menu (or in the DAM module). Results: - Files, folders, or URL Links, all not clickable or selectable anymore. (admin menu still work) Workaround: Page go back and go forward, can dismiss the trouble. -. ", "contenttype": "application/json", "created": 737603, "id": 31, "language": "en", "user_name": "agrueso"}]}