{"contentItems": [{"content": "Brief Description of Issue: In the Spanish flag, the tooltip text says \"Espanol (Espana)\", It should be \"Espaol (Espaa)\". Similarly, for other languages like \"Franais\" Clear Steps to Reproduce: Launch install, in the first screen hover the mouse over the Spainish flag to show the tooltip. Actual Result: The text is Espanol (Espana) Expected Result The text is Espaol (Espaa) * This is not a translation issue, the text is hard-coded in the. DCC - Add Authorization attributes to Dynamic Content Viewer Controllers. Task to Set to DCC Viewer Controllers, as required.. DCC API - Remove PortalId field from table. not set in httpRuntime in Verified this fails both for new installs and for upgrades. Currently, the schedule history shows the duration as a total number of seconds, possibly with a lot of decimals. Also the 3 dates of start, end and next are displayed in the same cell. For task in progress, it shows E: N: as end and date Schedule History Improvements request: - Format duration as a human readable format, like Not needed to show decimals - Use a separate column for each date Not needed to use lists or labels inside the cell - Do not show invalid dates for null dates. Display the cell empty. Site search is not finding items with tags that contain a html character. : In DAM, add a tag to a file with and &, for example 'tag&' In search box, click advanced and enter the tag 'tag&' No results Found Should show the item associated to 'tag&'. Scenario: Create child-pages \"Error404\" and \"Error500\" of the page \"Error\" Try to select pages Error404\" and \"Error500\" as \"404 Error Page\" or \"500 Error Page\" under Admin Site Settings I will create a pull request to fix this problem.. EVOQCONTENT - File Uploader control is renaming files with special chars. File Uploader control is renaming files with a + char. This was introduced as a workaround for DNN-5917. The base problem is solved by DNN-7036, and this code can be reverted. Using DAM, upload a file with a + char in the name, for example. Notice the UI shows that the (with the original name) has been uploaded The file has been renamed to without user intervention The file must not be renamed Note that a file with a + in the name is valid. SI: User registration fails because of non-existing culture value is passed. The way the tag input works, a new tag can only be entered by clicking in a small area, right of the last entered tag (where the mouse cursor changes to a text input): The full tag input area should be clickable to allow entering new tags.. EVOQCONTENT - Tags input make full area clickable. EVOQSOCIAL - File Uploader Control Add info to event about the uploaded file. The control to upload files raises an event to notify a file upload but this event does not contain any info (file name and path or fileId) about the uploaded file, It is not possible to know what file that has been uploaded with the current API. This is raised even if the file has not been uploaded ok, but the control is asking the user to replace or keep. The event should also contain info about if the upload was ok or not, or, alternatively, only be raised if the upload was ok. Platform changes are required to add this info to the event.. Currently, the SProc gets the list of task from the user notifications. To know if a notification should be shown as a task, this SProc has the following logic: - If the notification type has no ModuleId, it should not be shown had to add a list of exceptions to this (white list), in order to resolve SOCIAL-3227 - An additional black list filter is performed to exclude some notification types This same mechanism should probably be extended to use in Content's persona bar sproc), so the white black list of types is not the best option. The enhancement proposal is to add a flag to the table, to specify if the notification should be displayed in the task list: - The logic in SPROC will be simplified - The upgrade should set the default values to this flag for each type. Persona Bar Tasks Add ShowAsTask flag to. When there is a long word in the notification list, the flow of the page breaks. To reproduce, generate some notification with a long word, for example: Go to Admin File management Subscribe to any file Rename the file to a very long name (ex: Go to the notification list Result: Expected: Limit the width of the notification list, independently of its content. ", "contenttype": "application/json", "created": 737603, "id": 21, "language": "en", "user_name": "agx"}]}