{"contentItems": [{"content": "When an exception occurs in a DB Insert or Delete the logs shows \"null\" the config file and the number line. Please check the in bold below in the element section: Steps to reproduce: In \"mule\" project checkout to branch In the logs you will see the exception copied above.. When a component doesn't have the property it sets with \"null\" the config file and the number line. Steps to reproduce: Send an http request to \" Message : Execution of the expression \"fail\" failed. Payload : Element :. When the property is not present, the xml file name and the line number appear with null in the exception logging. There some components that when the throw exception they don't show the element, element xml, etc. I have found that VM, Dataweave, Expression Transformer and Groovy Transformer have this issue. +The groovy transformer exception looks like Message : Execution of the expression \"fail\" failed. Transformer : sourceTypes. Since MULE-9204 is done, we need to test that this actually works for the APIs mentioned. OAuth Server Using Basic Auth Encode In Body Paypal API SUCCESS N A Twitter API SUCCESS N A Facebook API N A SUCCESS Spotify API SUCCESS SUCCESS OAuth Provider SUCCESS SUCCESS It was also tested the case when a token expires and then the need to obtain a new one using the Spotify api.. Change \"release\" profile in EE with a new profile. Change \"release\" profile with \"distribution\" profile in EE to avoid the need to use the property when we wanted to build the artifacts of EE (there we use the plugins included in the profile release of CE but we didn't want to build the : After the changes: will only add the distributions module in EE * : will activate the release and distributions profile mentioned before.. Using the correct User Pass in basic authentication with Preemptive enabled in the new HTTP Module works fine. You send a single request with the Authorization field and you receive a 200. But in the case when you use a wrong User Pass, it send fine the Authorization field but when the server respond with a 401, the requester send a new requester trying to be authorize. See the attached files with the comparison of how works the http-client (only 1 request) and how it works the requester (2 requests) +To reproduce you can use these - (Mule-ee) (Http-client 1 request). The not change the mimeType correctly. It should set as mimeType but keep after an HTTP Request. Steps to reproduce (see attached app): 1) Send HTTP request to . 2) Check in the log the datatype of the message after transformer in the outbound property. Inbound properties copied to outbound properties not maintain their datatypes. When the Inbound properties are copied to outbound properties they should maintain their datatypes. Right now they are setted to the default message type (Encoding null, MimeType ). 1) Send HTTP request to . 2) In the first log you can check that the outbound property \"inboundProp\" has before the VM connector. 3) After the VM connector the \"inboundProp\" is copied from the to with \"\". Then you can check in the second logger that the Datatype of the \"inboundProp\" is set with encoding null, mimeType. Using an incorrect value in the encoding field doesn't throw an excpetion if you change the DataType to a valid value before returning it. When setting the encoding in payload, transformers, properties and variables with an incorrect value it is not validated. In the other hand the mimeType throws an exception. I think that the encoding should have the same behaviour. When you set the property \"ContentType\" it let you use any value in both mimeType and encoding. But maybe in the content type situation is the desired behaviour. Steps to reproduce (see attached app): Set Payload: 1) Send HTTP request to : There the first set payload set the encoding with an invalid value but as then there is another set payload that set the encoding to a valid encoding there is not exception. 2) Send HTTP request to : Here the Set Payload set an invalid encoding value and it throws Properties: 1) Send HTTP request to : 2) Set property sets the encoding with a wrong value. In the check in the Outbound Property log: OUTBOUND scoped properties: pepe 2. The requester of the HTTP Module when using NTLM returns a 400 in place of 401 when you have wrong. The requester of the HTTP Module when using NTLM returns a 400 (HTTP Error 400. The request has an invalid header in place of 401 (401 - Unauthorized: Access is denied due to invalid. XML Parser error when using Response Builder with the new HTTP Listener. New HTTP Module Request not encode values in the path attribute. In the new HTTP Request Module when you use a path that have chars that need to be encoded it doesn't produce an URI with the values encoded. For example: The PATH in this case has to be encoded and arrive to the listener server as \" out%201\". General Testing New HTTP-Module. Headers Transfer Encoding Proxy SSL-HTTPS Threading profile PUT Error Handler SSL-HTTPS Consuming API with definition API def Standalone, Cluster, Webapp and CE Standalone Reliability Pattern Request-Reply * CXF WS and Jersey. When you use a Wildcard to support a pattern in the PATH it's not working fine in these scenarios: For 1) It doesn't work consuming it with 2) It doesn't work consuming it with (with works fine) If I have another flow in the same app with a 1) It doesn't work consuming it with Examples: 1) GET Method: should return \"TestOk\" but it doesn't work in that path (STATUS 404 No listener for endpoint: in wildcard ) 2) GET Method: should return \"TestOk\" but it doesn't work in that path (STATUS 404 No listener for endpoint: 3) GET Method: should return \"TestOk123\" but it doesn't work in that path (STATUS 404 No listener for endpoint:. ", "contenttype": "application/json", "created": 737358, "id": 60, "language": "en", "user_name": "alejandro.nosenzo", "email": "alejandro.nosenzo@mulesoft.com"}]}