{"contentItems": [{"content": "\"Inline Editor Enabled\" no working. Incorrect ordering of items in Console module. Console module incorrectly sorts candidate tabs. ON HOLD: Folder Permission Open Files Deny does not work. User with DENY write to folder (full control) permission can see and open files Deny does not work. Module does not work in group mode. Content - Permission System Navigate permission setting is not applied. Content - Permission System Navigate permission setting is not applied Steps to reproduce: 1. Install the latest EVOQ 2. Login as Host 3. Add a new User Tester 4. Add two new Roles Testers 1 5. Assign the Tester1 Roles to the user (Tester) 6. Create a new page (Test) 7. Navigate and Manage Settings permission for the page (Test) 8. For Tester 1 role set to Allow to vie and Deny to navigate (Attachment 1) 9. Update the page settings 10. Log out 11. Login as Tester 12. Go to Test page Actual result: The Test page is included in the navigation menu Expected result: The Test page is not included in the navigation menu and page is visible to the user only by URL 13. Logout 14. Login as Host 15. Go to Test Edit Page Permission Settings 16. Check-out the Navigate for Tester 1 role (Not Allow) (Attachment 2) 17. Update the page settings 18. Log out 19. Login as Tester 20. Go to Test page Actual result: The Test page is included in the navigation menu Expected result: The Test page is not included in the navigation menu and page is visible to the user only by URL. The copy page does not work from a language different than en-us If you trying to copy page from different than the default language you have only possibility to create a new page not copy of the page. Without Content localization enabled, we should have the same copy of page from any language This issue was introduced in before in we have a different behavior the copy pop-up is opened, it is empty, and we dont have possibility to make copy with content. But the actual structure with module is copied in Steps to reproduce: 1. Install the latest DNN 2. Add a new language (deutch) 3. Go to About Us page 4. Click Pages- Copy page Actual result Expected result the copy page pop-up is open 5. Close pop-up 6. Click on German flag 7. Click Pages Copy page Actual result Create a new page pop-up is opened Expected result the copy page pop-up is open. ON HOLD: Cannot add a module to a non en-US copy of an en-US page. Description: Creating links using in line editing does not work as expected Steps: - Install Evoq Content - Upgrade to - Enable Inline Editor - Navigate to one of the default pages - Add some text at the end of the content in a module, select it and create a link Expected Outcome: The user must be able to convert the newly added content into a link Actual Outcome: The newly created content does not turn into a link but link with the text is inserted at the beginning of the content, and the pop up to enter the URL is displayed at the top of the page and not where the mouse is. The Site crawler does not index all users Steps to reproduce 1. Install the latest DNN Platform build 513 (Auto Instalation) 2. Login as Host 3. Go to Admin Users Accounts 4. Cerate two users Tester and Alexey 5. Go to Admin Search Admin 6. Re-index Content 7. Go to Host Schedule 8. Open the Site Crawler history Actual result: only one user was indexed) Expected result: three users are indexed (Admin, Alexey, Tester) 9. Try to search for each user (Admin, Alexey, Tester) one by one Actual result: Only Admin was be found Expected result: All tree users are found. The User profile picture cannot be loaded from the User profile page The same failure you could observe from the Admin-User Account-Edit User path Steps to reproduce: 1. Install the latest DNN Platform build 2. Login as Host 3. Go to Admin Users Accounts 4. Create a new user Tester 5. Logout 6. Login as User 7. Go to User Profile Edit My Profile Photo 8. Select a picture file 9. Click Upload button Actual result: error message: The page at says: An error has occurred. The photo has not uploaded; the error message is uninformative; The error message is not in the DNN Style. Looks like some debug mode leftover. Expected result: the profile photo was uploaded successfully. The Toast skin object not activated on the login of recipient 1. Install the latest DNN Platform (CE) (auto installation) 2. Make changes in the to include the Toast object: a. Add in Register section b. Add in the login span: 3. Lunch the site in a browser 4. Monitor all activities with any type of Devs tool which support Network monitoring DELETED 8. Register a new Tester user from the register link on the Home page 9. Open the site DB in the SQL management studio 10. In the Users table change the value of UpdatePassword filed for Admin user from True to False 11. In the table set all values of SendTost to True for all resipients 12. In the browser login as Admin Actual result: Nothing happen, old style notification is displayed number one for notification Expected result: the notification event was fired and the Toast skin object displayed. The Toast Skin object load gives us the 500 server error The issue is reproducible on the x DNN Platform edition 1. Install the latest DNN Platform (CE) (auto installation) 2. Make changes in the to include the Toast object: Add in Register section Add in the login span: 3. Lunch the site in a browser 4. Monitor all activities with any type of Devs tool which support Network monitoring DELETED 8. Register a new Tester user from the register link on the Home page 9. Open the site DB in the SQL management studio 10. In the Users table change the value of UpdatePassword filed for Admin user from True to False 11. In the table set all values of SendTost to True for all recipients 12. In the browser login as Admin 13. Wait for 30 seconds Actual result: On the Net monitor you can see the 500 Error on GET Toast object: Error An error has occurred. Object cannot be cast from DBNull to other types. at provider) at dr) at objObject, IDataReader dr) at objType, IDataReader dr, Boolean closeReader) at dr, IList`1 objList, Boolean closeReader) at userInfo) , Object , Object ) at instance, Object at instance, Object arguments) at func, Expected result: No Any error. Taxonomy Selection Control Causes Major UI Performance Issue. Folders Permissions. The Z-order issue on the content localization tab The new UI of the Languages module have two small UI issues this one and DNN-3578 The new elements to restore or hard delete deleted module from localized page have wrong z-index for the pages created in the default language and are inaccessible. Steps to reproduce 1. Install the latest DNN 2. Login as Host 3. Add a new language (German) 4. Allow content localization 5. Go to Admin - Languages 6. Enable the language 7. Enable content localization with all pages 8. Go to the Contact US page (English version) 9. Delete the Message Us module 10. Go to Admin Languages Content localization 11. Try to restore or hard delete the module Actual result: the Restore or Delete icons have z-order issue and cannot be accessible by mouse Expected result: the same UI which you have for the added language (German). Make Module Creator discoverable from Control Panel.. ON HOLD: SI: blog comments are truncated. Request Extension. SI: show only direct children for console module. Search User Profile Crawler. ", "contenttype": "application/json", "created": 737603, "id": 23, "language": "en", "user_name": "Alexey.tregub"}]}