{"contentItems": [{"content": "Login as host, go to Host Extensions Available Extensions (x) The extension appears as a \"module\". library The extension should have a friendly name - . When installing, the first install wizard screen should display name. ( Message Text: QA Notes: Please test this for both clean installation and upgrade. We need to create new releases for the following modules on and ensure that they function with DNN Platform and above. The source code must be used from Github as well. Newsletters * Vendors. provider has not translations for some UI components. Upgrade with Content Localization enabled you get non Language Packs listed. - not localized text appears in the Content Localization pop up. When adding a module that exists in another portal, modules that have been deleted, but not removed from the Recycling Bin can still be seen and added to other portals. The module needs to be removed from the Recycling Bin to remove it as an option for adding to pages in other portals. Steps to reproduce: 1. Create a site group and add Portal A and Portal B to it. 2. Create a module in Portal A then delete it from the page 3. In Portal B, go to 'Add Existing Module' and choose Portal A and the page the deleted module was on. Expected results: The deleted module is not present. Actual results: The deleted module can be Recycling Bin.. Scope: Test load time of home page as Anonymous Test load time of home page as Registered Users Following products needs to be tested: Umbraco Drupal Wordpress Sitefinity Kentico. - Log in as Host, Create a new page - a Banner module on the new page Results: - Module is added, but without caption. - it is confusing which module actually already added on the page. - It is a regression comparing to version Anything to do with CONTENT-3529?. h2. Card As a developer, I want the content I create using the DCC API to get automatically indexed for later searching. The indexer should only index the actual field values and should not pick up any of the field names. Given values are all stored in Json format, it is not easy to sort filter paginate through database calls. For example, we have a content type: Employee and we want to sort on First Name. The current APIs won't be able to do that as values are stored in Json. We are going to use Search APIs to perform sort filter pagination based on data in Lucene. This requires that we provide the correct names for the various fields in Search. h2. Conversation h2. Confirmation. EVOQCONTENT: Installation progress UI stopped at 29%. EVOQCONTENT: Uploading ANY file through Database Folder Provider fails. EVOQSOCIAL: Cloud - iUpgradable problem causes content in various modules to not work. EVOQCONTENT: Introduce ContentItem for Folders. In a previous release we introduced ContentItemId integration with Files in DNN. We need to same thing for Folders. This integration will help systems that are strictly based on ContentItems take advantage of the ContentItemId, Title, Tags, without knowing anything about internal structure of Folder tables.. EVOQSOCIAL: Setup FolderName for Library packages during install. EVOQCONTENT: Cannot upload group of files in File Mgmt connecting to Box. EVOQSOCIAL: Same updating behaviour for Messages and Notification in Messages page.. 1st way to repro this: 1) Create a new page using all the defaults. 2) This creates an empty page with empty html module 3) The module title this empty html module is \"Enter Title\" 4) Do not change title, simply add something in content, Horse and save 2nd way 1) On any existing page (apart from the above created), drop Html module 2) Observe the name of the Html module, it will be \"Html Text\" 3) Do not change the module title, instead update it's content, Lion 1) After any of the above two, run Site Crawler or wait for it to kick off (after 1 minute) 2) Perform search on skin object (top right hand corner) or Search Results module - do search on both Horse and then on Lion Expected 1) Do not show \" Enter Title\" or \" Html Text\" in Search Results. Instead just show the page title. Actual 1) It shows \"Page Title Enter Title\" or \"Page Title Html Text\" This has come up in Community a number of times. Here is the latest thread:. EVOQSOCIAL: Private Registration: Notification does not allow CM Moderators to the user. Currently the UserSearch in DNN does not index Username or Email address. We should capture that so they can be searched upon. They should both by default be restricted to Admins or the Users him her self only. We should also try to enhance the current logic where everything is being dumped in instead we should use custom keywords so at the time of querying structured data can be retrieved. There are few dates that can also be added in the SearchDocument Date User was created). This information can be used when someone uses the SearchAPIs to perform custom queries and sorting.. EvoqSocial: User Search - Include Email and Username while Indexing. displayed in Journal Module.. AUTO: The page deleted with an error. SI Search Exception Related to URL. We have number of parameters in both the SearchDocument and SearchQuery objects (such as ModuleId, ModuleDefId, TabId, However, we don't have GroupId. In a environment, modules usually have just one instance of themselve, but the data has additional property of GroupId to segmenet them from one group to the other. Usually groupId is upplied via query string parameter. Lack of groupid in these objects causes items to be searchable from all the groups. Note: The groupid should be saved or searched only when it's 0 (have a look at code around in method) Unit tests must be written (copy paste change from others). The Console module should use a copy on all pages (except the main Activity Stream one) so it is easier to change settings across multiple instances. Note: We will not handle upgrade scenarios for this because it is too invasive. Testing Notes: - Login as an admin or super user. - Go to your profile page (the one w the Activity Stream journal on it) - Edit the module settings for the console module, change it to show small icons - Go to any other page shown there (friends, messages, my profile) and verify it shows the icon on all those pages - Admin page also uses console module - it's setting should not be changed,. A comment with security level 'Developers' was removed.. ", "contenttype": "application/json", "created": 737603, "id": 25, "language": "en", "user_name": "ashish.prasad"}]}