{"contentItems": [{"content": "Run the sample code below in the Windows emulator. (I used the Emulator WVGA 4 inch RESULTS: Application does not display any content a black screen. OTHER INFO: The addTab method works. The console outputs that the tabs were added to the tabGroup object.. ENVIRONMENT Mac OS X Ti CLI: Titanium SDK Android Genymotion emulator, Google Nexus 7 - - API 19 - 800x1280 iOS Xcode iPhone 6+ simulator REPRODUCTION: Run the code below in the iOS simulator and Genymotion emulator using TiSDK ACTUAL RESULTS: The label with the attributed string does not match the second label. See the screenshots. EXPECTED RESULTS: Both labels should match. See the screenshots. OTHER INFO: Using with the iOS namespace works with but has the same results with Change to and to. REPRODUCTION: Build the application using a master version of the Titanium SDK and run in the Genymotion emulator. Click the 'Add Notification' button. Back out of the application till it closes. Wait 30s for the notification to trigger. RESULTS: When the service tries to call the method it throws an exception. OTHER INFO: If you hit the home button instead to close the application, the notification works. If you remove the notify call from the service, the service runs OK. This works fine with and. REPRODUCTION: 1. Create a new Arrow application. 2. Publish the Arrow application. 3. Unpublish the Arrow application. RESULTS: When the toast notification appears, the app name is prefixed with 'P '. EXPECTED RESULTS: App name should appear without the 'P '.. Grab Release Notes from Platform docs instead of Titanium docs. Latest Beta OS X Installer Shows folder. MobileIron and AirWatch publish options are disabled for non-iOS apps. ENVIRONMENT: Appcelerator Studio, build: Appcelerator Mobile Iron Integration Mac OS X CLI version Titanium SDK version REPRODUCTION: Package an application for MobileIron with an Android target RESULTS: Application builds and a package is created, but fails to upload to MobileIron. Studio displays the following alert dialog message: No message body writer has been found for response class. ENVIRONMENT: Appcelerator Studio, build: Appcelerator Mobile Iron Integration Mac OS X CLI version Titanium SDK version REPRODUCTION: Package an application for the Android App Store. Package an application for MobileIron with an Android target RESULTS: Packaging for MobileIron with an Android target fails with the following alert dialog message: Attribute ATTR MINIFY is not of type boolean. OTHER INFO: Initially was testing to make sure that packaging for the Android App Store worked. When packaging earlier for MobileIron with an Android target, the command was putting the keystore password in for the alias option. Restarting Studio had no effect, but switching workspaces did.. ENVIRONMENT: Titanium Studio, build: Mac OS X REPRODUCTION: Open the Preferences dialog. Click on either General Appearance or Titanium Themes. RESULTS: Receive the following error: \"The currently displayed page contains invalid (See first screen Try to click on the same items again (may need to click off the item first) and the Preference page displays an empty drop-down. (See second and third screen. my bad. was using an ti cli.. ENVIRONMENT: Mac OS X Appcelerator Studio, build: Titanium SDK Version: and REPRODUCTION: Launch the default project in an emulator that is not your default emulator using the Ti SDK. EXPECTED RESULTS: Application should launch on the selected emulator. ACTUAL RESULTS: Application launches on the emulator that is selected as the default. This works as expected with the latest TiSDK. Same results when using the Run Configurations dialog. When selecting an emulator to use the Code Profiler on, it always selects the default one.. ENVIRONMENT: Mac OS X Appcelerator Studio, build: REPRODUCTION: 1. From the menu bar, select New Mobile Project. 2. In the wizard, select any template and click next. 3. Deselect a few deployment targets. 4. Change the Titanium SDK version. EXPECTED RESULTS: Deselected targets stay deselected. ACTUAL RESULTS: All targets are selected.. Alloy: Missing some items in the markup and controller code for content assist. ", "contenttype": "application/json", "created": 737358, "id": 85, "language": "en", "user_name": "bhatfield", "email": "bhatfield@appcelerator.com"}]}