{"contentItems": [{"content": "Folder should be automatically generated if not exist.. Validated with build 105 and Engage and works fine: ( ) Delete \"Templates\" folder and tried export page Folder Templates will be generated automatically. Regression ( ) Site export ( ) Export page to different folders ( ) Import page and create a new page based on the template.. Noticed when testing for CK editor and I believe the workflow is missing here. I remember it was fixed back to couple weeks Based on the feedback from Behzad, looks like it only happens on Cloud, not with local install. - Log in as Host, - Go create a new page or activate an editor editing mode and add some words. Result: There is no Publish button showing up, only \"Close\" button. Expected: As default workflow, it should display \"Publish\" button in front of \"Close\" button.. +underlined text+. Exporting Site Fails in. If Codeplex CkEditor is in place and you upgrade to HTML Editor breaks. we have a new skin should be tested against and as well as the old one.. Upgrade to latest Platform 8 build (I am using 540), (Upgrade from Log in as Go In the tab click to expand Set AND s to use Basic Actual Result: The drop downs for all the are empty See. Please review CK Editor Brand Name Component Name, and consistent spelling everywhere. Just from the license agreement, I see different way to describe the brand name and component name, can we make them the same? - DNNConnect - DNN-Connect -CKEditor Provider. First time load File Management get unavailable errors.. Validated with Content840054, it looks fine now, same on platform build 096. Validated in build 599, works as expected. Issue could be closed. Just aware of one question, waiting for response from Joe. It is about the definition of \"EditMode\". If log in as a common RU, but has permission to edit the module, The should display \"True\" or \"False\"? Current Result: it displays \"False\" even when the RU trying to edit the module. Meanwhile as Host Admin user, the EditMode always displays \"True\". EditMode more like: Editable. I was using local installed Content with Chrome Pre-Condition: In host Host Settings Advanced Settings Client Resource Management, turn on \"Enable Composite Files\", \"Minify CSS\" and \"Minify JS\". Update the settings and then also click on \"Increment Version\". Steps: - Goto to home page, and edit this page. - Click in to any one of HTML editor and bring up the \"Advanced Editor\". Result: The UI already messed up If you click on \"Basic Text Box\" (looks ok), and click back on \"Rich Text Editor\", you will see the page keeps loading without display properly. Error in console:. Cloned from DNN-6186. It is fixed in platform but obviously more work to do in Content & Engage. With updated steps: Log in as Host, create a new page \"Test\". Set up the start time and end time for this page. (need to make it expired) Register a new user: RU1 and put it in \"Translator\" role. Assign the new page \"Test\" to allow \"Translator\" to edit and add content. Create a Personalized Page, and add a rule for user \"Translator\" and publish it. Log out host and log in as RU1, before the page expired, and the page shall be visible for Ru1 and editable. Wait till the page expired, and visit the page again. Result: The page still editable, but display: You do not have access to view this page within the website. Expected: For any user has edit permission on the master page, the page shall always visible and editable even it is expired.. Expired master page shall be still visible to users who have edit permissions. ( ) Validate on latest platform build 790, it works fine now. (x) Upgraded from previous failed build and works fine. Need to perform some testing per George suggested. Details will be coming soon in this sprint.. Noticed in environment: with IE 11 Steps: - Log in as user Host - Copy a \"News\" Page, and work on that new page in edit mode - In Dnn TopPane, I added one Content Layout(CL) module - this CL module into on to the very top of the pane. - Click on the \"Moving\" icon of the CL module, and select \"Down\" menu item. Result: error: Unable to get property 'top' of undefined or null reference. related to DNN-6554? - Log in as Host, browse to Admin Site Setting. - Simply click on \"Save\" button. Exception noticed in log file: - Object reference not set to an instance of an object. at telerikControl, String String controlName, String - Object reference not set to an instance of an object. at telerikControl, String String controlName, String - Object reference not set to an instance of an object. at telerikControl, String String controlName, String - Object reference not set to an instance of an object. at telerikControl, String String controlName, String - error has Couldn't load menu style Value cannot be null. Parameter name: path1 at path1, String path2) at path, RelativeTo roots) at menuStyle) at menuStyle) at e)\" - Object reference not set to an instance of an object. at telerikControl, String String controlName, String. But it works fine with local install. This site installed with Content Basic - Log in as Host - Goto Host Site Management to create a new child portal - Provide a name, and leave all default values, Create Site Result: - First of all, it takes very long time for the creation. - After created, there is a pop-up window but without alert message, which also should provide a link allow user to browse to the new portal site. - Wait for a while, it will be re-directed to the child portal automatically, sometimes with error like: the resource you are looking for doesn't exist. (not happen always). Create Child portal on Azurewebsite failed (UI response failed). Probably already fixed.. It happens on windows Azure websites Didn't see Platform & Content. Looks like it is progress UI issue. Site is installed and launchable. Pre-condition: - all credential required for (ask Bing or QA if you don't have one) - Create a new site & DB for installation testing General Steps: - Start installation process by wizard - Provide proper DB connection & user account which is set up in - Continue the installation to observe the progress bar Result: It stops 29% Installing Library - Check the Installation log file, no detected, and the last line in log is: Activating License So the site actually installed, but because of some response time-out reason (I guess), the progress UI got frozen. Expected: The installation progress bar shall re-try always to pick-up the status.. Unauthenticated Cacheability is by default set to expected? Please be aware, we changed default settings or customer's settings.. Exceptions displayed when Cancel a Language Pack installation. Some 3rd-party skins installation failed if upgraded from finally cause browser crash.. Noticed this in following scenario with 3rd-party skin, for instance(not all of them, but some of 3rd-party skins): & Software & 3rd Party Skins If clean install of PE FAILED If the app is upgrade from PE to PE FAILED If clean install of PE PASS Looks like the issue somehow fixed in but not for upgrading scenario. The symptom is, after pick up the skin zip file, and click \"Go Next\", the user will see a blank 500 error page. Screenshot attached. Or error like this: I was using IE 11, and when I try to do the same installation again, the IE browser crashed.. Perform an upgrading test and validate if the module versions updated accordingly.. Validated with Engage build I can see the still in the css file after Enable Composite Files and Minify CSS, inline images displayed properly. Close as it is.. With new UI design and new format in Platform home page, I don't think the behavior still the same as Content (the old UI) Preconditions: - Login as a host; - Create a new Page; - On Control Panel click on Modules Add Existing Module option; - Select a Home Page (the new UI) - Tick Make a Copy checkbox; - Select HTML module one by one and Drag & Drop a Module to Content Pane. Result: The contents of the html module are all there, but obviously the style sheet or the template is different. Comparing to the same test against PE with old UI, and make a copy of the existing HTML module on home page, the images size, position, URL link, font & font size, all the same. Is this behavior in Platform (with new Home page) expected? Or the new Home page is a special case? It might be only related to the new Home page, but I can't continue with more investigation, since it is blocked by another defect: DNN-5406. Not repro in neither from control menu Pages add new page Steps: - Log in as Admin or Host - On Control Panel click Admin option; - Select Page Management option; - Hover over My Website folder, right-click on it. - Click on Add Page button to open corresponding input; - Fill required info; - Click on Create Page(s) button. Result: There would be couple (6) Fatal error msgs in log file: - (0x80004005): This is an invalid webresource request. at context) step, Boolean& Not sure about this error about, and I can still continue to create a page, just quite noisy and would like to know the root cause.. - Log in as host - Add a new page \"testpage\" - Goto Modules Add New Module to bring up the module control panel - In input area, input character \"d\" - then Drag one of the module and swipe to very left and very right for couple times - Try to use scroll bar to the very right-end, and pick up one module at the end of the list. Result: see attachment. Some modules will still in the hidden (invisible) area of the module list, and won't be able to be picked. The scroll-bar calculation somehow goes wrong. I also randomly encountered situation, the drag ans swipe stop working as well with IE 11.. Noticed this in Cloud environment, but I believe It is a regression since it doesn't happen in and probably brought in by Control Bar Add Module Scrolling (CONTENT-2319) or module filtering changes. Steps: - Log in as host - Goto any page - Click Modules Add New Module - In the Module filtering list box, click the Drop-down arrow icon button. Result: It won't work. But it works in But if click on the list box, it still fine.. Be careful about GetUserById. I remember something changed in this sprint.. Noticed this in custom CE build - Log in as Host, create a new page - Goto Edit Page Page Permissions - Preset permission for All Users to View Pages. Update the changes. - Publish this page Result: The page won't be visible. Expected: Publish page shall overwrite the permission with \"allowed\" permission. Attach here with error log: - (0x80131904): Cannot insert duplicate key row in object with unique index The duplicate key value is (93, 3, -1, ). The statement has been terminated. at exception, Boolean Action`1 at stateObj, Boolean Boolean asyncClose) at runBehavior, SqlCommand cmdHandler, SqlDataReader dataStream, stateObj, Boolean& dataReady) at ds, RunBehavior runBehavior, String at cmdBehavior, RunBehavior runBehavior, Boolean returnStream, Boolean async, Int32 timeout, Task& task, Boolean asyncWrite) at cmdBehavior, RunBehavior runBehavior, Boolean returnStream, String method, completion, Int32 timeout, Task& task, Boolean asyncWrite) at cmdBehavior, RunBehavior runBehavior, Boolean returnStream, String method) sql, Object args) at CommandType type, String sql, Object args) at tabId, Int32 permissionId, Int32 roleID, Boolean allowAccess, Int32 userId, Int32 at tab) at tab) at tabID, Int32 portalID) , Object , Object ) at instance, Object at instance, Object arguments) at func,. DAM: Firefox: UI: List content doesn't expand to whole right pane after user log in out. The Fatal error on the page creation Steps to reproduce: 1. Install the latest DNN 2. Login as Host 3. Go to Pages - Add New Page 4. Add a new Page named MC 5. Go to 6. Look into. Build used: - Log in as Host - Goto HOST SQL to open new SQL module - Pick up a bigger file to load. ( I picked up a pdf file to observe clearly) - Click on Load File button - Click on Run Script Button after loading Result: While it trying to uting the SQL (but wrong format) and running(it will take some seconds), a page with button will be displayed. (screencopy attached) Expected: While waiting for the uting results, UI shall be consistent. * Sometimes, even when keep clicking \"Load File\" button also can see the page with button. The fix of the DNN-23417 have restored all functionality (inline editing) with old UI (Icons). Old icons contradict the existing UI Style and should be changed, or the fix of DNN-23417 should be roll back (at least for a while). Steps to reproduce: 1. Install the latest DNN 2. Login as Host 3. Go to Page Edit mode 4. Hover over any HTML modules title Actual result: Old edit button is displayed (attached: Expected result: All Buttons are in the excepted style 5. Click on the Edit inline Icon Actual result: Old edit button is displayed (attached: Expected result: All Buttons are in the excepted style 6. Hover over any HTML modules content Actual result: Old edit button is displayed (attached: Expected result: All Buttons are in the excepted style. ", "contenttype": "application/json", "created": 737358, "id": 27, "language": "en", "user_name": "bing.wu", "email": "-"}]}