{"contentItems": [{"content": "Html Editor Image Manager buttons incorrect. +Background+ For good results on repeat requests, web browsers need to be able to act on 304 response codes given out by the server. This task is to ensure that static files in a site are responding with 304 status codes in all test cases. +Requirements+ All resources should be returning 304 as per the in slow, including any used in Test results should include YSlow details on 304 status and checks from Fiddler or similar to show all built in and user-added resources returning the correct http status.. +Background+ The file contains a series of regex expressions which provide basic rewriting functions in the Url Rewriting process. These have been around since the introduction of the first url rewriting in Dnn This task is to test and determine if these rewriting rules are required in a new, standard installation. The purpose is to eliminate the loading, reading and iterative ution of the regex expressions if they are not needed for a base case. The file will need to be kept for legacy installations and where customers have modified the file. The purpose is to eliminate the ution of uncompiled regex expressions found in the file. +Requirements+ The support of legacy Urls is no longer part of the requirements of a new installation. People with older sites who still need to these will not have a site modified on upgrade. * If it is possible to ship a site with an empty site file, then the installation should not drop into that part of the processing during the url rewriting process.. Log in as either HOST or Admin to Azure Websites based site Go Admin Page Management Click on any existing page Change the page name and save Actual Result: At least 6 404 errors on when the page detail loads in the UI: GET 404 (Not Found) GET 404 (Not Found) GET 404 (Not Found) GET 404 (Not Found) GET 404 (Not Found) GET 404 (Not Found) GET 404 (Not Found). SI : User Interface allowing Host Admins to adjust the expiration date for registration tokens. Creation of a one-page site template for DNN Platform installations. +Requirements+ Skin associated with site only, not specified in home page settings Template only includes a home page, 404 page, search results and user profile pages. search results page to remain, but to use the same default site skin (not a page specific skin) New home page must be optimized to load fast (image Ideally we want to see an improvement in load speed switching from the Awesome Cycles site template. * Text for links, images and rollover text is in the DNN Platform Home Page sheet. This will need to be translated for each language available. The new home page design looks as follows:. +As a user of the site, I want a simple, searchable and usable control to select files so that the page responds quickly and I dont have to work through a very long drop-down list to find a file+ h2. Conversation All file selections in DNN use a File Drop down, which is unwieldy and slow when the number of files in a folder increases. This change will replace the use of drop-downs for file selection with a file picker in the same pattern as the folder and page pickers already developed. Above : New File Picker control h2. Confirmation File picker includes search box File picker lazy loads the data File picker uses same presentation and similar logic to the existing page and folder picker controls. h3. File Picker - Replacement Locations - The changes will be made in the control - In the FileRow container of where the existing file folder pickers will be replaced with the control. - In the dnnExport container of - In the container of Control Id of container Type FileRow Folder File Picker Uploader dnnExport Folder File Picker Folder File Picker dnnEditSkins Folder File Picker dnnViewSource File rowFile1 File picker (no folder) cboFiles File picker (no folder) Any other areas of the application or modules where a file picker is found should be raised the default will be to replace any file drop down with the new picker control, unless there is a compelling reason not to.. Creating a URL with a different portal alias to the primary alias always returns the home page. Test 1. Add a second domain to a site as a portal alias 2. Go to a dnn page (ie, about-us) and go to the page settings 3. Open the Advanced Urls section 4. Add a new URL 5. Set the site alias to the second (non-primary) alias created in step (1) 6. Do not enter a page path 7. Save the URL 8. Update the Page 9. Request the new domain Expected Results - New domain shows the page Actual Results - New Domain shows the home page of the portal. The setting should have a default value as follows: This prevents rewriting of Urls that match those patterns. The current value is This causes any Web API calls which are not case sensitive to fail because they are rewritten. By including , this also allows for any custom service calls written for third party modules.. ", "contenttype": "application/json", "created": 737358, "id": 20, "language": "en", "user_name": "brucerchapman", "email": "-"}]}