{"contentItems": [{"content": "At present in the translation process there is this manual step: Ad 7. Fix language packs for Platform (CE) In the language packs for Platform (Community), the resx file for the default portal template needs to be replaced by one that belongs to Platform. The file name is Default We should update the platform code to allow for templates to be included for all editions (evoq and the drop-down will filter out templates platform will not show content engage templates By doing this it makes it easier for translators to see changes in templates, and for DNN Corp to ensure that relevant templates are available. Note: another option is for DNN Corp to delete templates from edition specific packs Update: decision was made to include all the templates and then delete the unneeded ones when creating the language pack. EVOQCONTENT : Site skin is updated unexpectedly when working with non-english language. change default biography field to be a multi-line text box. During development a lot of optimisation work was undertaken. This involved many facets including reducing viewstate, pagesize and removing unnecessary script registration. As part of this work jquery-migrate was no longer registered for a default anonymous page viewer as it was not needed - however post release it became apparent that some skin and module developers were relying on jquery-migrate being registered (rather than registering it within their skin module). Whilst this is easily fixed by adding the relevant registration (or using the jquery skin object), we decided to add a registration for jquery-migrate to help with sites running skins modules that relied on this dependency existing users would not need to get updated versions of their components). To fulfil this requirement the additional registration was added to the legacy API method. A bug has been found that affects old installs of DNN that are missing the attribute. accepted a pull request which allows host's to change the maximum upload size and it appears that is missing some defensive coding to handle the case where this value does not exist. Exception looks like: The MaximumValue 0 cannot be less than the MinimumValue 1 of The MaximumValue 0 cannot be less than the MinimumValue 1 of at e) Boolean End of inner exception stack trace see for more. advanced search tags allow html script and can break rendering. when upgrading from the following exception is thrown - it appears we have a packaging issue The files and use a different language, which is not allowed since they need to be compiled together. Description: An unhandled exception occurred during the ution of the current web request. Please review the stack trace for more information about the error and where it originated in the code. Exception Details: The files and use a different language, which is not allowed since they need to be compiled together. Source Error: An unhandled exception was generated during the ution of the current web request. Information regarding the origin and location of the exception can be identified using the exception stack trace below. Stack Trace: HttpException (0x80004005): The files and use a different language, which is not allowed since they need to be compiled +628 +44 virtualDir, dirType, String assemblyName, StringSet Boolean +692 virtualDir, dirType, String assemblyName, StringSet +175 +498 +641 HttpException (0x80004005): The files and use a different language, which is not allowed since they need to be compiled +80 +1142 appManager, appHost, PolicyLevel policyLevel, Exception +1193 HttpException (0x80004005): The files and use a different language, which is not allowed since they need to be compiled context) +12966756 context) +159 wr, HttpContext context) +12806561. Missing functionality in Search Admin (de-DE). add panel to host - advanced settings create user control add simple file upload control to replace the data add textbox to allow entry of an IP and return the data associated with that add label to display the location, name and date of the GeoIP data file (reading from file). Add the database into App Data & Include the license file in Licenses and in file create file to contain the version date of the geoip file. ", "contenttype": "application/json", "created": 737358, "id": 34, "language": "en", "user_name": "cathal", "email": "-"}]}