{"contentItems": [{"content": "Proposed solution to \"Parent path doesn't exist\". Add more Javascript formatter options for comments. JS editor does not color words `this` and `arguments` in Aptana Studio theme. h3. Steps to Reproduce Open example in JS editor: h3. Actual Result Words `this` and `arguments` are not colored (there is no color difference between local variables `method`, `args` and special words `this`, `arguments`). h3. Expected Result Words `this` and `arguments` should be colored (differ from other JS text).. Not changing perspective when PHP debug terminates.. Although in the system preferences you can choose to switch perspectives when the php debugging session has terminated it doesn't seem to do so. Is this a bug that's already being looked at? I couldn't find an issue that's similar. Steps to reproduce: 1. Edit php debugging preferences ( Preferences Aptana Editors PHP Debug ) 2. Run a PHP Debugging session. Expected result: At the end of a Debugging session studio should honor debugging preferences (change view or prompt as selected). Actual result: Preferences don't currently trigger any changes.. Debugger: Rapid use of the toggle breakpoint shortcut key creates duplicate entries.. Chris, Is there anything for me to test here?. When I configure an external editor for any extension in Aptana Studio (ie. .po, launching of the other editor is functional until I start a new Aptana Studio instance. After I quit from Aptana Studio and run Aptana Studio again, I click on a file and it will not open the external editor and the following error dialog appears: If I reconfigure the editors for the extension again (delete editor and add it again), this will be functional until the next restart of Aptana Studio.. Commenting lines with Ctrl+ removes carriage return in line breaks. When commenting a series of lines with Ctrl+ the editor uses Linux line breaks regardless of the style of line breaks chosen for the rest of the file or the default configuration. Steps to reproduce: 1. Turn Whitespace characters on (Prefences General Editors Text Editors Whitespace) 2. Create a file that uses carrage returns in it's line breaks. 3. Type some text with a few line breaks 4. Comment them with the keyboard shortcut (ctrl cmd + ) Expected results: The lines should comment without changing the line returns Actual results: The line terminators change to Linux style regardless of setting.. I used to work with Zend Studio where it was possible to go to the definition for constants using hyper-linking \"ctrl+click\" (as for functions, vars, I switched to Aptana studio and customized my way well except on this point. Does anyone knows if it's possible to manage PHP constants in Aptana the same way as with Zend Studio? Originally from StackOverflow: Steps to reproduce: 1. Create two php files in the same PHP project: 2. Hold Ctrl and hovering over the TEST CONST1 in 3. Click link. Actual result: No link appears. Expected Result: Clicking that link opens on line 3.. The problem is that when I git commit with comments in Japanese, I get an unreadable return by git log on (I can read in aptana studio history window but it is unreadable by other tools). Also, one repository that was make another machine and it has commit message in I Pull to Aptana Studio and the history is unreadable. Steps to reproduce: 1. Create a project that is initialized for git 2. Create a file and commit it. 3. Add a commit message in Japanese. Ex. 4. In the project terminal run git log Expected result: The git log should display without error. Actual result: The git log is unreadable.. Scenario: You have several tabs open, and the cursor focus is somewhere within the \"Find\" toolbar that appears at the bottom of the screen (shortcut Cmd+F). Steps to reproduce: 1. Open a file in the studio editor. 2. Open the find toolbar (CMD+F). 3. With focus in the toolbar press CMD+tab. Expected behavior: User should be able to use OS keyboard shortcuts while in Studio. Actual behavior: Keyboard shortcuts do no work while focus is on the find toolbar. Note: This also happens for the Open Resource shortcut (CMD+T) and the Close Window shortcut (CMD+W).. The editor find toolbar interrupts certain keyboard shortcuts. An internal error occurred during: \"Label Job\".. I get the same response in Titanium Studio, build:. While testing \"Build Acceptance Android Only\", I attempted to build a default Titanium Mobile app (just the standard template) and I encounter the following problem: I check and the $JAVA HOME is correctly set and running echo $JAVA HOME in the titanium console gives the correct PATH. Studio should check for the JAVA HOME before beginning a build, and if it is missing passing it into the build. This issue is a not a regression since the bug is due to a user of JAVA HOME. Steps used to reproduce: 1. Insure that the $JAVA HOME global variable is set ( ls -R $JAVA HOME ). 2. Create a new Titanium Mobile Project. 3. Create a signing key. 4. Package for Distribution (Package Distribute - Android App Store) Expected result: Android correctly packages and a package file is created in the specified place. Actual result: The packager gets to where it can not find java as $JAVA HOME isn't available to it. Tested by multiple sources on Titanium Studio build and on both Ubuntu and using SDK replicated the same failure. Switching back to SDK fixes the issue in all studio platforms. Updated ticket to be an improvement for. Local variables do not appear in content assist. This is a regression issue (did not appear in Steps to reproduce: 1. In a JavaScript file enter: 2. Invoke content assist after the my on the unfinished line. Expected results: Content assist should suggest myFunction and myParam as options. Actual results: Content assist shows only myFunction as an option. First reported in .. No way to log out of Jira account for \"Submit a ticket\". Once logged into Jira inside Titanium Studio you cannot seem to log out and your name is retained between user logins. Steps to reproduce: 1. Log into Titanium Studio using one account. 2. Open Jira through the Help Titanium Studio Submit a ticket 3. Log into Jira via the top of the form and the validate button. 4. Log out of Titanium Studio. 5. Log into Titanium Studio using a second account. 6. Open Jira through the Help Titanium Studio Submit a ticket. Expected Result: Previous users Jira account should be cleared and the user should be prompted for username and password. Actual Result: The first user is still logged in with no way to log out.. The link to the Software licence agreement does not open the licence agreement when clicked. This did not happen in the installer. Not regression as this functionality is new. Steps to reproduce: 1. Download and run the installer. 2. When prompted for the licence agreement click the link. Expected Results: The licence agreement will open in another window for reading. Actual Results: Nothing happens.. Precondition: FTP setup should be done. ( Connection Manager should have a FTP connection. Test Steps: a Titanium Project and link the FTP connection from above. Project Explorer, open the Connections node of the project with the FTP connection. Connection window by doing double click on the FTP connection listed in the project's connections node (Project connection connection site) click OPEN on any file available on SOURCE side. Expected Result: File should be opened in the correct Titanium Studio editor. Actual Result: error is coming when opening a file Screenshot and logs attached.. ", "contenttype": "application/json", "created": 737603, "id": 39, "language": "en", "user_name": "cheadley", "email": "cheadley@shastaqa.com"}]}