{"contentItems": [{"content": "Cache for performance reasons. I can reproduce this in both and in both clean install and upgrade scenarios This used to work I verified that is true for and. Re testet on build 2626. language is now in the url, but the page url is not used for the second language (with and without content localization enabled). Hot fixes for DNN6 and DNN7 available at. So in which are you seeing this issue?. Good idea, moved to core tracker.. I can Open the Settings of the Razor Module for adding scripts but Still the Error is in the View Control. I was bit by the copy paste bug. The corrected entries are not 100% valid. The ALTER statements are not using the replacement values, and . The items in bold are the key elements to address this issue. So, the ALTER statements in the original entries are correct and the WHERE clause in my edits are correct. IF NOT EXISTS ( AND TABLE UserRolesADD IsOwner bit NOT NULL CONSTRAINT DEFAULT 0ENDGO. SI: RadAsyncUpload conflicts with. does this button only needed in Modules list, or need on all list, such as Auth system, providers, languages, etc?. Issue is reproductible in DNN CTPThanks for. Ash, please have a dev to take a look at this issue.. We need to use Edit Skin. Closed as there is an apparent lack of interest in this issue. If you would like it reconsidered please create a new item in the User Voice page on (. Closed as there is an apparent lack of interest in this issue. If you would like it reconsidered please create a new item in the User Voice page on (. Closed as there is an apparent lack of interest in this issue. If you would like it reconsidered please create a new item in the User Voice page on (. Issue is reproducible in CE. I use Telerik controls without the wrappers and the styling isn&apos;t loading properly when there is this on this page: &lt;link id \"IE\" type \"text css\" &gt; Link tags CAN NOT have and id attribute in them. Otherwise all other links will be ignored. Please see the following for the reasoning: Please remove the id \"IE\" and the styling will return.. The skin doesn&apos;t contains breadcrumb control. Need UI to check where is the right place to add this control.. Hi Israel, Can you please confirm we should do this. Seems simple enough.. This code is in so after UPGRADE from to 7 the Search box will retain its visibility We use this code in to fix the issue with the Search box becoming invisible after upgrade :). Module Permission An user can do actions that he she should not do. Skin Upgrade Tabs are not shown properly. This only works if Content Localization is enabled - it is not neccessary when Content Localization is not enabled as the flags switch the UICulture. Now - it is true that we should probably not display the combo if Content Localization is not enabled, but this is pre-existing - it also doesn&apos;t work in. \"Switch Languages\" Drop Down List in Control Panel does not work. User cannot login with Username that begins with the symbol \"\". Closed as there is an apparent lack of interest in this issue. If you would like it reconsidered please create a new item in the User Voice page on (. What&apos;s your motivation for this? Why do you need a separate package for DNN 6 &amp; DNN 7?. Verified in CE. Issue does not say but I&apos;m assuming this was found in release Verified as reproducible in Screen Cast:. Closed as there is an apparent lack of interest in this issue. If you would like it reconsidered please create a new item in the User Voice page on (. Add configurable list of extensions and contenttypes. We decided this would be done for. Error Social Groups. should auto-configure be a one time only operation we add a check for the pages and if they&apos;re there we dont show the button. Spoke with Shaun to set the scope We will add the setting and persist it and ensure it gets passed to the Navigation Providers. However, we will not go through all the providers and ensure that they are using the new setting.. Pre-existing issue - not related to Moving to. So why ask them if they want to delete this page when it turns out this is a special page and user shouldn&apos;t have been asked if they were sure they wanted to delete in the first? Israel, what do you think?. Improve Delete Special Page Experience. Closing as does not seem to be getting any traction. If you would like to add this feature, please add it to Community Voice module on. The refactoring for already removed the regex test, so cannot repro in. ;this is brought to our attention by a customer, this is the ticket:. SI: Multiline DataType breaks user profile view. Issue can be reproduced in and. This is a good idea, but we can fix this after. Hi John: I need more information: steps to reproduce. Could you please list (in very detailed steps) the exact actions you performed and at which step the issue occured? Could you please attached screenshots if possible? Thanks, Mohit. Can you give more information about step 3 \"Go to Admin &gt; User Accounts &gt; Profile properties and add Dutch translation to the profile properties, for instance to How to get to Profile Properties in User Accounts? In module setting for User Accounts? Could you provide step by step information?. My website has 9 languages. And it seems that Google Panda thinks that the site has duplicate content and regards it therefore more \"spammy\". Google allows to indicate that you have intended duplicate content. That can be done through the sitemap as described by the previous URL of the original submitter of this enhancement. The same functionality can also be generated per html page, as described in Advantage is that it is also easier for real users (instead of GoogleBot) to navigate to another language since the page semantic structure reflects the presence of the same content in other languages. As an alternative, the following module seems to provide this functionality already:. I strongly disagree that this is a The system will still, eventually, show you a time out if you reach that point in the upload process This is a request for an marking as such and assigning to PM. user posted an excellent analysis of this at . Based on that I&apos;d suggest we consider this for a release sooner rather than later. This was reported as bug to Form and List, it would be nice if someone will comment on it when this is is fixed.. So if you use a or template with roles that are not set to apprvoed in the template their status remains after the template is imported. Given our current don&apos;t change anything previously set, is this not \"By Design\"?. we can reference the css file in class, will this handle in 703?. This issue cannot be reproduced in CE Could you please reproduce it in CE. Chris P, can you please take a look and see if this fits in well with the current content items implementation?. Verifed - but Charles should have the final call in his architect role. Except the issue pointed out, I suspect that there are some stored procedures and tables, which are obsolete and have not been updated as appropriate. I think we need to serialize all portal settings, in a generic way.. The core has the ability to ute code on all version upgrades in addition to the version specific upgrades. This enhancement will provide the option for IUpgradable on modules to ute code on a new Install and or any upgrade, by adding the \"Install\" and \"Upgrade\". \"Install\" - will ute on any new Install \"Upgrade\" will ute on any all upgrades regardless of whether the current version and the new version are different. As the \"Upgrade\" pseudo-version code will ute on any all upgrades it must be re-entrant.. h2. Card As an user, I want to have display view templates for all of the default installed content types. h2. Conversation We will need a \"layout\" for the Employee and Product Content Types h2. Confirmation. After an internal review of the API it was decided to modify the AJAX utility methods and the structure of the returned JSON as follows. Remove the data object - if a single object return the object directly, if returning a paged array return a results object and a total object only In addition add PUT and DELETE HTTP verb methods to the utility library.. h2. Card As developer, I want to be able to create simple templates which are used to view and edit content fields. h2. Conversation This system should mirror the system used by the MVC framework. By default, all editor templates will be stored in and all display templates will be stored in Global templates will be placed under while portal specific templates will go into the specific portals folders. The DCC will follow the naming convention for MVC. The Data Type name will be used to identify the associated display template or editor template. It will look in the Portal specific folder and then the global folder for a template that matches the type name. If a template is not found then the system should look for a template matching the base type name. To ensure optimum performance and minimize disk IO, the system should cache all editor and display templates. h2. Confirmation Brad Wilson provides some examples from MVC 2. Note the last paragrah will be implemented as part of the related issue which deals with the main View. It is not strictly part of the Quick Settings view itself.. This was due to a css z-index issue, which after the UI redesign is no longer present. Can no longer Reproduce.. Add default Global DataTypes. Some global dataTypes need to be created for the DCC Rich Text Integer True False Date. The default DNN Solution is configured to use IIS. This requires a developer to have a specific IIS website configured on their machine and to run Visual Studio as an Administrator. The solution should be updated to use IIS Express. This will allow the solution to be opened without requiring elevated priveleges and without special configuration.. The DCC manager should only show the language selector if there are more than one language in the site. The Dynamic Content Creator module should be added to the Admin menu for all portals in the system on of DNN 8.. AddEventLog has be identified as a perforemance bottleneck for logging in users. We can improve this by caching on the webserver the Event Log Configuration and adding a parameter to the sproc that determines whether notifications are to be sent, rather than making the database do the business logic calculation. Investigate and Improve AddEventLog. Steps: - Create a page from a dup of \"News\" through PB Manage Pages Duplicate page, but make sure the workflow set to \"Save Draft\" or \"Content Approval\" - After new page in place, it gets into edit mode. - At this moment, both Publish, Discard and Save button is available. - Click on \"Discard\", which equal to delete the page. (or delete the page from PB) - Then check out notifications in Tasks area. Result: There will be a notification regarding the new page is in \"draft\" status and waiting submission or approval. Expected: When the page is or the change is discarded, notifications should be purged as well.. Add support for Url Helpers. This has been submitted as a Pull Request. h2. Card As part of the MVC support the solution should support the use of Master Razor Layouts. h2. Conversation If a developer wants to use a \"Shared\" layout for their Module Views they should be able to use the following syntax There are other ways a Master Layout is defined - and these should optionaly be supported. when the View object is created in the Controller \"return View(\"Index\", \" Layout\", item) h2. Confirmation. Support Master Layouts. h2. Card As part of MVC support the solution should support the use of standard Action Filters. h2. Conversation DNN must support the following Action Filters Action - used to provide custom code before and after the ution of the action Exception - used to provide exception handling within an Action h2. Confirmation. Support Action Filters. This is not new to but pre-exist for long time. Scenario like this: - 2 RUs - TestRU1 and TestRU2, and set up to be friends each other. - Both users have avatar image uploaded - Both Avatar image all set with permission: Only visible by \"Friends and Groups Friends\". - Log in as 1 RU and browse to User Profile Friends list Expected: Friends Avatar image shall be visible. Result: If visible set as \"Friends and Groups Friends\", the image won't be visible. but still works if set for \"Public\". Exception thrown when host attempts to access Host File Management. Remove the Alpha Version in Website Title. several errors shown in console when add module. A few events were missed from the linked story. We need to ensure there are additional events for the following (most are for Content): - Group Role Created - Group Role Deleted - Group Role Joined - Group Role Left -. Sometimes when AUM determines there is a 301 redirect - it utes a This can save some processing but it shortcuts all the remaining events in the Page LifeCycle.. SI: Permission Problem in DNN Evoq after localization enabled. There are a lot of database calls when a registered user browses to the Edit User Profile page. Somewhere in the order of 45-50. Many of these are unnecessary. For example: 12 calls to * 3 calls to GetListEntries This happens on every page refresh for every user.. Improve Basic Page Performance - 4 - Reduce ViewState in Journal. Improve Basic Page Performance - 4 - Reduce Viewstate HTML in Member Directory. There is a small ammount of unneccessary ViewState rendered in the Member Directory which affects a number of profile pages. There is also unneccessary HTML rendered by the CDF. Improve Basic Page Performance - 4 - Analyse using Glimpse. Improve Basic Page Performance - 4 - Run baseline perf tests. Improve Basic Page Performance - 3 - Run baseline perf tests. File Picker Improvements - add Uploader support. File Picker Improvements - update locations. File Picker Improvements - enhanced file folder dropdown support.. The default page includes unneccessary js and css files - these can be reduced to reduce the number of files sent over the wire with CDF turned off. Remove registration of Dnn Plugins from Search skin object - it doesn't need it so why register it - this stops from being included from default page.. Improve Basic Page Performance - 2 - Glimpse Analysis. Improve Basic Page Performance - 2 - ANTS SQL Profiling. Improve Basic Page Performance - 1 - Glimpse Analysis. Improve Basic Page Performance - 1 - ANTS SQL Profiling. Improve Basic Page Performance - 1 - Measure Baseline Performance. Cleanup TabController API. We need to improve the performance of a basic page with HTML modules, when visited by Page Editors and Module Editors. This will test the impact of the Control Bar (with only a few features exposed). We will follow the overall guidelines for this scenario as described in the Epic.. We need to improve the performance of a basic page with HTML modules, when visited by regular Registered Users. For registered users there should be only a couple of calls to handle the info. We will follow the overall gudilines for this scenario as described in the Epic.. Improve Basic Page Performance - 1. We need to improve the performance of a basic page with HTML modules, when visited by Anonymous Users. For anonymous users there should be zero database calls (once the content has been cached) We will follow the overall gudilines for this scenario as described in the Epic.. Why do we need a JIRA issue for this? Each pull request needs its own JIRA. This appears to be just a placeholder so I am going to close it. PLease create a JIRA when you want to check in a particular API code comment. Thx. Folder Permission Open Files Deny does not work. This was handled by Pull Request 31, which I have code-reviewed and have integrated. This should be regressed by a second developer and closed.. h3. Card As a user I expect that the file uploader picker functionality and design be consistent throughout the DNN admin. h3. Conversation h3. Confirmation * Host Configuration Manager Configuration Merge Scripts Choose file. h3. Card As a user I expect that the file uploader picker functionality and design be consistent throughout the DNN admin. h3. Conversation h3. Confirmation Host Dashboard Install Dashboard Control * Host Host Settings Upload Skin Container. Agreed, Ben Will mark as Won't Fix.. h3. Card As a user I expect that the file uploader picker functionality and design be consistent throughout the DNN admin. h3. Conversation h3. Confirmation Admin Site Settings Basic Settings Appearance Body Background ( image uploader ). h3. Card As a user I expect that the file uploader picker functionality and design be consistent throughout the DNN admin. h3. Conversation h3. Confirmation * Control Panel Tools Upload File. h3. Card As a user I expect that the file uploader picker functionality and design be consistent throughout the DNN admin. h3. Conversation h3. Confirmation * Admin Languages Add new Language. h3. Card As a user I expect that the file uploader picker functionality and design be consistent throughout the DNN admin. h3. Conversation h3. Confirmation * User profile Manage Profile ( image uploader ). h3. Card As a user I expect that the file uploader picker functionality and design be consistent throughout the DNN admin. h3. Conversation h3. Confirmation Host File Management. Localization, syntax and spelling errors in beta. Add new SQL functions. There are a lot of situations (vw Portals, vw Tabs, vw Modules) where we have sql to identify the file path of an image or icon. This should be re-factored to create a new optimized Filepath function. Further there is SQL in vw Tabs that is used to determine a ChildTab, and SQL in vw Portals to determine the SuperTabId. Yjhese should also be extracted into functions. Note: This isue was extracted from Sebastian Leupold's turbo script.. If closed by using the \"close\" icon, then the getting started page should stay hidden until the user logs in again.. Hello, There seems to be an issue with URL encoding parameters. When I request for a query string in English it works fine, how ever if I request for a query string in Persian Arabic it returns a wrong value. English Example: Apple Apple Persian Example: Please use link below to view this issue in action: or download and install attached module to simulate it on your local machine. Thanks. In order to support using a dependency graph to install extensions in the correct order, we need to change how \"batch\" or \"auto\" extension installation works. All extensions will need to be scanned - the zip opened and the manifest parsed in order to build a dependency graph.. A new or existing type of event cannot be added to the Event Log Settings I ssue was introduced in We do not have all existing types of even listed in the Event Log Settings grid, before we can added a new one by clicking the Add New Item button on der the grid, but now we last the button Steps to reproduce: 1. Install the latest DNN 2. Login as Host 3. Go to Admin Event viewer 4. Click Edit Log Settings button 5. Try to add a new type of even to the event list Actual result: there is no way to add a new type of events; previously we had the Add new Item button Expected result: the Add New Item button is on the pop-up. Permissions can currently be configured for a variety of system resources: BROWSE defines if a user role can view the list of files in the folder WRITE full administrative rights to a folder ( also known as Full Control in the commercial platform ) MANAGE defines if a user role can Manage folder settings COPY defines if a user role can Copy a folder. In the event that a user role has been denied FULL CONTROL EDIT rights for a Page, it overrides all other individual permission settings for that user role, and modifying individual permissions will set FULL CONTROL EDIT to \"Not Specified\".. Update DNN where uploader is currently being used - SQL. h3. Card As a user I expect that the file uploader picker functionality and design be consistent throughout the DNN admin. h3. Conversation h3. Confirmation * Host SQL Choose File. SI: Digital Asset Management: when save folder permission as none host admin user. SI: Cannot edit user in fresh DNN environment (Conversion failed when converting the nvarchar value to data type int). Description: If a role user is granted or denied FULL CONTROL EDIT permission then all of other individual permissions in that row in the permissions grid will be set consistently and the system will not allow you to change any of their values. If the FULL CONTROL EDIT permission has NO permission setting, then the individual permissions in that row can be set independently. Steps to Reproduce: Set allow permissions on page: Full Control Now try to toggle the permissions for ANY other individual permission in that row in the permissions grid to a different value Actual Result: User IS able to modify the settings for individual permissions Expected Result: User is NOT able to modify the settings for individual permissions. Support side by side Installation. Code in SiteSettings needs to be updated to select the default alias for the sitemap url.. Create Module Creator Stories. Create Entity Properties PRD. Create Javascript Library Extension PRD. Develop Repackaging Plan. ", "contenttype": "application/json", "created": 737603, "id": 15, "language": "en", "user_name": "cnurse"}]}