{"contentItems": [{"content": "Ruby: Add check for pre-existing files to Ruby and Rails project wizards. Build Participation: file refresh required to unload task tags. If a project contains a large amount of JavaScript files (total number of bytes, rather than number of files), it will fail during the encryption process. : Failed to encrypt JavaScript files This is not a regression. Titanium SDK max size is 524,283 bytes. Titanium SDK max size is 017,688 bytes. Test Data: Titanium SDK Test File: bytes (attached) size Pass: 524,283 bytes Fail: 524,290 bytes Log: Titanium SDK Test File: bytes (attached) size Pass: 17,688 bytes Fail: 17,695 bytes Log:. Android Emulator: improve error message from missing ia32-libs dependency on linux. Console: colors, lines, and messages ill-formatted with CLI enabled. Console: colors, lines, and messages ill-formatted with CLI enabled (see screenshots). Steps to Reproduce: 1. Run code: Actual Result: colors, line formatting misaligned, and some messages do not display at all. Expected Result: colors, lines, and messages should appear and be properly formatted. Android: invalid android path in bash profile results in project creation error, improve error message. Failed to build a project for Android in Titanium Studio due to incorrect path to android SDK in a bash profile. It creates projects in Studio Test steps: to Titanium Studio Preferences Titanium 2. Browse and set Android SDK Home 3. Browse and set Android NDK Home Note the difference with a bash profile. export export 4. Create a project for Android. Actual result: Fail to create a project. Failed to locate android-8 and android Expected result: A project should be created successfully.. Android Device Debugging: console window fails to display console output after port forward. Titanium Studio Console output fail to display output results. Steps to Reproduce: 1. Create default project, add sample code: 2. Run 'debug' on Android Device. Port forward message should appear on console. 3. Launch app from device. Actual Result: Titanium Studio console log fail to display the console output Expected Result: Titanium Studio console log display the console output as DDMS or Catlog.. This also applies to iOS debugging. Add a clone if necessary.. Android: Deployment: Android Emulator intermittently fails to launch app after timed out. Android: when installing different app with same app id. When an android app is installed, and that app is already installed using a different deploy type production vs. testing), or a different app is installed with the same app id, there is an error logged to the console. I would expect the script to fail with a meaningful error message (and Titanium Studio to have an error prompt if necessary) indicating an app with the same app id and a different certificate is already installed on device, remove this app to continue installation. Steps to Reproduce (Scenario 1): 1. Create a new Android project. 2. Distribute for production and install to device. 3. Deploy again to device from studio. Steps to Reproduce (Scenario 2): 1. Create a new Android project. 2. Install to device in development mode. 3. Create another Android project with the same app id. 4. Deploy second app to device. Expected Result: Script fails with meaningful error message, studio prompts error if necessary. Actual Result: Failure logs to console, difficult to know exactly what the problem is.. iOS: KitchenSink: Base UI Views Map View: mapview annotation view does not appear. When KitchenSink UI Views Map View is run, the annotation view (white box with title and subtitle) is not displayed on mapview load. However, clicking the annotation pin will correctly display the annotation view. Otherwise, the annotation view correctly displays on mapview load on the iPad3 and iPad iPhone Simulator This is a regression, as it works on iPad iPhone Simulator using SDK This is not directly related to as the bug is fixed on the iPad device and simulator. Steps to Reproduce: 1. Run KitchenSink UI Views Map View on iOS. Expected Result: Annotation view should be visible. Actual Result: Annotation view not visible.. When the layout property of a View is set to 'vertical' or 'horizontal', children do not display. Works on Android. Tested on Views and Windows using Labels, TextFields, and Buttons. Steps to Reproduce: 1. Run Code: Expected Result: There should be a blue bar and a green bar (two labels in a horizontal layout). Screenshot attached. Actual Result: Red background (only the window background). Screenshot attached.. Button touchmove event fails to fire. Steps to Reproduce: 1. Run code. 2. Press button, move, and release. Expected Result: Console should output three event types: 'touchstart', 'touchmove', 'touchend'. Actual Result: No 'touchmove' is printed.. Tooling: is generated with invalid xml tags resulting in content assist disparities. Using content assist, in the studio editor, and other sdk properties have incomplete content assist property descriptions. The file in the sdk has invalid tags for these properties in and Screenshot attached. The xml tags were correct and the properties were properly described in content assist using sdk Screenshot attached. Steps to Reproduce: 1. Open studio. 2. Create a new project. 3. Select sdk or 4. In the file, type: 5. Open content assist. If it is not open by pressing cntrl + space. 6. Next to videoPlayer, type .repeatMode 7. Click on the content assist description for the property. Expected Result: Property description should be fully populated with descriptive elements other properties). Part of the description should read: 'Defaults to Actual Result: There are holes in the description. Part of the description reads: 'Defaults to .'. iOS: fails to orient captured image to reflect hardware orientation. Python is not on the list in Commands menu. This is not regression. h3. Step to reproduce: Open a Python file: File New From Template Python Blank File Run a command from the Python Commands Menu h3. Actual result: Python is not on the list in Commands Menu. h3. Expected result Should exist Python commands in Commands Menu.. Description: Creating a new HTML template from Titanium Studio causes an unzipping error. Steps to reproduce: 1. Click on HTML-based Application from Titanium Studio Dashboard Develop Actual result: Error Expected result: No Error. Dashboard: Text in search box become invisible when focus changes. Dashboard: Configure: Android: Linux: android sdk only partially downloads then fails to run. Dashboard: Configure: Android: update default android sdk to. Update default dashboard config android sdk to Android SDK: Test Steps: 1. Dashboard Configure Android. Expected Result: Android SDK: is downloaded.. MobileWeb Packaging: dirty project not prompted for save. Projects: new android sdk path not recognized by tiapp until xml reopen. calls with custom log levels no longer display in the studio console. For example: 'CUSTOM'); This is a regression introduced in Studio This did not affect Studio Steps to Reproduce: 1. Run code in iOS Simulator: Actual Result: Custom log does not display. Expected Result: Custom log should display as CUSTOM Note: The Android log levels display correctly.. It appears the console view log level is set to whatever the run configuration was that first launched this view.. Android Emulator: run config console level ignored on subsequent deployments. Android Emulator console log level is always set to the run config setting used to first launch the console process. Steps to Reproduce: 1. Create and run an android project in the emulator with the run configuration log level set to TRACE using code: 2. Edit run configuration to log level ERROR and redeploy project. Actual Result: TRACE+ levels log to console. Expected Result: ERROR level should log to console, as per the current run configuration.. Titanium Studio: Progress View: 'Remove All Finished Operations' fails to remove operations, adds them back if they are gone. In the progress view, pressing the double x ('Remove All Finished Operations') will not remove the operations. If the operations are removed then the double x is pressed, they will re-appear. This is a regression. Works as expected in Steps to reproduce: 1. Create Multiple Projects 2. Open Progress window in 3. Run the projects in Emulator or Simulator and close the 4. List of completed process is generated in \"Progress\" Window 5. Click on \"XX\" (Remove All Finished Project) 6. See Expected Result 6. 7. Close progress view processes one by one by pressing cross \"x\" (Remove From View) icon on right 8. The processes should remove properly 9. Press \"XX\" (Remove All Finished Project) 10. See Expected Result 10. Actual Result: (Remove All Finished Project) does nothing. 10. \"XX\" (Remove All Finished Project) brings back all processes that were removed previously. Expected Result: 6. Pressing \"XX\" (Remove All Finished Project) should remove all processes from the progress view. 10. There should be no list of project in the \"Progress\" view area.. During an SDK update, if the extraction process is canceled, there is no longer an error message generated. This is a regression. This worked in It is worth noting (not part of the regression) that the partially extracted SDK remains in the SDK folder, resulting in an invalid SDK. When the SDK is in this invalid state: It is still selectable by titanium projects, and if it is a stable release, it will not be recognized as needing an update. Steps to Reproduce: 1. Download any version of the SDK using a method such as: Help Check for Titanium SDK Updates or Help Install Specific Titanium 2. During the extraction process (which occurs after the process), press 'Cancel'. Actual Result: No error dialog, no error logs. Expected Result: Error dialog pop-up and error logs.. If the Dashboard Android Configuration Wizard is run without having the JAVA HOME variable set, Studio provides no indication it needs to be set. There is only a pop-up indicating Android was downloaded successfully. Note that studio automatically detects JDK to run, but it does not forward this information to the Android SDK tools. There is no log info. This is not a regression. This is a usability issue. Steps to Reproduce: 1. Make sure JDK is installed. 2. Remove JAVA HOME from the Global Environment Variables. 3. Make sure JAVA HOME is no longer active echo %JAVA HOME%, echo $JAVA HOME from the console). 4. Run Titanium Studio. 5. Make sure the Android SDK path is set in the Titanium Studio Preferences. 5. Run Dashboard Configure Android Actual Result: A pop-up appears indicating Android was downloaded successfully every time Update is run. Expected Result: Either the Android SDK Update utility should run, Titanium Studio should set JAVA HOME, or Titanium Studio should prompt the user to set JAVA HOME.. Dashboard: Configure: Android: Improve OS Global Environment Variable detection. unhandled event loop exception when changing theme. log attached. I could not reproduce this issue, it is intermittent. Unknown if this is a regression. In this particular case, I was changing from the Aptana Studio theme to the Aptana Studio theme. Steps to Reproduce: 1. Open Preferences Titanium Studio Themes. 2. Change the theme using the drop-down menu. Actual Result: unhandled event loop exception in studio log. Expected Result: No errors in studio log.. In Preferences Titanium Studio Titanium Titanium SDK Home, if you enter an invalid path by removing the last two characters), then add in a valid path add the last two characters back), studio will not re-validate the path. There is no log info. This is a regression. This does not occur in Studio Steps to Reproduce: 1. Open Titanium Studio. 2. Go to Preferences Titanium Studio Titanium. 3. Edit the Titanium SDK Home path to make it invalid delete the last two characters of text from the path). Studio should display an error. 4. Edit the Titanium SDK Home path to make it valid again re-add the last two characters of text from the path). Actual Result: The error remains, the path has not been re-validated. However, the changes can be saved, and the error goes away on preferences menu re-open. Expected Result: The Titanium SDK path should immediately re-validate and the error should go away.. When importing a project with git information, studio freezes This is intermittent and difficult to conclusively regression test. Steps to Reproduce: 1. Import KitchenSink from using Existing Titanium Project. Actual Result: Studio unresponsive in Activity Monitor, spinning beach ball instead of arrow cursor, Studio not receiving user events. Expected Result: Project should import and git information should display in Project Explorer.. If a module is installed to project using Help Install Titanium Module, the module is not added to the This is a new fail case, as the install feature did not exist before. If a module is packaged to project, it is included in the There is no log info. Steps to Reproduce: 1. Create a new Titanium Mobile project. 2. Create a new Titanium Module project. 3. Package the module to a directory Downloads). 4. Go to Help Install Titanium Module. 5. In Install from URL, select the packaged module zip. 6. In Output, select Project, and select the app project you created. Press OK. Actual Result: Module gets unzipped to project, but the module is not in the Expected Result: Module should unzip to project, and a module xml tag should be added to The module should be visible in the TiApp Overview.. Titanium Studio: If Titanium folder is readonly and latest sdk is not there, studio will not find an sdk to update. If Titanium folder is readonly and latest sdk is not there, studio will not find an sdk to update when update sdk is called. Step to reproduce: 1. 2. Delete the latest version of SDK folder 3. Give \"Titanium\" folder \"read only\" permission 4. Open 5. bar 6. Select \"Check for Titanium SDK updates\" Actual result: displaying MSG. \"No update available\" Expected result: Documentation web page should load in a browser.. Titanium Studio: simple perspective not default and can't change back to Studio (extended) if in an old workspace. Simple Perspective does not show up and switching to Studio (extended) does not show the toolbar if in an old workspace. Steps to Reproduce: 1. Open Studio. Actual Result: Studio simple perspective is not the default, nor does it exist. The simple perspective is also not available in Window Open Perspective. Expected Result: Simple perspective is default, exists, and is available in Window Open Perspective.. When trying to setup Android inside Titanium Studio, the wizard fails showing a window with the following error message: \"NLS missing message: in: OK\" I managed to install the SDK manually, but I get the same error message when I click the UPDATE button. This is a regression from This does not occur in. Closing as Fixed. Studio: SDK: OS: Snow Leopard Devices Tested: Android Emulator. setting runtime to rhino then back to v8 results in v8 xml tag in when it should be default. run configuration menu should open last used run configuration for the selected project in app explorer. The source option is context dependent, so it appears when it should.. Top menu bar receives events on Linux when other menu windows Preferences, About, Search) are open. This can result in multiple preference windows being launched. This is not a regression. This does not affect Windows 7 or Snow Leopard. This does not affect Eclipse on Ubuntu. Steps to Reproduce: 1. Open studio. 2. Open a menu window Preferences, Search). 3. Click on the top menu bar File, Edit, Expected Result: The top menu bar should not receive any click events. Actual Result: The top menu bar can receive events. However, the main editor frame is correctly blocked from receiving events. As a consequence, many info windows can be launched multiple times Search, About). However, the main preferences window can only have one instance.. Editor: changing file type then reopening does not reflect new file type. \"Search Search\" and \"Search File\" bring up same menu. Titanium Studio: Editor: reopening open project file via Project Explorer Local Filesystem results in duplicate mirror file in editor. If a file that is open in the editor is opened again using the Project Explorer Filesystem, there is a resulting mirror copy of the file in the studio editor. This is not a regression. There is no log info. Steps to Reproduce: 1. Create a new project. 2. Open if it isn't open already from the Project Explorer project folder. 3. Go to Project Explorer Local Filesystem, navigate to (the same file) and open it. Expected Result: The original open version of the file should gain focus. Actual Result: Another copy of the same file will open in the editor resulting in two duplicate open files. Edits to one file are mirrored in real-time to edits in the other file.. Titanium Studio: App Explorer: opening a project in Project Explorer changes selected project in App Explorer. When a project is opened after being closed in the Project Explorer, the App Explorer selected project is updated to the recently opened project. It is expected the selected project in the App Explorer would only change if it is deleted or manually changed. However, the App Explorer selected project is not updated (correctly) if a new project is created. This is not a regression. There is no log info. Steps to Reproduce: 1. Create two projects. 2. In the App Explorer, select the first project. 3. In the Project Explorer, select the second project. 4. Close the second project using Project Close. 5. Open the project using Project Open (reselect project if Project menu commands do not update). 6. Navigate to the App Explorer. Expected Result: The first project should be selected (the first one that was selected). Actual Result: The second project is selected (the one that was recently opened).. Project Open, and Project Close command availability are not updated in real time for projects in the Project Explorer. The old project options are still available Close is available if the project is already closed). Re-clicking the project in the explorer will update the Project menu options. This is not a regression. There is no log info. Fail Cases: 1. Project Explorer: Cannot open a newly closed project. 2. Project Explorer: Cannot close a newly opened project. Note: Project Explorer: Cannot close a freshly created project. - This is an invalid case as has focus. Steps to Reproduce: 1. Click a project in Project Explorer to manually refresh Project menu options. 2. Click Project Close to close project. 3. Click Project. Expected Result: Project Open should be available. Actual Result: Open is not available. If the project is re-clicked, it will become available. 4. Re-Click project in Project Explorer to manually refresh Project menu options. 5. Click Project Open to open project. 6. Click Project. Expected Result: Project Close should be available. Actual Result: Close is not available. If the project is re-clicked, it will become available.. Titanium Studio: Project Explorer: Close Project and Open Project not updated until re-click on project. Multiline Search: find should jump to string matches when scope is set to open files. Titanium Studio: Multiline Search: enable horizontal scrolling in search and replace boxes. In the search and find text areas, vertical scrolling by mouse scroll) is enabled, but not horizontal scrolling. This impairs the functionality of the fields because longer text lines cannot be easily navigated. The only way to scroll horizontally is to use the highlight functionality of the cursor (not ideal). Screenshot attached. Steps to Reproduce: 1. Open studio, open a js file. 2. Open search bar (command + f on osx). 3. Enter long line of text (longer than the search field itself) into search field. 4. Attempt to scroll horizontally. Expected Result: Search field (and replace field) should scroll horizontally to easily view the entire line of text. Actual Result: Nothing happens. The workaround is to use the highlight or left right arrow functionality of the cursor to drag move left and right.. Titanium Studio: Multiline Search: history and scope icons are inactive, only down arrow displays drop-down list. Search history icon does not function when clicked. Only the small down arrow next to the icon will display the search history drop-down menu. Screenshot attached. This is a valid issue, as this is how the run configuration icons function, in addition to basic usability. This also affects the scope icon. Note: There are two history icons, one for search and one for replace (both fail). Steps to Reproduce: 1. Open studio, open js file (create new project as needed). 2. Activate search (command + f on osx). 3. Click on the history icon (flashlight) or the scope icon. Expected Result: A search history drop-down list should display. Actual Result: The icon blinks. However, the small down arrow next to the icon functions correctly.. Editor: JavaScript Comment Auto-Complete initially fails to recognize preexisting blocks and cursor is incorrectly positioned. When deploying from studio, or manually running a mobileweb app in the android emulator browser, the app will not run and server related errors log to the console when a new AVD is created. Logs attached. This is not a regression, as it does occur in Studio Steps to Reproduce: 1. Delete 2. Create a default mobileweb project. 3. MobileWeb Preview in Emulator. Expected Result: Emulator should launch, emulator browser should load, app should run. Actual Result: Emulator launches, emulator browser does not load. Manually opening the browser and navigating to the app url results in a failed app load.. Titanium Studio: MobileWeb: preview in android emulator initially fails with server errors when AVD is first created. Update the Android distribution wizard launch configuration to allow user to pick from the existing list of certificates (combo box), or to create a new one. The top menu (File, Edit, Window, has randomly ordered elements on Ubuntu This does not occur on Ubuntu Snow Leopard, or Windows 7. Screenshots attached. No log. Steps to Reproduce: 1. Open studio. 2. Look at the top menu. Expected Result: Menu items should be consistent. Actual Result: menu items are random, but do change to the correct configuration on a second check.. In the dashboard, when the ad link at the top is clicked (\"Forging Titanium\"), and the generic external browser is closed, studio will crash. Log attached. Also occurs in This has only occurred using the \"Forging Titanium\" ad. You must refresh the dashboard until this ad appears. This issue is consistently reproducible. This issue affects Windows and Ubuntu, but I could not reproduce on OS X Snow Leopard. Steps to Reproduce: 1. Open Studio. 2. Open the dashboard. 3. Refresh the dashboard (red appcelerator logo) until the \"Forging Titanium\" ad appears at the top of the dashboard. 4. Click on the link to open a new generic browser with the ad content. 5. Close the browser. Expected Result: The browser should close. Actual Result: Studio hard crashes.. Editor: JavaScript Comment Auto-Complete indentation is inconsistent. Content Assist menu is persistent in the OS if the assist popup info menu has focus by clicking on it). Other OS program windows are now obfuscated by the content assist menu until the focus is shifted back to Titanium Studio proper or the regular content assist menu. Screenshot attached. Note: This is a lesser behavior of the fixed TISTUD-913. Steps to Reproduce: 1. Open Studio and create a new project (or open an existing project). 2. Click in the text editor of (or any .js file). 3. Press control + space to bring up the content assist menu. 4. suggestion list by clicking on it. 5. Click on the secondary popup that appears for that particular content assist item. 6. Open any other program (such as Chrome) and move the other program window over the content assist menu. Expected Result: The content assist menu should disappear behind the other program window, as it should have the same OS hierarchy as Titanium Studio. Actual Result: The content assist menu persists and obfuscates the other program window until the focus shifts back to Studio or a regular content assist item.. Editing labels.. Editing labels.. Titanium Studio: Dashboard: Search and Top Ad open in generic browser with no controls. ACS keys cut off when generated in TiApp Editor. Add Xcode Version Manager. Content Assist: string proposal missing. Content Assist: string static proposal erroneously generated. Content Assist: no proposal generated. Content Assist: JavaScript class objects generate non-static proposals. Debug: Variable View: the last pixel of variables is cut off. TiApp Editor: add Edit Undo and Redo functionality. New Project Wizard: auto-generate app id based on company id and project name. new mobile projects can't find resulting in \"1 error detected\" shown on TiApp pane. Windows: Pressing Cancel on installer does not stop installation process. h5. Description: After importing many (possibly any) of our Alloy-based sample projects, the project is showing warnings for unused styling items. These warnings are not accurate as the items are not unused. h5. Steps to reproduce: 1) Import any Alloy sample Alloy Todo List Sample) 2) Verify that there are warnings on the files 3) Choose a warning and hover h5. Result: The warning is for unused styling items, but the items are not unused. h5. Expected Result: No invalid warnings. Node Package Installer: application npm install location is incorrect. 1. Delete Global Appcelerator NPM Packages. 2. Install Appcelerator Studio. 3. Edit name of studio application directory to a unique one. 4. Run Studio and accept npm package updates. Result: The updates are locally installed to a folder other than the one studio was run from. See screenshot. Expected Result: The updates are globally installed. Note: If you try to run studio commands that require the npm packages, they will fail. Studio looks here no matter what (and the commands fail): Workaround:. Currently they are spelled 'Blackberry' and 'Mobile Web'. The convention is to spell them 'BlackBerry' and 'MobileWeb'. Test Steps: 1. Invoke Code Processor context menu (or invoke the project run-menu drop-down). Result: Spelling errors. See screenshots.. BlackBerry: update platform strings to current format. This is a regression introduced by TISTUD-1534. The \"Android SDK Version\" drop-down in the Application installer and the App Store distribution launch configuration tabs is displaying the Android SDK version in an un-sorted way (unlike the sorted display under the \"Emulator\" configuration page). We should sort those the same as the emulator.. Submit Ticket: Windows: some characters produce error illegal unquoted character code 13. Missing string translation in the iOS Module creation wizard. Debug and Profile on Device: Android and iOS: log level intermittently not respected in console on launch. This is a clone of TISTUD-4882 to address possible related problematic behavior. Debug on Device: Android and iOS: log level not respected. Sometimes the old console log level is used instead of trace. Note this ticket might be invalid, as we might actually want to use the existing console level. Also note the device run config does not allow the user to existing console. Sample Code (insert breakpoints as needed):. Debugger: breakpoint not hit from start method. Code Analyzer: Warning or Error icons are not displayed in code gutter. Does not affect Change introduced by TISTUD-4841. This looks like a regression that was introduced after we implemented this dialog. The debugger is creating a temporary project when launched in debug mode. When the session is terminated, that project is being deleted, and that's when we get this dialog. Expected: We should only show this dialog for the projects that the user created.. Debug and Profile on Device: Android and iOS: log level changes not respected in console. This does not occur Test Steps: 1. Package iOS App (Ad-Hoc or iTunes). 2. Goto Configuration New Configuration and select the 'Upload debug symbol option' Actual Result: 1. 'Apply' & 'Run' options are active before selecting the 'Uploading debug symbols' checkbox. 2. 'Apply' & 'Run' options are disabled after selecting the 'Uploading debug symbols' checkbox. Please refer the attached screen shot for further clarification.. iOS Packaging Run Config: 'Upload debug symbol' checkbox deactivates 'Apply' & 'Run' options. iOS Simulator: console ignores log level during build. iOS Simulator: console ignores log level during build. Test Steps: 1. Create Alloy project. 2. Run in iPhone Simulator with log level set to info. Result: Trace and Debug log to console. See screenshot and log. Sample Code:. Steps: 1. Enable all logging in the Console 2. Launch a project in the Android emulator Expected: App output should display messages that are formatted and can be filtered Actual: messages are displayed as follows: Sample Code:. Android SDK launching invalid config fails to launch android sdk installer. This occurs when the new minimum android sdk is not installed. Test Steps: 1. Launch Android Emulator Google APIs using Studio 2. Agree to update to current supported android sdk minimum version. Result: Operation fails with launch error. Expected Result: Android installation utility is run.. Android Emulator Run Configuration: preferences hyperlink is mislabeled and non-functional. Verified FIXED. Appcelerator Studio Mountain Lion. Android Preferences: Default Google API and Screen not set when Android SDK Path selected. Tizen: support: certificate location. Publish fails with database connection error App NodeACSProject already exists. database connection error App NodeACSProject already exists. This does not affect Mountain Lion Test Steps: 1. Create Project. 2. Publish Deploy App. Result: Menu appears, see screenshot, fails to recreate app. Expected Result: No menu appears, app gets published.. improve error message when login fails. Project: create fails with Internal error: ERROR object Object. Test Steps: 1. Create Project. Result: Failure. Expected Result: This is a login failure, Studio UI should indicate the login failed.. Windows: installation failure with bson error. Alloy Editor: new model wizard allows multiple entries with same name. Alloy Editor: new model wizard allow multiple entries with same name, only last one is used. This ticket requests additional validation to the sql model wizard. See screenshots. Test Steps: 1. Open Alloy Project. 2. Add New Model (sql) to invoke model wizard. 3. Add two entries with the same name. Result: No error message appears. The last entry is the one that will be injected into the generated model code. Expected Result: An error message should appear at the top indicating two columns have the same name. There is already existing validation for a pre-existing model.. Binding: import binding dialog allows user to continue if nothing selected. Projects: non-default project location in workspace generates existing project error. See screenshot. This does not happen in Titanium Studio This appears to be a regression. Test Steps: 1. Open new project wizard. 2. Enter project name and app id. 3. Deselect 'use default location'. Result: Error appears indicating project already exists in workspace. This is false. The workspace is empty.. Android Emulator: new process launched every time emulator is run. Note: LiveView is disabled. Test Steps: 1. Create Classic Project. 2. Run on Android Emulator and let app run. 3. Run on Android Emulator again (Run Android Emulator). Result: Everytime the run command is run, a new process is launched. See screenshot.. Verification blocked by TIMOB-13944.. set cname does not appear to get called. set cname does not appear to get called. Test Steps: 1. Create Project. 2. Package Deploy App. 3. Right Click Set CName 4. Click OK to use default argument. 5. View log file. Result: Nothing there. No evidence of a shell call.. A comment with security level 'Developers' was removed.. Android Platform Preferences: unable to remove Android SDK path and Apply changes. This is a regression. This works in Titanium Studio Test Steps: 1. Open Android Platform Preferences. 2. Delete Android SDK path and Apply. Result: Cannot apply changes. Apply is grayed-out.. Create Alloy Project: Widget Disposed error. Update the Dashboard side to call the SDK-Info command with a \"windows\" key. Then, parse the result and display any info (like we do with the rest of the platforms). The Windows section in Dashboard will look similar to what BlackBerry one shows.. Windows: Add Dashboard Configure. See Screenshot.. BlackBerry and Tizen: not recognized as installed in Appcelerator Studio. Dashboard: Templates and Samples don't work on Appcelerator Studio. Code Processor: output opens multiple result views when repeating the same analysis. Titanium Updates: when no updates available, appears as an error instead of a success. Titanium Update: when no updates installed, appears as an error instead of a success. See screenshots. Test Steps: 1. Install Titanium Updates. 2. Check for Titanium Updates. Result: An error pop-up appears. The icon is misleading. Most programs would consider it a success to have the proper dependencies already installed. Expected Result: A success pop-up appears. One example of a success icon is a green check mark.. A comment with security level 'Developers' was removed.. When a new run configuration is created, it would be helpful if the project were auto- project explorer, or app explorer). This has been fixed for all platforms except BlackBerry. Steps to Test: 1. Select a Titanium Mobile project in the project explorer. 2. Go to Run 3. Create a new Android Emulator run configuration. Expected Result: The project selected in the project explorer should be the default project in the new configuration. Currently there is no project selected in the new run config, it must be manually selected.. Alloy debugger maps to the wrong source in a specific case. Projects: non-default location results in creation problems internal error. Proxy Splash: settings do not populate based on preferences. Also, when you switch between proxy types in the proxy splash, the fields all have the same values, as if only one proxy type can be set at a time. See screenshots. The proxy splash is intended to allow the user to edit the proxy preferences without logging-in. Currently it is not pre-populated with the values in the preferences. Test Steps: 1. Edit proxy preferences (Preferences General Network Connections). Here is the qe test proxy for example: Connect: Port: 8080 Username: qetester Password: lynx64-fixer 2. Log out of Studio and Relaunch. 3. Open proxy splash menu. Actual Result: The proxy splash menu does not reflect the preferences. This gives the impression there is no proxy setup. This is a false impression. This is a bug.. Console: Windows and Linux: android device alloy build console includes backspace characters. Console: android alloy build console includes backspace characters. The alloy android build to device console contains backspace characters. The backspace characters are abruptly and correctly ignored just as the build script ends (and the run script begins). See screenshot and log output below. This is an edge-case. Test Steps: 1. Run Alloy Project on Android Device in Windows. Actual Result: Build console displays backspace characters.. Verification blocked by TISTUD-4310.. Android Device: support run on device console output. Local Server Console does not populate on first deployment. Windows: Titanium SDK Path: use same path as CLI. Profiler: auto-launch app on android device. Error appears when empty \"Import binding \" to a mobile project. intermittent Update home control job (Sleeping) process on application launch. h3. Steps to Reproduce 1. Open Appcelerator Studio. h3. Actual Result Update home control job (Sleeping) process never h3. Expected Result All self-launching processes self-terminate.. Android Device Debugger Wizard: update UI to 'App Should Automatically Start'. Add CLI command support to run a BlackBerry project. Add CLI command support for building a BlackBerry project. On a completely clean installation, if python is not in the system path on windows, will fail to install. The workaround is to set the PYTHON path to the installation directory located inside Titanium Studio (example): PYTHON system variable. can be installed from the command line, but there is a PYTHON path warning. Adding PYTHON to the path makes the warning go away. Titanium Studio can only install with the PYTHON path set. Titanium Studio has it's own Python installation on Windows, so in theory should use that one.. Run Enable JavaScript Minification defaults to FALSE if no project selected. Run Re-build on Launch: Error cleaning the build before launching. iOS iTunes Packaging: clicking success toast links to studio application directory: I would expect it to open Xcode and launch the archive perspective. Note the archive organizer is correctly automatically opened when success toast appears.. Alloy: Debugger ignore breakpoints and stack frame under Windows. Surface Full Error: CLI: BlackBerry: support project create: Invalid platform: blackberry. Creating a new blackberry project results in: Studio does not surface the full error. See screenshot.. iOS iTunes Packaging: success toast links to studio application directory: I would expect it to open Xcode and launch the archive perspective as it does using Titanium Studio Stable. This is verified as a regression. iOS Ad-Hoc Packaging opens correct directory, as specified in the run configuration.. iOS iTunes Packaging: success toast fails to open xcode archive manager. Suggest Run No 'universally accessible' way to verify environment.. Add a new section above Alloy Templates, call it Alloy Samples.. Dashboard: Titanium Samples icons should match quality of Templates icons. Dashboard: Titanium Samples icons should match quality of Templates icons. When TISTUD-2628 is done, this issue will address the parity issue created.. A comment with security level 'Developers' was removed.. Projects: deleting a mobile project with service results in Updating Client npe. Projects: deleting a mobile project with service results in Updating Client npe. Test Steps: 1. Create Titanium Project. 2. Enable New Service. 3. Delete project (not from disk). Test Result: Error.. New Android Emulator Run Configuration ignores Preferences until preferences menu is loaded. MobileWeb Module: packaging run configuration lists module as an invalid module project. See screenshot. Log attached for completeness. Test Steps: 1. Create MobileWeb Module. 2. Create Mobile Project. 3. Package Module to Project. 4. Open MobileWeb Module Packaging Run Configuration. Actual Result: MobileWeb Module is listed as an error in it's own packaging run configuration. Note the module and associated mobile project appear to be valid, produce no errors, and run correctly.. Clicking on Titanium Updates plugins release notes results in error messages in log. No visible affect on the UI or installation process. Log:. Titanium Updates: could not instantiate a release notes provider error. When Studio is first installed and configured, BEFORE any Titanium Updates are installed, there exist a few NPM-related NPEs in the log. It would be a more-complete experience to address these. Log:. Notice the MobileWeb module version is missing from TiApp Overview, but it correctly and soundly exists in Deleting and Adding the module provides identical incorrect behavior. See screenshots. Test History: 1. Install Titanium Studio w JDT and accept all updates. 2. Create MobileWeb Module, Create Titanium Project, Package Module to Project, Move example to Titanium Project. 4. Update to Titanium Studio 5. Install alpha npm packages (titanium, alloy). 6. Install Titanium SDK 7. Open Titanium Project Test Result: Notice the MobileWeb module version is missing from TiApp Overview, but it correctly and soundly exists in Deleting and Adding the module provides identical incorrect behavior. See screenshots. Expected Result: TiApp Overview lists MobileWeb module versions.. I changed the Titanium SDK in the TiApp Overview from to and an error was generated in the UI. Log attached. Test History: 1. Install Titanium Studio w JDT and accept all updates. 2. Create MobileWeb Module, Create Titanium Project, Package Module to Project, Move example to Titanium Project. 4. Update to Titanium Studio 5. Install alpha npm packages (titanium, alloy). 6. Install Titanium SDK 7. Open Titanium Project 8. Edit Titanium SDK field to Test Result: Error. Cannot reproduce. Notice the MobileWeb module version is missing from TiApp Overview (TISTUD-3984), but it correctly and soundly exists in Deleting and Adding the module provides identical incorrect behavior. See screenshots. Expected Result: No error.. update to with NPM Due to TIMOB-13178. Docs: I was able to install all node packages and run in Titanium SDK and using and NPM titanium alloy acs. Open iOS General Preferences, notice the Retina config options. Create iOS Simulator Run Config. Notice the missing Retina UI in the Run Config.. When users upgrade to titanium studio they then receive an error message that their account is inactive, After having checked their accounts they are already activated. Error message received: \"Inactive Account\" Suggested Improvement: verification required. Please click link in activation email\".. Project Templates: make correct defaults for All and Titanium Classic. Note: Alloy has correct defaults. Currently the defaults are: All Single Window Application Titanium Classic Single Window Application The defaults should be: All Alloy Default Application Titanium Classic Default Application Verify by creating new Titanium Project.. Project Templates: template order is random. project explorer packaging dropdown list is misaligned. Run Configurations : New Configuration Window Build tab contents are not visible properly. Preferences Default Android SDK path saved even after being canceled. Studio on Windows should have Python built-in. 1. Do the verification results sound correct? 2. Do they fall under the scope of this ticket? 3. Can this ticket be closed? 4. Does a new ticket need to be opened?. Dashboard: Update Android SDK to on staging.. Titanium project wizard template should pre-select Alloy templates as default type. Prevent duplicate deployment targets for 'Tizen' & 'MobileWeb' platforms. Dashboard : Improve load time performance during its startup. Linux: Titanium Updates Prompt Never Goes Away. Linux: Titanium Updates Prompt Never Goes Away and SDK Not Recognized as Installed. Regression. Works in Studio on Ubuntu & Steps to Reproduce: 1. Run Studio. 2. Check for Titanium Updates. Actual Results: Updates Menu asks to install everything again even if it is already installed.. Windows: Android SDKs not recognized without moving them. This is a regression. Works correctly in TISTUD Windows: Android SDKs not recognized in Preferences. Steps to Reproduce: 1. Open Titanium Studio. 2. Open Preferences Titanium Studio Titanium. 3. Clear Android SDK Path and Apply. 4. Browse to Android SDK to select path. Actual Result: Android SDKs not recognized. Expected Result: Android SDKs recognized.. Is it possible setting the ANDROID SDK will fix the issue?. Advertisement on the header of dashboard should be missing. Debugger: Debug process hangs at itunes initialization with cli -cr. While trying to use the proxy setting for testing I ran into the following issue: I am currently unable to sign into studio via the proxy setup by Appcelerator's IT. Tested using the following: Titanium Studio, build: Connection type: HTTP and HTTPS tried IP: Username: qetester Password: I get a generic error back when trying to log into Studio while using the above information (see screenshot) Steps to reproduce: 1. Start Titanium Studio after a logout. 2. Click \"I have an account\" and click next. 3. Click the \"use proxy link\". 4. Enter the proxy information into the form. 5. Click OK. 6. Login using correct credentials. Expected result: User is logged in through the proxy. Actual result: The error shown in the screen shot.. BlackBerry: support project creation with multiple deployment targets. Node : 'Node is not an internal or external command' error when creating a Titanium Project due to path. JS Content Assist: no instance methods listed in for statement with no code block. iOS Console: log level filter does not update in realtime, or respect run config. Dashboard: update ios installation info to include current os support. See attached 'if not installed info'. We need to remove Snow Leopard (deprecated), and add Mountain Lion or a generic instruction for Lion+. Steps to Reproduce: 1. Move Xcode in filesystem (without changing xcode-select path). 2. Open Titanium Studio. 3. Open Dashboard. 4. Get Started Configure iOS. 5. Hover over 'Install or Update iOS SDK' button. Actual Result: Snow Leopard (deprecated) and Lion appear. Expected Result: No Snow Leopard. Yes Mountain Lion, Lion, and or Lion+.. Dashboard: Xcode not recognized as installed. Xcode is correctly recognized by the CLI, and the Studio Preferences. No log. Steps to Reproduce: 1. Install Xcode 2. Open Titanium Studio. 3. Open Dashboard. 4. Get Started Configure iOS. Actual Result: Xcode not recognized as installed. User prompted to download Xcode. Expected Result: Xcode recognized as installed.. Restore Defaults button on the Project Build Path Properties page does nothing. FTP: error is coming when opening a file. Android Preferences: Android SDK not recognized due to non-numeric Titanium SDK. update to Current hosted version is Minimum supported is: See story for more information: TISTUD-3171. Test Steps: 1. Close Titanium studio if its already opened. 2. On the terminal I have used following commands for testing : sudo npm uninstall acs -g sudo npm uninstall alloy -g sudo npm uninstall titanium -g sudo npm uninstall npm -g Also I have removed Nodejs forcefully . 3. Launch Titanium Studio. for titanium updates. Observation: ACS prompt is not available while Node, alloy and cli prompts are available.. CLI: cannot use cli when offline. ACS: improve login progress message to have correct spelling and meaning. See screenshot. Ill-formatted message reads: 'Register as apps with ACS'. Should probably read: 'Register app with ACS' or 'Register as app with ACS'. Steps to Reproduce: 1. Create Titanium Project with ACS enabled. 2. If ACS login prompt appears, view progress indicator text. Actual Result: Ill-conceived message. Expected Result: Perfectly spelled message with laser-sharp grammar and meaning.. \"I just installed the latest Titanium Studio from Appcelerator and a Titanium Update window pops up when I open TiStudio and asks me to install Titanium CLI and Alloy. When I press the install button a dialog pops up that says Titanium wants to make changes. Provide your password to allow installation. I enter my password and TiStudio tells me that my password is incorrect and TiStudio asks me to enter it \"To get around this all you need to do is manually install alloy and titanium cli using. Run Configuration: remove log filter from run configurations. Currently the run configs have log filters. The console is responsible for this behavior.. Titanium Updates: add version numbers to first time node module installations. iOS Simulator console filter does not work, all levels are logged regardless of settings. Does not occur with debugger. This could be CLI-related. Steps to Reproduce: 1. Run code in Simulator (set run config log level to ERROR): Actual Result: Console level is set to ERROR, but nothing is filtered. Expected Result: Console level is set to ERROR, and only ERROR messages print to console.. Install Titanium SDK: disable Finish button for installed sdks. iOS: Spaces in field of generates error. Help 'Install Titanium Module' 'Install from URL ' with no specified URL should fail. This is not a regression bug. It happens in Studio too. Test Steps: Studio. Install Titanium Module press 'OK' (don't enter a module) Actual Result: Module is successfully installed. Expected Result: 'OK' tab should be disabled since the input is not valid.. Steps To Reproduce: 1. Go to Folder as to import a project (attached zip). 2. Run Project in debug mode using iphone simulator. Actual: \"Requested SDK version does not have an assigned error message appears. On opening and saving same resolves the issue. On windows 8 \"Null Pointer\" exception appears. refer snapshot Expected: Project must be imported and run without any error.. Allow user to easily import and run old projects. File Import General Existing Folder as New Project remove error icon. Titanium Module Packager: can't apply changes to most packaging types. Titanium Android, iOS, & MobileWeb Module Packager: can't apply changes to most packaging types. If you select Mobile App, then Titanium SDK, you can't save the changes. If you select Titanium SDK, then Mobile App, you can't save the changes. If you select Directory, you CAN save the changes. No log info. Steps to Reproduce: 1. Open Titanium Project. 2. Open Module Project. 3. Open Module Packaging Run Config for that project. 4. Select Mobile Project. Apply. 5. Select Titanium SDK. Actual Result: Apply doesn't work, module will package to wrong type. Expected Result: Each type should work if it selected. Work-around is to create a new run config every time, or click around until you can apply the changes.. Preferences: Xcode path does not refresh until restart. NPM intermittently fails to install on first try. Debug on Device: prompting as minimum SDK would be user-friendly. Test Steps: Latest studio. an android device. a Titanium Mobile android project with GA SDK . click on the project and select debug debug configuration create a new configuration for android device run. Actual Result: SDK is prompted as the minimum sdk. is the old name for Expected Result: SDK Error is an expected behavior but it should display SDK version or above.. TiApp Editor: sdk intermittently fails to save in the xml tag based on sdk value in overview. Steps to Reproduce: 1. Open TiApp Editor. 2. Open and edit titanium sdk to invalid value and save. 3. Open TiApp Editor Overview and save. 4. Open and view titanium sdk tag. Actual Result: The sdk value is the same invalid it was before the save. This happens intermittently.. Android Emulator: can't launch two separate projects in a row on Windows. In a MobileWeb run config, if you 'check for browsers', Safari continues to be recognized every time the command is run. This results in a long list of Safari installs, all the same version. Steps to Reproduce: 1. Open MobileWeb run config. 2. Select browser as 'check for installed browsers' and install all browers. 3. Run the command again. Actual Result: Safari appears as unrecognized. Can install multiple identical Safari versions if you repeat the 'search for action. Expected Result: There should be no duplicates in the recognized browsers list.. Titanium Project: terminating new project creation process is throwing error. iOS build to device freezes studio if git locks up. Add Titanium CLI Enabled: True False to diagnostic log. Suggested Fields:. iOS: Developer name passed to CLI is trimming ID. iOS Simulator: intermittent error cleaning the build before launching. CLI: ERROR Invalid ios version value. This appears to be a regression issue. Since it works fine in Studio. iOS Simulator runs in Studio build. Steps To Reproduce: 1. Install Xcode and Studio 2. Create a default project. 3. Try running app in iOS simulator. Actual: Error appears in console. Invalid value Accepted values: Expected: iOS simulator must run for default project.. Studio crashes with 'unhandled event loop ution -Java heap space' error. MobileWeb Run Configuration: displayed selected browser does not refresh immediately after installed browser search. When a MobileWeb run config is opened, and the browser list is updated after searching for installed browsers, 'Default Browser' is always displayed as selected in the run config browser list. Selecting another browser does not change the display. The issue goes away if the run config is reopened. Steps to Reproduce: 1. Open MobileWeb Run Config. 2. Browser Drop-Down List Search Installed Browsers, and all browsers. 3. Select a browser in the run config drop-down list. Actual Result: After a browser is selected, 'Default Browser' always appears as the selected item. Reopening the run config fixes the issue. Expected Result: Browser list refreshes correctly after search for installed browsers is first run.. The login splash has odd rendering near the radio buttons. There is a strange orange half-rectangle to the right of the buttons. Steps to Reproduce: 1. Logout and restart studio. Actual Result: Radio buttons have odd rendering just to the right of the buttons. Expected Result: Radio buttons render 'correctly'.. Import Project: Exception in log file when mobile project path contains apostrophe. Not a regression. If Android SDK path is deleted in the Preferences, the Default Android SDKs list is still populated. The list should clear if there is no valid path selected. The list will correctly go away if the Preferences are reloaded. Steps to Reproduce: 1. Open Preferences Titanium. 2. Delete Android SDK path. Actual Result: Default Android SDK List Persists. Expected Result: Default Android SDK List Disappears. Screen Types List Disappears.. Dashboard: Update Android SDK to 21 on Staging. CLI: old python scripts called for all commands. Not able to run updates: NPE. Studio repeatedly prompts to install the same modules. Inconsistent functionality in login windows. Not a regression. h1. Problem description When running an app using \"MobileWeb Preview in Browser\", the chosen browser is not correctly used. Sometimes, Firefox is used (although I set the default browser or Chrome), other times I get this error: \"Could not launch external web browser for Check the Web Browser Attached the settings screen: as you can see, the Chrome browser is chosen.. Console: no colors on new lines in debug output (see screenshot). Steps to Reproduce: 1. Run code: Actual Result: No log-level colors on new lines. Expected Result: Log-level colors on new lines should match.. Editing the large attached file reliably crashes and freezes studio. 3 system crash logs attached. Studio often will crash when it reloads after the first crash. This does not occur with Studio but there is some slow-down. Steps to Reproduce: 1. Edit large attached file in studio. 2. Scroll top to bottom, copy the contents, delete the contents, paste them back, save, repeat. Actual Result: Studio freezes, jstack doesn't work, heap error, system crash reports. Expected Result: Perhaps some slow-down.. Unhandled event loop exception Java heap space crash and freeze when editing large file. node module commands in empty folders are falsely detected by studio. Manifests as null pointer exception when creating alloy project, etc. Note that npm is usually installed in Log: Steps to Reproduce: 1. Create an empty folder in the following locations: 2. Try to run studio, create these projects, check for titanium updates, or enable the cli. Actual Result: Fail with permission error. Expected Result: Studio should ignore these false files and run existing npm packages.. Can't use studio when KitchenSink is imported, building workspace. Importing KitchenSink, changing the sdk version, and saving the change in while the project is indexing results in save failure. Studio hangs during this scenario. Core exceptions in log, out of sync. Could be related to TISTUD-2490. Steps to Reproduce: 1. Import KitchenSink from the samples. 2. change the sdk version in and save. Actual Result: Fail to save. Expected Result: Save.. Dashboard: Create Alloy Templates section. Add a new section on the bottom, call it Alloy Templates, put the alloy templates there. The current UI is incomplete.. space in project name causes Errors running builder 'Studio Unified Builder' on project. Unpublish Service does not remove service from production. Log: Steps to Reproduce: 1. Create Project. 2. Publish Deploy App. 3. Publish Unpublish Service. 4. Publish View Service or reenter weblink to service. Actual Result: Link is still there, app is still in production. Expected Result: Should be unable to view app service or enter website, link should be dead.. After Update, An exception occurred in the script. Error name: Type Error. Installer: full installer links should always have content. Entering user password on studio launch once installs all titanium updates regardless of user wishes. If the prompt is going to install everything, it should message that to the user. NMP Installer Log: Steps to Reproduce: 1. Uninstall cli, alloy, and acs. 2. Load studio and enter user password on prompt. Actual Result: Everything is installed, not just the prompted update. Expected Result: Each update is installed one by one, and user enters password for each.. Titanium Updates: inform user all updates will be installed on studio launch. Titanium Updates: Unhandled event loop exception after installing updates. Android Device Debugger: empty project console view appears. A comment with security level 'Developers' was removed.. When studio first starts, the npm is not prompted to install if it is not installed, this will prevent Alloy, CLI, and ACS from installing. Note this is not a typical use case and npm is assumed to be installed along with This is an improvement that would make studio a bit more robust. Studio Error Log: Steps to Reproduce: 1. Uninstall npm delete npm folder from node modules). 2. Start studio. Actual Result: No prompt to install npm. No prompts to install alloy, acs, or titanium, and no future updates for those node modules. Expected Result: Prompt to install npm if it is not installed.. NPM: npm install not validated on studio startup. Android Emulator: Application Installer abnormal process termination. Process exit value was 1. When a project is run in Android Emulator, the process terminates and the emulator fails to launch. When the same command is run from the command line, there is an error. This does not occur in Studio this is a regression. correct studio command for comparison: broken studio studio command: console error: Steps to Reproduce: 1. Run a project in Android Emulator. Actual Result: Terminate, no launch. Expected Result: emulator launches.. When a project is run in iPhone Simulator, no simulator version is passed in, so the process terminates and the simulator fails to launch. Simulator runs correctly in SDK When the same command is run from the command line, there is a missing version error. studio command: cli error: Steps to Reproduce: 1. Run a project in iPhone Simulator. Actual Result: Terminate, no launch. Expected Result: simulator launches.. Include standard documentation for release notes as with the sdk. See screenshots. Steps to Reproduce: 1. Uninstall or have an old version of alloy. 2. Check for Titanium updates. Actual Result: Documentation is minimal. Expected Result: release notes should be same quality as sdk release notes.. Include standard documentation for alloy release notes as with the sdk. See screenshots. Steps to Reproduce: 1. Uninstall alloy or have an old version of alloy. 2. Check for Titanium updates. Actual Result: Documentation is minimal. Expected Result: alloy release notes should be same quality as sdk release notes.. Find Bar: select-all with full screen of text maximizes find bar height, blocks editor. Titanium Updates: user keeps getting prompted for updates even after they are installed. Installer: \"Uninstalling path\" while installation does not appear on Windows 7. In the dashboard explore my modules section, modules that are installed are listed as not installed they prompt user to 'Install'). Steps to Reproduce: 1. Load dashboard in studio. 2. Click explore my modules, and install a module. 3. Reload the dashboard and view my modules. Actual Result: Module shows as not installed (says 'Install'). Expected Result: Module should be 'Installed'.. In the dashboard explore my modules updates section, there are no updates available. Steps to Reproduce: 1. Load dashboard in studio. 2. Click explore my modules, and click 'Install' to install a module. 3. Edit the module folder to lower the version. change to and change the manifest file to lower the version as well 4. Click the updates tab in dashboard my modules. Actual Result: No updates available. Expected Result: The edited module should show as needing an update.. In the dashboard explore my modules section, if you click 'installed' on a module that is already installed, it installs again. Steps to Reproduce: 1. Load dashboard in studio. 2. Click explore my modules, and click 'Installed' on a module that is already installed. Actual Result: Installs again. Expected Result: It shouldn't install again.. In the dashboard explore my modules section, if you click 'install' on a module, then wait for it to install, there is no success dialog. Steps to Reproduce: 1. Load dashboard in studio. 2. Click explore my modules, and install the jira module (or another free module). Actual Result: No success dialog. Expected Result: Success dialog.. Help Check for Titanium Updates always shows need for a CLI update even it was already installed (the install failed). Steps to Reproduce: 1. Run Help Check for Titanium Updates and install CLI. At this point there is a failure due to related issue, will go away in future. Actual Result: No error messages. Expected Result: Should have error message.. Help: add mechanism to display cli alloy and node acs version installed from studio. Titanium Studio-ubuntu & new project top bar text is not properly aligned. Titanium Studio console output fails to display device output. Steps to Reproduce: 1. Create default project, add sample code (and breakpoints): 2. Run 'debug' on Android Device. Port forward message should appear on console. 3. Launch app from device. Actual Result: Titanium Studio console fails to display the console output. Expected Result: Titanium Studio console should display 'INFO LOGGED'.. In the Android debug on device wizard, add a checkbox that states \"Use previous build\". If it is checked, the build parameter UI is disabled and the user can proceed with the wizard. Doing so will re-use the last used app associated with the launch configuration. Allow Android debug session without app re-build. Steps to reproduce: 1)Open Titanium Studio. 2)Open Create a Titanium Mobile project - Android device. 3)Click on 'debug' icon- android device. 4)Wait till process completes. Exit from debug perspective. 5)After sometime th the bottom ( Ti studio task-bar launching previous project is displayed) screenshot attached. Actual result: Launching run project gives wrong notion to the user.. If a titanium project contains a service, and the user selects project right-click New, Service appears as a menu entry. As a further complication, when New Service is selected, the New Method dialog is invoked instead. Steps to Reproduce: 1. Create a titanium mobile project. 2. Right-click New Service to create service. 3. Right-click New again. Actual Result: New Service exists as a menu item when the project already has a service. Expected Result: Menu item should not exist. 4. Actually click on New Service. Actual Result: New Method dialog is invoked, which is not correct. Expected Result: Either a new service should be created, or a dialog indicating a service already exists.. In Project Explorer, if there are no projects, the Publish icon is still active (regression), however no entries are available (correct). See screenshots. No log info. Steps to Reproduce: 1. Open Titanium Studio. 2. View the Project Explorer. Make sure there are no projects in the explorer. Actual Result: Publish icon is incorrectly active (but no list appears when clicked, as expected). Expected Result: Publish icon should be grayed-out.. Android: Add 'debug on android device' option in context menu list. Device Debugger: intermittent can't delete debug sessions. Link is directed to a different window in Titanium Studio This is a regression, this does not affect Studio Steps to Reproduce: 1. Create Project 2. Right Click on created project and select Properties 3. Select \"Formatter\"and click on \"Configure Workspace Actual Result: iOS Certification and Provisioning window. Expected Result: Should open General Workspace setting window.. iOS Device Debugging: debugger silently fails to connect. Dashboard: Linux: dashboard is not open as expected, pop up Error Msg. \"Fail to install alloy\" and \"Internal error. iOS Device Debugging: no console output from device. Titanium Studio Console output fail to display output results. Steps to Reproduce: 1. Create default project, add sample code: 2. Run 'debug' on iOS Device. Port forward message should appear on console. 3. Launch app from device. Actual Result: Titanium Studio console log fail to display the console output Expected Result: Titanium Studio console log display the console output.. TiApp Editor: prompt to save when focus leaves tiapp editor. When Preferences Titanium iOS Configure button is pressed, nothing appears to happen. In reality, the dashboard is opening in the background to the configure page. I would recommend using the Configure button for the same action it would perform if launched from dashboard. h3. Steps to Reproduce: Go to Preferences Titanium iOS and click the Configure button. h3. Actual Result: Dashboard configure opens in the background. From a usability perspective it appears as though nothing happens. h3. Expected Result: Either the button isn't there at all because it doesn't appear to do anything, or it opens a wizard that would normally be opened using the dashboard (if possible).. Android Preferences: configure button fails to launch android installer. In the Titanium preferences, if the Xcode path is too long, there is no way to view the full path because the text field is locked. There is no way of knowing which Xcode is being used. This blocks testing. See Screenshot. Steps to Reproduce: 1. Open Preferences Titanium Studio Titanium Xcode Path. Actual Result: If the path is too long, it will be visually truncated, without the ability to reveal the full path. Expected Result: Some mechanism to view the full path.. Android Device Debugger pointer is not pointing to the current lines. Build: running titanium project causes No enum const class error. Launching Android Emulator in debug, or iPhone Simulator w o debug mode prompts error message. Android Error Message: \"An internal error occurred during: \"Launching Titanium Android Emulator - No enum const class iOS Error Message: \"An internal error occurred during: \"Launching Titanium iPhone Simulator - No enum const class Steps to Reproduce: 1. Create Default Mobile Project 2. Run Project Debug as \"Android Emulator\" OR run in iOS Simulator. Actual Result: Error Message, but app otherwise runs successfully. Expected Result: Debug run is successful.. Android SDK has been tested on all platforms, there are no issues, it can be pushed to the live dashboard.. ", "contenttype": "application/json", "created": 737358, "id": 38, "language": "en", "user_name": "dhyde", "email": "dhyde@appcelerator.com"}]}