{"contentItems": [{"content": "Verified using Titanium Studio, build: on both Windows 7 and Windows 8. Test Steps performed : 1. On a clean machine , where No JDK path has been set and no python path has been added, I downloaded latest nightly build set the android path, created a new titanium project and ran it , it was throwing error that 'No Java SDK path has been set'. setting path for JAVA HOME in class path , I was still not able to run android project. I added Python path and after that I am succesfully able to lauch android emulator ( with. This is specific to Windows . I could not recreate this issue on Mac. Test Steps: 1. Create multiple projects in your workspace ( more than 3) sure few .js files and .xml files must be open . 3. Delete all those projects ( check too) Actual Result: Error occurs. Screenshot attached.. This is a regression issue. It didn't happen in release. Precondition: Add Android NDK in Studio preferences path. Install gperf and make sure its in your path. I have Platform 10 and platform 19 Google API intalled. Test Steps: 1. Create an android module. 2. Package it to a mobile project. Actual Result: Error occurs. Screenshot and logs attached.. UI difference in Studio for creating Alloy controller, migration, model, view, style and widget. Test Steps: On a clean Windows 8 machine: Appcelerator Studio and install all the appcelerator components . the default location for Titanium SDK set in Studio preferences. Actual Result: is set in the default location for Titanium SDK in Studio preferences. But actual installation (appcelerator modules) happens at the location Expected Result: Default location for Titanium SDK should be Note : CLI also shows the same default SDK location path :. Test Steps: Window Show view Samples Geocoder. Check the name of the app in Actual Result: Geocoder app is named as find below.. Precondition: I have added after \"-vmargs\" to the .ini file. Test Steps: 1. Launch Appcelerator Studio on a clean machine. 2. Configure Android SDK with default version from Dashboard. Studio Platforms Android Verify that android SDK is accepted in Preferences and no error should be thrown. Actual Result: Studio Dashboard is not detecting Android possible reason is Android version is not installed.. Precondition: All updates must be installed for Android SDK. Test Steps: Launch Appcelerator Studio. Preferences Studio Platforms Android 'Install SDK' button Expected: Install SDK button should be disabled if no android updates available in the preferences.. The bug scenario still persists and I was not able to configure Mobile Web configuration on Ubuntu on, Appcelerator Studio, build:. Studio: Run diagnostic test is displaying - Default system web browser: null (null). This is a regression bug. It happened on both and Test Steps: a clean machine , download titanium studio installer for and install Titanium Studio. all the titanium updates ( it includes NodeJs, Alloy , Titanium) I haven't added plugin deliberately . - Observe that NodeJs exe should be installed successfully. from Studio using 'Exit' option. launch Titanium Studio. new Titanium project. the behaviour. Note: This behaviour is specific to only one machine. Actual Result: The following error is coming :\" 'node' is not recognized as an internal or external command, operable program or batch file. \" Screenshot and logs attached. Expected Result: No error should come.. Titanium Studio: SDK version prompt shoud not be Titanium SDK version. Titanium Studio: 'Module packaging successful' prompt should display correct directory location path for packaged module zipped file.. This is a regression. Test Steps: latest studio. a New Titanium module project for mobile web. project explorer, package mobile web module created in 2nd step. the third option ' package mobile web module to a directory'. any location on the local machine. Actual Result: 'Module packaging successful' prompt displays wrong directory location where zip file is stored. It doesn't show the directory path given in the third option where actual packaged mobile web zipped file is stored. Expected Result: 'Module packaging successful' prompt should read and display correct directory location for packaged mobile web module zipped file. This erroneous behavior is found for all three ios , android and mobile web modules respectively.. This is not a regression happens in Studio . Test Steps: latest studio. a Titanium project which must support mobile web . explorer Package - Mobile web observe the window. Actual Result: A red cross with a message 'Project Directory must be specified' is displayed though I haven't chosen any of the three actions mentioned on that window. Expected Result: By default first action would be. Titanium Studio :Android Updater prompt which appears at the bottom right hand side of studio displays 'OK' which is unnecessary.. Mobile Web: After successful packaging of mobile web project , the alert goes away very quickly and hence user sometimes doesn't know that packaging has done.. This defect is specific to Ubuntu Steps to reproduce: Titanium Studio. 2. Create a titanium project. a mobile web module. that module in the project. 5. After packaging the module , package the mobile web project and save it to a desired location. the notification for \"successful packaging\" Actual Result: The duration for successful packaging prompt for mobile web project is too short to relise the user that the process has been completed.. This is not a regression happens on Titanium Studio, build: as well. Tested and found this bug on : Ubuntu and Mac Mountain Lion Steps to reproduce: 1. Open File New - Web Project and choose \"Next\" 2. Select the HTML Boilerplate (cached) version and select \"Finish\" 3. Observe the 'red color' error mark on created new web project. 4. Expand created new web project. Actual result: The \"New web project\" is throwing error on file. Expected result: Default Project should be error free. Screenshots attached.. This bug affects Titanium Studio Steps : out from titanium studio. Titanium Studio . second option on Titanium Splash screen : \"I don't have an account with Screenshot- Titanium attached) 4. Press \"Next\" button. the splash screen which asks for login credentials (Screenshot Titanium Studio attached ) No UI related error should happen . Login Screen text boxes are dislocated upwards and covering Appcelerator logo. Note: This issue is specific to Ubuntu and Ubuntu unable to recreate it on Mac OS X and Windows OS. ", "contenttype": "application/json", "created": 737358, "id": 99, "language": "en", "user_name": "dpandey", "email": "deepti.pandey@globallogic.com"}]}