{"contentItems": [{"content": "Things to address: -Use to manage modal sizes- (implemented in migration2 branch) * Prefer to class refs () (implemented in master). Docker repositories may be accessed in four basic Using the default URL or HTTP (when NX is behind a secure proxy) Using the default URL or HTTP or HTTPS We need to make these options more explicit in the UI. There are a few things we could do to make the UI clearer: Briefly describe how we expect each kind of URL to be used (supplemented by online docs) HTTPS is the preferred way of interacting with Nexus using the Docker CLI. Consider saying this in the help text, or selecting it by default (once the optional fieldset has been checked).. The problem is with settings panels that handle their own load state. Most of the time, load and submit are specified via the api config option: This results in the `submitted` and `loaded` events being called, respectively. The function takes advantage of the config option to reset a forms dirty state when `setValues` is called. We set the values to the return value from `getValues`. However, `getValues` omits fields with an undefined value (for example, checkboxes that arent checked). `setValues` only resets the dirty state of fields for which it has a value. Because unchecked checkboxes arent passed to it, they stay dirty, and the save discard buttons remain enabled. There are a couple approaches we can use to fix this: 1) Add 'off'` to each affected checkbox ( 2) Override the `getValues` method of the `SettingsForm` component to return values for all fields, not just fields with a defined value. 3) Figure out how to emulate the normal behavior of the component (where both `submit` and `load` are handled by the framework) These solutions are ordered by complexity. 1 is simplest. 3 is hardest. Ive filed a PR which fixes the problem using the first approach. Thoughts?. Demo: This bug only occurs in ?debug mode. This bug appears to be tied to infinite scrolling lists only, so only browse and search are affected. Looking at the trace, this may be a bug with the fix Sencha gave us to a grid issue we filed awhile back.. Heres a list of places in the UI missing help text: + Strict content type validation (repository config) + Name (repository config, make it clear that we expect an ID, not a human-readable + Raw repository (repository config browse, need a better name and or description) + Query cache size Nexus trust store (repository config, need better descriptions) (add here!). So we dont have to update it every year. Do this: Copyright 2008-present, Sonatype Inc. All rights reserved.. When certain errors errors) occur, the UI will refuse to load features until it is refreshed. Example: We should change this behavior so failures are localized to features with bad and dont affect the web UI globally.. As a user, if I add columns to a results page, I would like them to remain that way at least for the duration of my session. While testing CLM, I searched and then added Security Issues and License Threat columns to see the results. Unsatisfied I did another search and noticed that those added columns were removed. I realized we just talked about this in a semi-recent meeting but did not see a ticket. I also assume this is behaving as desired and is not a bug. If I am wrong, please feel free to adjust the issue type. While my example was for search, I think this use case would be good for all pages. There was discussion about making this longer than a session, which would solve the minimal case I mentioned above. I did not test NX3 at this time because I believe search (specifically) is in flux. Note: - Could be a mixin that handles this ( Tech Direction: - Configure grids to be stateful. A few places still not using -Review all usage of API- * -Pending further investigation fore coreui and proui. As a user, I want to get what I want quickly and with as few clicks as possible from the navigation menus. I prefer none of the options to be hidden unless essential to avoid In NX3 (Cowbell SNAPSHOT), I noticed on the Privileges page there was a \"Create\" button with a dropdown which resulted in just one item. This took me aback because I am not sure the purpose of having a dropdown with just 1 item, seems like extra clicks to me. On internal review, Daniel suggested \"With the new drilldown panels, we can show a list of types when a user clicks Create privilege instead of having a bunch of buttons up front. Of course, if theres only one privilege type, we just wont show that And decided to ticket. Areas affected that could be improved (on review yesterday): Privileges Roles Respository have 2 drops in their \"More\" (for Tasks (same as above) I did not check NX2 at this time since we are not planning to improve the UI on that unless pressed. I strongly suspect some of these are there however (some may not be, a result from the move from tabs).. Demonstration of the bug: Currently in NX when you have the box icon at the top of the screen selected (or the gear if logged in as admin), if you click to unselect it, it removes the blue indicating that the item is selected but nothing else changes. This was confusing to me as a new NX3 user. For example, if logged in as an admin with the gear selected, if you unselect the gear you remain on the administration section. The only thing that changes is the fact the gear icon is no longer blue. When I posed this to the team, it was requested I file a ticket. My expectation was that there be some behavior when the icons are not selected or suggest that they not be able to be unselected if no behavior is going to occur. Going with bug for now; please change to improvement if you believe it's better. Buttons not present in NX2.. Implement the 8shapes visual index as a tab in the developer console. Reference: Out of scope items: - Icons (we arent using all the icons represented in the style guide). ", "contenttype": "application/json", "created": 737603, "id": 65, "language": "en", "user_name": "dsauble", "email": "-"}]}