{"contentItems": [{"content": "This is the same issue as but for (core). On iOS, all images created by are of type png (mime-type \"image png\") instead of jpeg. As a result resized images are much bigger (in terms of bytes) than what they're supposed to be had they been jpegs. This seems to be related to the handling of alpha channel, according to It works fine on android returns jpegs).. iOS: always returns a png image. iOS: Prevent clearing TextField after password field had focus. On iOS textfields are cleared by default after some password field had the focus. Is this something that could be prevented. I looked at the docs for textfields, but either I cannot find it or it just isn't there. 1. click in the password field 2. click in the \"normal\" textfield 3. press backspace The last character of the textfield is deleted The entire contents of the textfield is now cleared instead of only the last character.. Android: Obfuscation in module JAR. Android: Fix Titanium Build Script in order to support Genymotion Android Emulator. event doesn't do much good as it is fired after the keyboard has already been displayed. to create responsive layouts with different keyboard sizes we need to know keyboard size BEFORE the keyboard is displayed. line 386-407 could be changed to something like this Either that or provide access to both Will and Did.. iOS: before keyboard is shown. a default application LiveView in on iOS simulator into LiveView error does not triggered LiveView error should be triggered. Appcelerator Studio: LiveView does not trigger code errors. TiAPI: Problem with floating point numbers in Titanium. The output of floating point values in Titanium differ from browser JavaScript parsers such as . For example, displays On the output of is Since I have to input floating number for some modules, I must use floating number solution. I can't use a string method. I have also tried Test case Extended test case Log - Unusual Titanium values*. The red view should be located on the black view. The black view is missing. Works on iOS (both the red view and black view show), but not Android.. The of the view from a remote URL is not loading on iOS. It works fine on Android.. iOS: of view from remote URL not loading. If you set an image with a in the path, the image won't be loaded. This is because getCleanUri thinking it's a domain address. Therefore the test on the hash will return false. So the image is downloaded but not drawn. Paste the URL in the browser to verify the URL is valid. Uncomment image to verify it working for standard images. Only the URL with doesn't work. Works on iOS, not on Android.. Android: ImageView: Remote image with character doesn't display. iOS 6: uses animation with animated set to false and animationStyle set to none. uses a fade animation although animated is set to false and animationStyle is set to NONE (see code sample) row is simply inserted without an animation row is inserted with fade animation might also apply to insertRowAfter and appendRow and deleteRow (not tested). The Web Server Preview is not compatible with UNC paths.. Studio: Web Preview is not compatible with UNC paths. Submit Ticket option doesn't work. I'm using Windows 7 32bit and run Titanium as Administrator, when I check for titanium updates, and install an error message appears like this:. Alloy .tss parser doesn't validate colors property. The following code shows an error in the .tss viewer in titanium studio next to the line after \"colors\" below, even though it's correct syntax.. Android: Error if app name contains an umlaut. iOS: Spaces in field of breaks build. Having a with spaces in Laguna Beach generates a red-x pop-up error message in the TiApp Editor: Multiple Markers at this line - 'Laguna Beach' is not a valid value for NCName - The value 'Laguna Beach' of element 'name' is not valid. iOS: Unable to select mobile provisioning profile. When i try to search for updates via help menu I receive the following error: I need to run the update to get access to the mobile SDK.. Not able to run updates. ", "contenttype": "application/json", "created": 737603, "id": 94, "language": "en", "user_name": "dsefton"}]}