{"contentItems": [{"content": "DNN should support JS library packages without their own script, but which just pull in dependencies. This mostly works already, but causes a tag to be included for the empty library, causing a 404 request. h3. Steps to Reproduce Download all packages from which have a numeric prefix Copy those packages to the folder of your DNN website Hit the URL of your DNN website Ensure script combination is turned off Install attached module which requests the JS library h3. Expected Results No script requests that result in a 404 h3. Actual Results * Request for the library folder ), which results in a 404. When a settings class has default values, those values are returned when there is an empty string for a portal setting.. when an user browses a dnn page with the console window open they get an exception at this point: This is caused by no longer being added on all pages (done in - the code should be wrapped in a better check (or try-catch) -see for more details. If SSL is Enabled on the website, the link manager creates https links by default. This was done for DNN-3543. Rather than defaulting all links to https, we would prefer that not consider the setting or the protocol if my site has the alias , and I create a link for or , either way, that should be converted to ). h3. Steps to reproduce: 1. Go to Site Settings and turn ON SSL 2. Go to an HTML module and click the add link toolbar button h3. Actual Result: The link text box is pre-populated with \" h3. Expected Result: The link text box is pre-populated with \" Side note: for some reason I thought it would be a good idea to create this issue as a clone of DNN-3543, and now I see that it copied some info that it shouldn't and that I can't remove (specifically the Sprint, but probably other stuff, too). Sorry.. If the manifest for an extension has a comment in a component, the installer throws an exception: A critical error has occurred. The method is not supported on node type Comment. Line 26, position 7.. The code looks like this: So, it does . But, the webresource urls are encoded and case sensitivity seems to matter. As a result, using results in a URL that's broken when it's added to the page using the function. This is breaking code in some custom modules that need to load JS files.. It'd be wonderful to be able to have a way to mock calls to and other methods on the class.. When a container, such as the default Pop-Up Container, uses controls, errors that occur early in the module's lifetime will cause the to not get setup completely, and throw errors. This means that when errors occur in the module, the users sees an error message that doesn't have anything to do with the real error. In the same way, when they look in the Event Viewer, they need to know to ignore the most recent error, and look at the first error that occurred in the group of errors. h3. Steps to Reproduce Install attached package with example module and container Put module on a page Change its container in module settings to Host: TooManyErrors - Click the See an error! button h3. Expected Results - See real error: \"Unable to cast object of type to type - In the Event Viewer, only errors with that error message are logged h3. Actual Results - See unrelated error: \"Object reference not set to an instance of an - In the Event Viewer, the real error and the unrelated error are all shown The forthcoming pull request has the action controls short-circuit their operation if they detect that they aren't setup correctly, instead of getting to their null reference. This fixes the extraneous null reference errors. The real error still gets logged three different times, which may be a separate issue to look at; however, wherever you look, you see a meaningful error, so I think it's a clear improvement.. When creating a site using the blank template, it does not have the 404 Error Page. h3. Steps to Reproduce Create site with Blank Template ) Go to a URL that doesn't exist ) h3. Actual Result - Error about 404 page not being configured h3. Expected Result - Error page that is a DNN page. ", "contenttype": "application/json", "created": 737603, "id": 28, "language": "en", "user_name": "dukesb11", "email": "-"}]}