{"contentItems": [{"content": "Android open failed: ENOENT (No such file or directory). Description While trying to write the attachment content in the file and the directory used is As per the use case we have to save the content passed from the cloud server to the file and file is opened by using the intents. This approach is working fine for the os version upto Android (lollipop) but on the Android (Marshmallow) its failing. to reproduce 1) Get sample attach to run on Android 5 device 2) Monitor and watch logs. App works fine 3) Get sample attach to run on Android 6 device 4) Monitor and watch logs. App won't load file as expected. Trace. Android: To create a launcher shortcut. Description Currently it is not possible to create a launcher shortcut using the Titanium platform. Titanium allows for the creation of an Android intent using but the implementation of the putExtra method is incomplete. It currently only supports Java primitives. Creating a shortcut requires an intent and an image to be set. Ideally the following example should work: I have created a pull request that adds the missing input types.. A comment with security level 'Developers' was removed.. iOS9: Double project gets created if there is a dash in project name. Description When testing on any sort of Android app (Classic or Alloy), Crittercism is failing to initialise during app launching. Throw these couple lines to These logs on a Samsung Galaxy S6 running Android and a Google Nexus 6 Trace Can be also reproduced using Genymotion emulator.. to reproduce 1) Run sample on iPad Sim device and hit \"Focus to see keyboard w toolbar\" 2) Undock Keyboard by clicking the icon at bottom right. 3) Events work as expected 4) Hide keyboard, noticed toolbar remains in the middle of screen. Case. Description Invoking works perfect if we do a command line build of our app on device. If we take the provided sample app and then publish AdHoc then it fails. to reproduce 1. Launch sample app (Run As Device) 2. Hit Camera Button to Take a photograph 3. Hit Use Photo and monitor logs 4. Image Dimensions are correctly returned (running App on device iPhone5s): : Image Captured, Dims 2448,3264 Aspect Ratio: : Image Captured, Dims 2448,3264 Aspect Ratio: 5. Repeat all steps under Ad Hoc mode. 6. Logs are slightly different now: : assertion failed: 12A366: + 71820 : 0x7d : Snapshotting a view that has not been rendered results in an empty snapshot. Ensure your view has been rendered at least once before snapshotting or snapshot after screen updates. : Image Captured, Dims: Aspect Ratio: NaN : Image Captured, Dims: Aspect Ratio: NaN Case Output (Ad Hoc Distribution) iPhone 4 Dec 16 lAlO wifid : Dec 16 lAlO : Image Captured, Dims: 1936,2592 Aspect Ratio: Dec 16 lAlO : Image Captured, Dims: 1936,2592 Aspect Ratio: iPhone 5s iOS Dec 16 iPhone : Image Captured, Dims: Aspect Ratio: NaN Dec 16 iPhone : Image Captured, Dims: Aspect Ratio: NaN. Description Today now that Google released what should be the final builds of Android L we upgraded our Nexus 5 device to it from the Google Page: I just loaded this in the iPhone Sim and I got the success alert as expected. I tried it on the Android Phone running and it also got the success alert. On the Nexus 5 running Android I get an error alert with this error in the logs attached. code. Attaching native app that makes a Http requestWhat I got is the following: 10-21 D New Host Connection established 0xb9403f30, tid 6087 We will run this on Android shortly.. Crittercism: Add support for Customizing the Version Name. description Looking for a cross-platform way to create image thumbnail files Titanium is able to read an image file asynchronously into a buffer and then a blob. If we assign that blob to the image property of an ImageView, it displays as I expect. However, the blob is not recognised as an image by any of the methods. The blob has a mime type of and a height and width of 0. Meanwhile Android is able to get height and width properly. to reproduce Launch sample app. You can see that the fishImage ImageView loads its image directly from a file path in its \"image\" property. earthImage is loaded in asynchronously using a file stream. Once the file contents are read completely, they are assigned to the image property of Notice, the blob you get as a result of can't be used for any other image manipulation creating thumbnails). It doesn't have a valid mimeType, height, or width on iOS.. Android: Javascript can't get path of assets folder of module. Client is trying to get images from Android Titanium Module and refer to them via Javascript. So instead of return a TiBlob they would like to get path access resolved so they just have to link image in their image proxy on a similar way like: would be contained at As the assets README suggests, if you put the in an \"images \" subdirectory under assets. Then try to refer to it from a Javascript file. to reproduce Create the scenario as follows: 1) Create android module 2) Create directory in assets call 'images' 3) Put an in assets images 4) Create a test app 5) Replace with snippet below. 6) Public the android module into the Test app 7) Launch the test app in an Android Device 8) Notice how nothing shows up If you create an iOS module in the same way as the android module and you publish it, when running the test app on an iOS device, you'll see the image. Snippet details If you try any of these paths and attempt to use a TiUIImageView warning below is thrown as a drawable reference: - 08-27 Could not open stream to get bitmap Other than parity, this can be just a TIDOC issue. But from javascript how does one refer to an image that's included as part of an android module?. A comment with security level 'Developers' was removed.. iOS: and currentCountry issues. issue is NOT working as expected after reading the doc. currentLocale and to work like language sequence another console output I am not competent enough in objective-C and mobile SDK knowledge but the implementation of locale module here looks fishy to me (I would expect for currentLocale and I tested w SDKs and on Mac OSX for iOS.. Setting the property of a TableViewRow to null crashes the app with a close. Setting to an empty string locks up the app (which will eventually crash if you keep clicking or try to back out). This is a problem because we have the need to apply a background image to a row, and then at some point later remove that background image completely. on Droid Razr Android emulator engines V8 Rhino steps 1. Drop the following code into a new project - initially, the row has no background image (property no specified) 2. click the row background image appears (and the caption changes) 3. click the row Force Close messaage appears on the screen, and a appears in the console if you repeat the test with the \"1st test\" line commented out and the \"2nd test\" line uncommented, the app will freeze (nothing new appears in the console window) and then crash if you click the row again or try to \"back\" out. sequence output docs. Picker in scrollView not working. on Android Emulator Droid Razr Engines Rhino V8 to reproduce 1. Run code below 2. Click the picker behavior See fully operational Pickers whose options render on screen sequence. A comment with security level 'Developers' was removed.. When using the texfield on android tablet in the following way, the background of the textfield and its cursor becomes invisible. Modal property true should cause the issue. on Droid Razr non affected Asus Transformer Tf101 with affected sequence. Android: Add the ability to add multiple polygons to the MapView. Request To add routes and allow for multiple polygons to be added to the MapView as well as have fill, opacity and color properties. That would allow developers to implement geofencing (see a common technique for Android apps. notes \"We'd like to be able to hook into the events when a user enters and leaves a geo-fenced polygon or a radius around a geolocated. Splash screen is stretched if window orientation mode is locked up, when launching the app in landscape mode. Environment sequence. iOS: Add the ability to add Vector Overlay on Maps. Constant error: after Studio upgrade. Appcelerator Studio: Top menu bar not appearing. ", "contenttype": "application/json", "created": 737603, "id": 82, "language": "en", "user_name": "egomez"}]}