{"contentItems": [{"content": "Windows: Windows 10 Mobile device is listed as available to build to when not connected by USB. When a device is not connected to a PC but its on the same network as the PC, when building a project for wp-device then it will still show up as available. This is because the utility used to obtain the device information, WinAppDeploy, supports deployment of an app over wifi and therefore will detect devices on wifi. See the below output for the differences between the output. However, I believe that for this to happen the device needs to have 'Device Discovery' in 'For Developers' enabled. I am not sure whether this is enabled by default. It is possible to deploy to a device over the network, but as far as I know this is not supported yet so for now we should filter devices that are displayed by the tool but appear to be connected over the network. to reproduce 1. Connect a device by USB and run 2. Run 3. Disconnect the USB and ensure the device is on the same network as your PC 4. Run result 2. The device will be shown 4. The device will be shown result The device should only be shown when the device is able to be built to, ie connected by USB. When using SDK the Windows 10 SDK is not detected. This means that you are unable to build to a Windows 10 Mobile Emulator as it will error out with the below to reproduce 1. Install the latest SDK 2. Run 3. Build to a Windows Mobile Emulator using result 2. Windows 10 SDK is not shown in 3. The build errors out with result 2. The Windows 10 SDK should be shown in 3. The build should not error out. When building a project using , if selecting a Windows 10 emulator then the prompt will be re-shown without any error being fed back to the user. If building and passing in the emulator ID, such as then the CLI will show the error If this check is taken out and the a Windows 10 mobile emulator is selected then the build will eventually error out with the below on install to reproduce 1. Ensure you have Windows 10 mobile emulators installed 2. Build a project using 3. Select a Windows 10 mobile emulator such as Mobile Emulator WVGA 4 inch 512MB 4. Build a project using result 3. The emulator will not be selected, the prompt will be re-shown and there will be no feedback as to why 4. The build will error with a message similar to result Emulators that are not supported should not be shown as an option to build to. iOS: Building modules errors out due to 'unknown type name 'UIView''. Windows: events are being sent multiple times. When analytics are being sent from a Windows phone they are being sent multiple times. See the attached for an example. This appears to only be happening for events, it seems the event is being sent once when the app is backgrounded and then again when the app is reopened, if the app is quit then the is not sent when the app is reopened To Reproduce 1. Point to staging server to see the payloads 2. Build to device Result The events are being sent multiple times Result An event should only be sent once. When building for Windows if there are mismatched SDKs, the is set to a different SDK than the selected SDK in the CLI, then the build target is not respected and the build will always be to wp-emulator to reproduce 1. Set your selected SDK to a different SDK than in the tiapp using 2. Build using result A new build command will be forked and the build will take place for emulator result The build target specified should be carried through. When getting the version, buildHash and buildDate properties they are logged as the following To Reproduce 1. Using the above code build to a windows emulator Result The logging contains the value Result The values should be values like. When building a Windows platform project if the property is not defined then the build will error out with the below To Reproduce 1. Create a new project 2. Build the project Result The build will error out with the above error Result The build should not error out. Windows: Setting auto for width on labels doesn't work for strings of a certain length. Building an iOS app with and then rebuilding with fails. Description When building a project with a SDK and then rebuilding the project with the build fails with the below. As per the linked ticket when cleaning I do not see the issue, on Android I am not sure whether the issue will occur due to CLI-616. Full output is attached as This issue can be reproduced using Titanium so is not an appc cli issues to reproduce 1. Create a project using a SDK 2. Build the project using 3. Change the SDK in the and run ti sdk select and choose the latest 4. Run again result 2. The build will pass 4. The build will fail with errors such as the one listed above result The build should pass both times. CLI: Node If the CLI is updated to before the SDK is updated then you can't install the new SDK. When upgrading to the latest versions of the CLI and SDK if the install process of the user, or Studio, is to first install the CLI and then install the SDK on their system then the user will be unable to upgrade the SDK without first reverting back to the previous version of the CLI. After installing and attempting to run any ti commands the following will be printed out in the console. This only occurs if the upgrade process is This only occurs if the Node version is It is also possible to get into this state by installing the SDK and the CLI, then running ti sdk select If a user gets into this state then it is impossible for them to be get out of it without having to re-install the CLI To Reproduce 0. Set your ti sdk select to ti sdk select 1. Install the latest Titanium CLI, npm install 2. Install the latest SDK, ti sdk install -b -d Result 2. You will be unable to install the SDK, the command will fail with the above error, Result The SDK should be installed successfully with no error.. When building an application to device and then opening and closing a window the message 'Window: Window is closed normally'. If the window is opened and closed multiple times then the messaged is printed out equal to the number of times it has been opened and closed. This is as it occurs in SDK The logging appears to be coming from line 72 in If the app is packaged and installed onto device then the code at that line is not uted as the if statement does not trigger For example, see the below log output where I have opened and closed the window 3 times To Reproduce 1. Add the attached to an existing project 2. Build the app to an Android device 3. Tap the button to open a window 4. Use the Android back button or the 'Close window button' on screen 5. Repeat steps 3 and 4 Result 4. The window will close ' : Window: Window is closed will be printed in the console. As expected 5. For each time you repeat the above steps the number of log message will increase Result 5. There should only be one of the above log messages shown when a window is closed. When attempting to build to an Android emulator the build fails with. I as it has been reported in previous versions of LiveView To workaround just disable LiveView and the build will be fine Building to device with LiveView works fine and I am able to make changes with no errors Checking the log output shows that the LiveView server has started This issue is not reliant on a node version, it occurs in node as well as To Reproduce 1. Build to an Android emulator from Studio with LiveView enabled Result The build fails with the error above Result The build should not fail and LiveView should be working as expected. iOS: Crashes when accessing certain information of a contact via the contacts picker. When attempting to access certain information of a contact the app crashes and the below is output in the console, the file attached as shows the crash log given. It is the same for all crashes. The information that crashes the application is as follows Any social profile including Facebook LinkedIn Sina Weibo Game Center The when accessing these through the is that they all open external applications such as birthdays open the calendar STUDIO CONSOLE LOG in parity with native behaviour or in parity with Titanium existing behavior*). On an Android L device when using a two column picker the selection indicator and the selected item do not line up and the selected item appears lower than the indicator. This only happens on a Android L device, on a device the two match up correctly. To Reproduce 1. Add the attached to a project. 2. Build to Result The application matches screenshot AndroidLPicker Result The application should match screenshot 442Picker. When is CLI the build fails and the error below is shown. This appears to happen in any SDK and is not specific to the latest build To Reproduce 1. Change ti sdk to using 2. In your projects change to 3. Attempt to build to an iOS or package for iOS distribution by using the CLI. Result The build will fail due to the error above. Result There build should succeed.. When using and setting the properties in the create method to false it is ignored and they default to true. The workaround is to use one of the two ways below to set the properties to false. or To Reproduce 1. Create a project and add the attached 2. Build to an Android and then tap the button Result The properties set to true, the URL is and auto-encoded, in the Studio console you should see what is attached in Result The properties should stay false and it should not auto-redirect or auto-encode the URL.. Verified fix on: Mac OSX Appcelerator Studio, build: Titanium SDK build: Titanium CLI, build: Alloy: Nexus Nexus 5 Using the provided test case built to both devices, pickers are now cancelled correctly. Closing ticket.. Studio should validate the value that it places into the Publisher ID field in currently it seems that the value has no validation as I have seen being placed into the field by Studio. For your reference the regex used by the CLI for this value can be found Set your value to the CLI default to reproduce 1. Ensure you have no value in your ti config for 2. Open Studio and check result The value can be placed into the field and when attempting to build it can cause the build to fail result The Publisher ID field should only accept valid input. Windows: Building for Windows Local Machine fails due to change in build process from CLI. When writing the following and then you follow it up with Studio will hang. Following up with logs in a minute To Reproduce 1. Write 2. Then follow Javascript best practices and end your line with Result Studio will hang Result Studio should not crash with special characters. Diagnostic report should contain the Appc CLI core version number. When attempting to upgrade Studio from or to using , Studio throws the error I have attached the log files a After talking to Praveen it is due to having the Windows Plugin installed on the system. To workaround this I just uninstalled Studio and then re-installed it and it works fine. to reproduce 1. From Studio upgrade to the nightly builds by adding to Sofware Sites 2. Update Studio by Help- Check for Appcelerator Updates Result Studio does not update and errors with Result Studio should update with no errors. Studio: Mac: Options relating Windows projects in Studio on Mac. When creating a project in Studio on Mac the option is given to create a Windows project. As with iOS applications on Windows this option should not be given. The option is greyed out so it can't be selected, if you hover over it then a dialog appears saying that There are also Windows related UI elements in the both the modules table and the deployment targets contain Windows as well as To Reproduce 1. In Studio create a new Alloy or Titanium project. 2. Click next to get to the screen where you enter information. Result The option for Windows will be present but not able to be selected. Result The option for Windows should not be present.. After upgrading to Studio there is a significant change between the previous and the new version. The changes I see are There is now a black bar between the buttons at the top of the screen and the text editor project panels. Buttons have moved around at the top of Studio * Tabs are different I have attached a screenshot of the previous and new version of Studio for comparison To Reproduce 1. Install Appcelerator Studio beta from 2. Open Studio and observe Result There are changes in the UI of Studio Result. Studio: Existing versions of Appcelerator and Titanium Studio are unable to create a project with an SDK greater than. When attempting to create a project using Ti SDK version the project creation fails with the error. When looking in the logs there is no logging that seems related to the project creation, When attempting to create the project from the CLI, the project is created successfully. To Reproduce 1. Install the latest SDK using 2. Attempt to create a project using Studio Result The project creation will fail with . Result The project should be created with no errors.. When rebuilding to an Android device the node processes are not terminated and get stacked up causing high memory usage on the system. The screenshot below shows Appcelerator Studio in activity monitor after 3 launches. This happens on both Windows and OSX. When run from the CLI this does not occur as the CLI requires the user to terminate the process before allowing them to rebuild If the user manually terminates by pressing the red square then it is terminated as expected. To Reproduce 1. Build a project in Studio to Android device. 2. a. On OSX, in terminal run ps aux grep node b. On Windows, in command prompt run tasklist v findstr node 3. Relaunch the project to device Result 2. The output shows only one process, as expected 4. The output now shows 2 processes Result 2. The output shows only one process. 4. The output should still show only one process.. When the Blackberry SDK is installed using Studio the Momentics IDE is not installed correctly. This means that an app can only be built to simulator as you cannot set up the environment to be able to build to device. To Reproduce 1. Install the Blackberry SDK through Studio. Result Momentics is installed incorrectly Result Momentics should be installed correctly. ", "contenttype": "application/json", "created": 737603, "id": 78, "language": "en", "user_name": "eharris", "email": "eharris@appcelerator.com"}]}