{"contentItems": [{"content": "When specifying when trying to build a module, the build will fail. 1. Try to build a module with The build fails with: The build succeeds. I am encountering crashes on iOS 9 devices and sims when creating a contact group, using your above code and SDK. When all the action buttons are removed from above the keyboard and a keyboard button is pushed, the bar for the action buttons is hidden. If the action buttons are then toggled back on, they display on top of the keyboard. See attached gif: Example code: 1. Launch an app using the above code on an iPad 2. Click on the textfield 3. Click the 'Toggle Field' button 4. Click any key on the keyboard 5. Click the 'Toggle Field' button The action buttons are shown on top of the keyboard The action button bar appears and contains the action buttons This could be an iOS issue. Connecting an iOS 9 device causes devices < 9 to not be recognized. Connecting an iOS 9 device to your machine will cause devices with iOS versions less than 9 to not be detected. 1. Plug in a device with iOS version less than 9 2. Run 3. Plug in a device with iOS version or higher 4. Run 2. The older iOS device is shown 4. Only the iOS 9+ device is shown 4. Both devices are shown Tested using 3 devices as well: 2 devices < iOS 9 and 1 device iOS 9+: Only the iOS 9+ device shown 2 devices iOS 9+ and 1 device < iOS 9: Only one iOS 9+ device shown. iOS: Cannot build for with Xcode 7; CompileC error. When using Xcode 7b5 with the stack, I am unable to build for iOS devices or package the app. I get the below error: : 1. Create a new project with the stack 2. Run the app on an iOS device () I get the above error and cannot build I am able to build without error : The same environment, but using Xcode successfully builds. Using and results in the same error.. When trying to create a project with the below command I get the error in the section: 1. Set your active SDK to or later (I used 2. Run 3. Create a Native App The creation will fail with the below error I can create projects without error This blocks projects from being created in Studio. I encounter this with SDKs and later.. Launching Sim asks for computer control. When running an app on a simulator, terminal requests permission to control the computer. The simulator also performs a 'Hardware - External Display - Disabled' action. Is this required? Can these be removed? 1. Create a new project from the CLI 2. Run the project on an iOS simulator Terminal requests access and the simulator performs 'Hardware - External Display - Disabled' The app can run on simulator without requesting access or performing menu actions. This appears to only occur with simulators that do not support Watchkit. When using Xcode 7, I am unable to install to the iOS 9 Simulator when creating and building a project. : 1. Set Xcode 7 as your selected Xcode version 2. Create a new project with 3. Run the project on your iOS 9 simulator using : The simulator will launch but will never install the app (stays on 'Launching iOS Simulator') : The iOS 9 Simulator installs and runs the app : If using Xcode or targeting a < iOS Sim, I can run on Simulators as expected. Not sure if this is an El Capitan only thing.. Cannot install to iOS 9 Simulator when using Xcode 7. I am unable to build for iOS via Studio when using iOS 9 and Xcode 7. Combine this with MacOS not allowing the use of any Xcode less than Xcode 7 and the user is left not able to build for iOS, after updating. 1. Install Xcode 7 2. Create a new Titanium project 3. Attempt to run that project on a iOS Sim or device from Studio You are unable to run the project The project can be run on iOS 9. The iOS 9 simulators are not detected by If using , you are able to run the project. Simulator will fail via CLI.. Geocoder sample from Studio dashboard fails with uncaught NSException on simulators. Running a project for Mobile Web open which is an unavailable page. : 1. Create a new project in Studio or via the CLI 2. Run the project for mobile web (Preview in browser) : is opened in your browser and it is an unavailable page : The app is successfully run in browser : The project looks to be created correctly and manually opening works fine. When upgrading to the latest versions of the CLI and SDK if the install process of the user, or Studio, is to first install the CLI and then install the SDK on their system then the user will be unable to upgrade the SDK without first reverting back to the previous version of the CLI. After installing and attempting to run any ti commands the following will be printed out in the console. This only occurs if the upgrade process is This only occurs if the Node version is It is also possible to get into this state by installing the SDK and the CLI, then running ti sdk select If a user gets into this state then it is impossible for them to be get out of it without having to re-install the CLI To Reproduce 0. Set your ti sdk select to ti sdk select 1. Install the latest Titanium CLI, npm install -g 2. Install the latest SDK, ti sdk install -b -d Result 2. You will be unable to install the SDK, the command will fail with the above error, Result The SDK should be installed successfully with no error.. This is a regression. When packaging for iOS, I see the below error. Xcode is still opened and the is still created, however. : 1. Create a new project with SDK 2. Package the project for iOS (either adhoc or for the store) 3. Notice the above error in the console : No error is shown : 1. This is a regression as I do not see the error with 2. I get this error with Xcode as well as. App will crash while parsing XML. : 1. Create new project using attached 2. Run the app 3. Click \"load\" until the app crashes (wait for parsing to finish between clicks. Could take 10+ clicks) : App will not crash : Does not occur with SDK This is a regression See related tickets below : This is what is left in console after the crash occurs. It should convert up to number 745. I get the below output and the app crashes to the home screen.. When opening a window with a file as the url, I occasionally see a \"Maximum call stack size error. : 1. Download, Build, and open included project (proj 1) 2. Click on Test 2 3. Click on open win2 4. Click on open win3 5. Click on Close Windows 6. Repeat steps 2-5 until error occurs (sometimes on first try, other times it takes a while) : Windows are able to open without error. : I am attaching two projects that encounter this error. If the windows do not use a file for the URL, I do not encounter this issue. I also have not been able to encounter this with Titanium SDK Download projects here: Proj 1: Proj 2:. No change is witnessed when attempting to change a searchbar's background image : 1. Launch the sample code below 2. Click on \"Click to set image\" 3. Notice that the background of the searchbar is not changed : The serchbar background is changed : I see the same behavior with and GA. When is called on a with zero or one camera, a runtime error is thrown. If is called on a with two camera's (and one has been opened) then no action is performed and no error occurs. . : 1. Build a project with the attached files, for a device with 1 or no camera 2. Click through the camera test buttons 3. Notice that they correctly open the camera or not, depending on if that camera exists on the device 3. Click on the \"Invalid Camera\" button 4. Notice that a runtime error is thrown : No error is thrown and no action is performed (like the camera buttons for cameras). : I was unable to encounter this error on devices with two cameras, despite the same code and 'undefined' parameter passed.. is undocumentated. When trying to create an Alloy project component (Controller, Widget, View, by right clicking the project. The \"OK\" button when entering a name is unresponsive. See attached gif. 1. Create an Alloy project 2. Right-Click the project and select \"New - Alloy Controller\" 3. Enter a name and click \"OK\" The Controller is created successfully The \"OK\" button is unresponsive This applies to all project components (Controllers, Migration, Model, Views, Styles, Widget). After performing a clean install of Studio, I am unable to open it. The launch is stuck after entering login credentials, on an \"Installing Node\" message. Node was installed with the installer package, so Studio should not need to install it again. 1. Clean your system of any components 2. Install Studio via the installer 3. Launch Studio Launching Studio gets stuck on an \"Installing Node\" message Studio is able to launch successfully. h3. Description I created an application and I tried to enable the services, it failed with no error just analytics got enabled h3. Steps to reproduce Enable services No other services are enabled Log doesn't show anything, and MATT log has no info h3. Notes This seems to occur when Studio does not ask for login information on startup and prompting breaks.. When Dashboard loads, an error is shown in the console: : 1. Open Studio on Windows 2. Open the dashboard and have it load 3. Notice the above error in the console : No error message is shown : Issue could be causing sample's background images to not load. See related ticket.. When attempting to update Studio I am greeted with the below error. Studio says the update is complete, but no change is observed. : 1. Open Studio 2. Check for Appcelerator updates 3. Attempt to install updates 4. Witness the above error : I am able to install the update without error : Please see the attached screenshot of the error, as well. Initial investigations of the issue pointed to a permission issue between the 'sudo install' process and the non-elevated permissions during updates.. Update fails to install properly; Password folder created. I was prompted to install an update for (moving from to No matter how many times the update was installed, I was prompted to install the update again. This started happening after changing from 32 bit Studio to 64 bit Studio on Mac. This command was used to install an ACS update: The update was not properly installed and a \"Password \" folder was created in my folder and in my home folder. Install location was: Running the above command without the -H option resolved the issue.. Error on project creation & Alloy is not an option when creating a new project. ", "contenttype": "application/json", "created": 737603, "id": 80, "language": "en", "user_name": "ewieber", "email": "ewieber@appcelerator.com"}]}