{"contentItems": [{"content": "h5. Problem description An exception is thrown when analyzing the 'TODO' Alloy test app enabling the 'Process Unvisited Code' from the Preferences. Attaching the sample app. 1. Import the sample in Studio (Sample app attached here) 2. Open the Code Analyzer preferences and enable all the Settings, including the 'Process Unvisited Code' one. 2. Run the Code Analyzer (either for Android or iOS) Following error is displayed: h5. Note Not been able to reproduce the issue with Field Service app or with a default Alloy new template. h5. Additional log Additional log running the Code Analyzer from terminal:. values used as comparison to determine device form factor are wrong. h6. Problem Building for Android device from CLI, with also the Android emulator open, generates an Error Message at the end. However the app is actually correctly installed. h6. Steps to reproduce 1. Be sure to have the Android Emulator open 2. Attach a device and build a project for the device from CLI: $ ti build -p android -T device Result: application is correctly installed on the device, however from console there is an Error message in the end. (also note the typo: \"appliation\" in the line). iOS: getVisible() getEnabled() functions could return null value. h2. Problem description Boolean functions like getVisible() or getEnabled() can return null value h2. Code sample Result: After running the sample code, click on the button to ute which return value 'null'. Expected result: If the property was never defined by the user, then the default value should be returned.. h2. Problem description 'Focus' events might not correctly handled when associated to a window set in tabGroup and with the url property h2. Steps to reproduce h3. Steps - Create a tabGroup with 2 windows. - Set the url property for each window and define 'focus' event listener in the two and files. - Don't set event listeners in the Result: 'focus' event listeners ae not triggered on Android (on iOS works fine). h3. Code h2. Additional notes: Customer ticket :. Android: activities does not get correctly handled if first opening a window and then a tabGroup. h2. Problem description The app opens a window for login - then opens a tabGroup. Android activities are no longer handled correctly. h2. Steps to reproduce See location for the project in the comments. Attaching logs relative to successful and failing case. Successful scenario: The first window is not included in a tab group. Click on on \"connect with facebook\" - then click the 'buy' button and click the \"facebook friends\" button (window i snow included in a tabGroup). Facebook friends are displayed. Failure scenario: Click on login with buddy beers and use the credentials: - click the buy button and click the \"facebook friends\" button (window i snow included in a tabGroup). After being connected with Facebook, friends list is not displayed. h2. Additional notes login window when you start the app is ; tabgroup is in ; facebook api are invoked in and in. h2. Problem Memory leaks when opening and closing a window including a tabGroup h2. Code and steps to reproduce Steps followed with allocated memory and of objects: 1. Run the app (memory 3144MB - Objects 60,139) and click on 'create tabGroup' button (mem 8053 - Obj 148,156) 2. Hit back button (mem 4457 - 91,059). Reference to MY TABGROUP is still present and is still not GC 3. Click the GC button to set MY TABGROUP to null (mem 4234 - Obj 86,654) 4. Click on create tabGroup button (mem 9007 - 172,396) 5. Hit back button (5408 - 115,292) Memory increase in size subsequently repeating the steps. Attaching also the log file. h2. Additional info Customer ticket:. Internal error \"Index out of bound\" creating a new project and editing. Node processes are not closed when re-launching projects on iOS device. h5. Problem description When relaunching a project from Appcelerator Studio, node processes are not closed and get stacked up, eventually using a lot of memory. h5. How to reproduce h6. Steps 1. Create a project in Studio and run on iOS device 2. Check Activity Monitor 3. Run the project again and check activity monitor h6. Results: 2. A node process is shown under Appcelerator Studio 3. Previous node process is not closed and a new node process is created. See screenshot - node processes in the Activity Monitor after using Appcelerator Studio to launch the app multiple times. h6. Note If the Stop Red button is clicked on Studio before relaunching the project, the node process is closed as expected.. h5. Problem description Appcelerator Studio doesn't display errors correctly when running an Alloy project on Windows. h5. Steps to reproduce 1. Create a new Alloy project 2. Use the following code for 3. Build run Result: Build fails as expected but the errors are displayed incorrectly and there is no information regarding the file name or line number 4. Build run from CLI Result: Errors are displayed correctly:. h5. Problem description After building an application, it could happen that the app is built and runs fine, but Appc-Studio seems to be still doing something in the background - specifically, Launching delegate, displaying an ongoing activity in the bottom-right corner, staying stuck at 57%. h5. Steps to reproduce 1. Create an iOS app and build for iOS device Result: app is built and run correctly. However, in the bottom-right corner of Studio, there is an ongoing process (see Screen Shot Expected result: Studio should show no ongoing process. 2. Click on the bottom-right progress bar Result: Progress window is displayed, showing details on the ongoing process (\"Launching delegate\" progress information is shown). See Screen Shot Expected result: no ongoing Studio progress should be shown. See the attached screenshots 3. Perform further actions on the app project (build, clean workspace Result: It is actually possible then to do everything (build, clean workspaces etc). It seems Studio is not really hang in there, but it shows to stay in the state as shown in the screenshots. So far has been reproduced when an App on iOS device. h5. Additional notes It seems there could be a memory issue too - still not sure if related to this, but at the time of writing and while experiencing the described behavior, checking Activity Monitor, Appc-Studio is using of memory which seems to be too much. Investigating.. h5. Problem description Geocoder Alloy sample on Android is crashing when filling in an address. Reproducible only with Alloy - so is a regression h5. Steps to reproduce 1. From Studio, import the Geocoder sample app. 2. Edit and remove (looged a separate ticket: 3. Run the sample on Android (tested on Google Nexus Galaxy 4. Click on the textfield and search for an Address Result: app crashes Crash log: Not reproducible using Alloy version. Geocoder: Android: Alloy sample is crashing after filling an address. h5. Problem description Alloy command in the 'New' menu are displayed incorrectly. h5. Steps to reproduce Go into a project and right-click on any file in the project. Go to 'New' Result: List of possible options is displayed. Alloy commands are displayed incorrectly - see attached screenshot.. starting Studio. h5. Problem description After starting Appcelerator Studio , a is thrown. From the log, it seems to be related to updating Android info. Everything still works as expected after that and the Android emulators are correctly working. Studio log: h5. Environment Appcelerator Studio TiSDK Android SDK Tools Xcode Android AVDs: . Android - ARM . Android - Intel x86 . Android - Intel x86. h5. Problem description Using CMD+ and CMD+delete is not possible when editing Reproducible on Appcelerator Studio versions - - h5. Steps to reproduce 1. Open a project and edit file 2. Press CMD + on a line Expected result: line is commented out Result: nothing happens and following error is displayed 3. Press CMD + delete on the end of a line Expected result: line get all deleted Result: nothing happens and the following error is displayed in console 4. Edit another .xml file, for example an of an Alloy project. Use and on a line of code Result: shortcuts work as expected.. h5. Problem description As explained here: when creating a new Alloy Model, also the 'properties' adapter should be supported. Creating it through Studio, only sql and localStorage options are displayed. Not a regression, also present in Studio Running: from Terminal returns the correct output: h5. Additional notes localStorage adapter should probably be deprecated in favor of just properties (and sql). See. h5. Problem description The default new app 'Two-tabbed Alloy Application' is wrong. Instead, The one relative to a 'Default Alloy Project' is created. To reproduce, just create a new Alloy project from Studio and choose the 'Two-tabbed Alloy Application'. The project created is the 'Default Alloy project' one. Still reproducible with Titanium Studio , TiSDK and Alloy. h5. Problem description Could not open in the editor. After double clicking to open it, an exception is thrown. This is currently happening only in one of my Alloy projects I was working on. Currently not happening on other projects. Attaching Studio log, Error details and Diagnostic Test output. After restarting Studio, is being opened correctly. h5. Problem description When launching the debugger on device, the 'Debug Configuration' popup window always appears and the SDK Version' drop down menu is not displaying a default SDK. h5. Steps to reproduce 1. Create a default project (Alloy or classic one) 2. Run the Debugger on Android device Result: the 'Debug Configuration' popup window always appears and the SDK Version' drop down menu is not displaying a default SDK. The user can then menu and start the Debugger. The configuration is saved as a new one and next time the debugger is launched the user is prompted again with the 'Debug Configuration' window and no SDK is selected by default. See screenshots.. Debugger: Android Debug Progress window bad behavior on Windows. h5. Problem description On Windows, the 'Debug on Android device' progress window it's not showing the progress as expected, eventually not automatically hiding. h5. Steps to reproduce Only reproducible on Windows. 1. Create a new project (classic or alloy) 2. Set a breakpoint and launch the debugger on Android device Result: the 'Debug on Android device' window appears. No progress is shown after the second bullet 'Device connected. Performing pre compilation tasks'. The progress actually goes on and eventually the app is launched and breakpoints works fine, but the window stays on top. 3. Click on the 'Hide' button. Result: the window is placed on the background and the user is able to use the debugger as expected. However, a 'Debug on Android Device' bottom right notification is displayed - clicking on it, the Debug Progress is shown again as stuck at the second bullet. See screenshots.. h5. Problem description Under Windows, setting a breakpoint on the original controller source did not cause the app to break where expected. Setting a breakpoint on the generated controller source works. h5. Steps to reproduce h6. Sample 1) Set a Breakpoint at line 2 ( + a); ) 2) Debug for Android Result: Breakpoints are ignored See Jira bug: for investigation done regarding source map (confirming it's working as expected). Attaching file.. h5. Problem When changing an XML tag in an Alloy project and using code completion assistance, the old closing tag it's not deleted. h5. Example Starting from the sample here, add 'R' to the TableView tag (in order to create a TableViewRow instead) and trigger the code completion assistance. is automatically chosen from the options. Result: TableView closing tag is still there and has to be removed manually.. Alloy XML Closing tag issue when modifying using completion assistance. h5. Problem By default, Studio is setting the key binding for displaying Context Informations. It does not work anywhere in any project or file type. Also, going into 'Titanium Studio - Preferences - Keys', it's not possible to set the binding for any Command. In this case, signs are displayed but the 'Space' is not, so it's not possible to save this Binding for any Command. Changing the Binding for the Context Information to something else (for example, works as expected and in this case the Context Informations are displayed correctly. Tested and reproduced on and latest nightly build. Not a regression.. Alloy: add hover info for Alloy projects .tss and .xml files. h5. Problem Code completion is not being displayed for Alloy .tss files. h5. Steps to reproduce 1. Create a new Alloy project 2. Open and edit the file - for example: Code completion is not being displayed. Also when hitting 'return' key in the middle of the brackets, the closing bracket is not being correctly aligned. Using GA version, part of the expected code completion is displayed. Code is also formatted correctly, so I would mark it as a regression. STUDIO: Overview detects an error if creating a new project and importing in Studio. ", "contenttype": "application/json", "created": 737603, "id": 93, "language": "en", "user_name": "fcasali"}]}