{"contentItems": [{"content": "Windows Parity: Cannot set local URL or HTML in a webview in Windows Phone. When trying to set html or a local url to a webview in Windows Phone, it fails. Example code:. Android NDK r11c installed via Android Studio or dowloaded no longer contains the file we look for in these two scripts: As consequence you cannot use it: It does have a file which has the build version (not the named one): None of the 53k files seems to have the named version.. Regression: Alloy-themed i18n and platform folders no longer work since Ti. With TIMOB-19691 we have added support for Split View and Slide Over. When the app Slides Over or changes to from Split View, the and in one occasion events are fired. We have not documented this, but I'm filing this in TIMOB because we might want to find out if there are ways reasons we should split this out into specific events for Split View and Slide Over. For a list of events in which and are fired see the Sample Source: The event actually covers pretty much all scenarios, except for one AFAIK. When your app is on the left side of a Split View and moves back to fullscreen because the other app closes or switches to Slide Over you will not get notified. It would be great if we can somehow detect this as well.. Regression: \"rendering artifact\" between launch image and first view. With TIMOB-19694 we have implemented support for Storyboard Launch Files. This causes a regression that even if you do use Storyboard Launch Files you now see a \"rendering artifact\" between after the Launch Image is dismissed and the first view of the app opened. This is in particular visible in apps that need to do some heavy stuff before they open the first view. The following sample and attached demonstrates: If you use Storyboard Launch Files you see similar behaviour, which TIMOB-20497 deals with.. Main Thread: undefined when enabled and run via LiveView. With the WWDR certificate expired this weekend, users run into issues replacing it. When they add it to the login (which for me is default) keychain Titanium does not find it. It must be in the System keychain to be found. This Stack Overflow user found out where the bug is: I've tested this and indeed this fixes it. PRs are attached. This is critical due to the WWDR expiration and must be merged for I've added a note to this blog post:. As found by and reported on the Hyperloop plugin fails when the source of the app does not actually use Hyperloop. It will crash with: PR incoming. If you download the example app linked form the body of and run it for iOS straight away ( the Hyperloop compile will fails with: h2. Cause Hyperloop should not compile JavaScript files in that are in folders for other platforms then the one you build for.. Hyperloop: Should not compile folders for other platforms. When attempting to use Peek and Pop with a Tableview previewContext property, no index properties are provided when a row is clicked, making it impossible to display row-specific information content. Code missing TableView. The new properties for the should be renamed to as that is the name we use on all other API's like .. Line up *Authorization properties. Just a small change to align the property names between the 4 API's for better predictability (ability to guess the property name without using docs).. While working in the I noticed some differences between the responses of the new permission request methods. I created a separate test case to show the differences so we can address them in a next release. Nothing big, except for the first bullet maybe. The response for also has , which would be very useful to have in the response for the others as well. When unknown, has a not very helpful Access Denied instead of just being undefined like and . When denied, the response for has no like the others. * I have no idea where h2. Logs h3. Scenario: Deny All Because of TIMOB-20002 I use the Ti Sample App to read the Geolocation callback: h3. Scenario: Denied Before Because of TIMOB-20002 I use the Ti Sample App to read the Geolocation callback: h3. Scenario: Allow All Because of TIMOB-20002 I use the Ti Sample App to read the Geolocation callback: h3. Scenario: Allowed All Before Because of TIMOB-20002 I use the Ti Sample App to read the Geolocation callback:. The following code demonstrates that when you deny permission, the error messages in the callback payload are prefixed by the namespace followed by no spacing. Expected behaviour is not to have a prefix at all. Related code:. Both on device and in Simulator I can't get the callback for in the following code to be called, even though - the first time - the dialog requesting permission displayed. Which is weird, because in the it does call and is implemented in the exact same way. Removing everything in the button event listener except the request call doesn't change it either. For a clean slate either change the app id, reset the Simulator or just Settings General Reset Reset Location & Privacy .. The TextField and properties should be renamed to to better describe what appearance they are about. TIMOB-19940 has already used this new name for adding appearance control to the AlertDialog input fields. To prevent confusion we should resolve this ticket together.. The attached sample project demonstrates that with app-thinning enabled, you cannot include a suffix in the image path. This works fine with app-thinning disabled. 1. Build the project with app-thinning enabled and confirm you see the placeholder image 2. Open and change to 3. Build the project again and confirm you see the image. The code where we hash the image path should strip out any suffixes (including etc).. Switching the setting in does not force a rebuild. If you enable it, image assets catalogs be added, but the images not removed. If you disable it, the images be added, but the image asset catalogs not be removed. Code:. While working on the permissions sample app I ran into some The API reference for lists all constants as possible values, while only and are valid. On Android , and will call back with if the required permission is missing in but on iOS will not call back at all when the required key is missing in . It should call back with as well. For both and wouldn't the expected behaviour be that if was granted then would be seen as granted as well since always when in use?. iOS: Permissions (Geolocation) Bugs in implementation & documentation. Android module build should support AIDL files. Android: CardView should use standard property names. The following sample shows that both and work, but the one with doesn't show a border corner radius. Because of TIMOB-19801 I cannot verify, but I guess when I would set both I would see a rectangle without radius behind one that has? Is there an actual use case to have both (working, if we resolve TIMOB-19801)? If so, then we need to document the difference. If not, then I'd say we rename to . I'm not convinced deviating from standard properties like , , and . Pro: Titanium developers are used to our naming conventions throughout what is after all a cross-platform SDK, even for components. Given my experience that most Titanium developers do not read the target platform references but rely on our docs and - lazy as developers are - the predictability of our API I think we should: Rename to . * Remove the prefix from the properties.. CardView: Layout property not working as expected. After a few successful builds to my iPhone 6S the new started crashing when launched. The only way to fix it was to remove the app and then redeploy it. Replacing the app with a new build without removing it didn't resolve it. A full crash log attached, which makes it more clear this is related to our analytics. Our analytics should me as fool-proof as we can make it. We should catch all exceptions to prevent the app from crashing even though that means analytics is no longer working.. Two it has app was rejected by Apple because: Details We were unable to locate some of the features described in your marketing materials or release notes. Specifically, your app uses the Handoff API, but does not provide Handoff functionality. Please revise your app to ensure that these features are fully implemented or revise your application to remove the Handoff API from use. We look forward to reviewing your revised app. Best Regards, App Store Review I know we're not including API classes that are not being used, but of course for Handoff, App Shortcuts and other features we set up delegates in our bootstrapping as well. It looks like we might need to somehow do this only if it is actually used. Options: Scan the code for usage of the APIs (which we do anyway) and then set a build flag which we can then use in the bootstrapping code.. It works on emulator as well. So that and the error makes it look like an Android 6 runtime permission thing, but why does it work fine on device then?. The following sample based on the shows that on Windows ListItem titles default to black, which is not readable on the default black background color. It also shows that setting the property of the ListItem doesn't work either, which is but makes the built-in templates pretty much useless.. If any of the app icons are missing, then search for and and us it to generate missing app icons. You simply need to the base Builder object's method:. If any of the app icons are missing, then search for and and us it to generate missing app icons. You simply need to the base Builder object's method:. When I run and select I get: However, on and via it has as the last version. The array does have but the CLI should look at not . h2. Related code h2. Proposed chage The above lines with:. Our current templates are in Obj-C while many Xcode developers are switching to Swift. Titanium developers with no little Xcode experience will likely also find Swift easier. So, we should have Swift-versions of the applewatch templates and probably default to that. Obj-C (current) PR:. Use name method event names on Titanium and Watch side of session. Most methods, properties and events of share their names with the Apple Watch side of the session. However, some are not and this could easily lead to mistakes so the more we can align them the better. On Apple Watch: On Apple Watch: ** On Apple Watch: The prefix for the events is a bit redundant anyway and since is more Obj-C delegate style then JS, we could use for .. While working on the I noticed that on the second and following builds the app is in letter box mode and the icon and launch image is missing (which triggers the letter box of course). Probably related to the incremental builds.. On iOS accepts an array of views: On Android it does not: This is a very useful feature and looking at the iOS code simple to implement for Android and Windows as well. Related question on Q&A:. iOS: ListView randomly not shown since. Android: Date & Time Picker change event not fired nor is updated. Windows: property should be set (to \"en\") in manifest. We to English for generating strings, but we don't set the in the manifest. This defaults to the language of the OS you build on so as long as this is also English, all is OK. But if you build on a system with a different language you get errors like this during the build and it will probably not work well. The resolution is simple, it should set the in the generated manifest. Also take note of TIMOB-16356. The following code works fine on iOS and Android but will crash the app on Windows, :. The attached shows that the first time I swipe a list item to show the custom editActions I've set, it displays the default delete action. The next time I swipe the (or another) item, I do see the custom editActions. This seems to only happen when I set both and to . I have not been able to reproduce this when I did not set and also no on device, only in iOS. The new is camel-cased and though I love that, we have been using all lowercase and we should not mix conventions. So the event should be , like the new and on the same ListView API. It might be even better to name it since that is in line with the , , and property names.. New `rowAction` event should be `rowaction` (or `editaction`) like other events. I had been running various earlier master versions of the Titanium CLI and SDK and simply updating the Appcelerator CLI failed for me somehow. So I did a clean install, which worked fine. But builds do not: Running it with the Titanium CLI directly gives:. Every android app we build includes a few : or per window: Ideally, the new themes would follow the same naming convention as the Translucent ones: As you can see the existing theme can inherit the new so that it is still available under the existing name. With these new themes in place we could also restore the . This would select the for theme if is also true. The attached test app shows how these new themes would work, by adding them via a custom theme.. Windows: Time between creating Date() objects runs a factor 1000 slower then reality. The following code demonstrates that when you create a object in a or method the time is off by a factor 1000. If you run you will see that this also occurs when you have a expensive computation that takes several seconds and you log the time before and after. I did the tests on the Emulator, but looking at the results achieved with the same is true for device.. Regression: ACS Photo uploads fail on. Only in iOS Simulator strips text after the first placeholder when using the SDK. This bug seems to have been introduced by the following commit to make the SDK 64-bit safe: h1. Test Case Run the following code using: ( ) Ti iOS device ( ) Ti iOS device * ( ) Ti iOS simulator. Critical: Removing a ListView while SearchBar has focus results in crash. A popover that has a SearchBar attached to a ListView will crash if it hides will the SearchBar still has focus. Same goes for when the ListView is removed from its parent view while the SearchBar has focus, so that seems to be the actual problem. The crashlog is attached. h1. Test case 1 1. Install an app with the following code on an iPad (crashes on iOS Simulator as well, but doesn't show crashlog) 2. Tap the button 3. Tap the searchbar to focus 4. Tap outside the popover to hide it 5. App crashes after a second or so h1. Test case 2 1. Install an app with the following code on an iOS device (crashes on iOS Simulator as well, but doesn't show crashlog) 2. Tap the searchbar to focus 3. Tap the button to remove the ListView 4. App crashes after a second or so. A few weeks ago I started noticing that a lot of apps where I used complex and layouts were showing their children before they were layed out. I made a simple test case that showed this has been the case since and is not related to iOS 8 which I first assumed. In some occasions I've (as well as Jason) have seen the children not being layed out at all! h2. Test case Run the following test case again Titanium or later: h2. Attached videos The movies I recorded show clearly that the children show center-top (except the first label which has before being layed out at their proper place. Before Titanium the children views didn't show up until they were layed out, which of course looks better. - Titanium & iOS (vertical) ( ) - Titanium & iOS (vertical) (x) - Titanium & iOS (horizontal) (x) - Titanium & iOS (vertical) (x). The ImageLoader utility class doesn't have support for Retina HD images: - serialize: - entryForKey: Pull Request:. iOS8 brings the to iPhones: - should be moved to - The that is now should probably be replaced by I'm not sure what originally was the reason for using MG's instead of the official one? Credits to Malcolm for bringing this up.. If you follow the guide to hide the ActionBar using a custom theme and at the same time also follow the guide to use 9-patch splash screens the application window will be small and sitting in the top left of the screen, uncovering the splash screen under it, as shown in the attached screenshot. h1. The guides Just before the 3 steps for custom themes, the introduction of the following splash-guide says you do need a custom theme if you just name your 9-patch splash screen images : - The following shows how to use a together with a small change in to hide the action bar on all windows: - h1. The problem Both of these guides at themselves work just fine. But when you follow both of them you'll get the problem described. h1. Steps to reproduce 1. Download the attached example project 2. Build to see the expected white application window 3. Rename to 4. Build to see the white application window in the top left h1. Explored solutions I've tried several changes such as using instead of or setting the splash in a custom theme, but nothing helped. I also compared the builds after step 2 and 4 of the steps laid out to reproduce. All the (non-binary) files were 100% identical, so the error must be in the compiled JAVA and not in the generated XML themes. h1. Workaround I can't think of a (satisfying) workaround, so I hope this can be fixed soon.. iOS: No event generated on click of map annotation title or subtitle. h5. Problem When clicking on an annotation in a mapview, no event is generated for SDK but its working well for SDK For more details visit h5. Test Code h5. Steps to reproduce Please follow my steps to reproduce this Create new project Replace code to my test code Run with IOS SDK Click on annotation pin. Annotation appears with title and subtitle Click on title or subtitle Its shows alert message Now change to iOS SDK and follow steps 4 to 6 For iOS 7 8, if you click on title or subtitle, alert message will not display. iOS: Switch - Disable animation on init and allow developer to disable for setValue. Studio can't deal with Genymotion or later. Genymotion changes the location of the player internally in the App Package. We fixed the CLI with TIMOB-20130, but it seems Studio needs a similar fix here: But ideally, Studio should just rely on the CLI and not duplicate this logic. Reported on Stack Overflow:. With and nightly installed, Studio update says Latest Titanium SDK already installed and does not install Renaming the folder to or the original does not fix it. Removing the folder does. I traced it back here, but can't really tell why it thinks is already installed: Looking at the code for and it should find as my latest SDK. So then something must be wrong with which uses Wherever the bug exactly is I think we can simplify and make this a lot more stable: Don't rely on the SDK release version name (for available releases) and folder name (for installed releases) to determine what is available and installed, but use the checksum or timestamp (TIMOB-19541, see ) so the logic does not fail if people rename SDK folders (CLI-910). * Don't compare if the latest available release is newer then the latest one installed, but simply check if the latest available release IS installed. This removes all the points of failure in stuff like Logs to help debug the current issue:. Studio only has beta Software Site and switching via Studio Updates doesn't change it. We've had a number of users reporting LiveView does not work anymore on Q&A: On a freshly installed El Capitan I can now reproduce this as well, every time. LiveView never works. Suspecting NodeJS was involved, I've tried both the version our installers installs and but all with the same result: I've done some debugging in The following I found at : The last is my computer's public IP. The following I've found on : As pointed out in the Q&A, indeed changing the to resolves the issue.. The prompt for the name should say WatchOS2 project name and have the name of the Titanium project filled in as default. !Screen Shot at Project names with spaces are perfectly fine and work via the CLI. The prompt in Studio should apply the same validation as the CLI. !Screen Shot at Watch App XCode Path should be Xcode Path (lowercase C and equal to Tiapp Editor). The Device provisioning profile list should default to the default development provisioning profile since that will probably be wildcard and what people use for this option. !Screen Shot at. After update to Studio I keep getting the following. Studio becomes slow to respond. Here is the error log:. Regression: Slow due to \"Failed to get the node modules path for package alloy\". Studio hangs whenever generating an autocomplete list when editing an Alloy XML file (not when editing Here's a relevant excerpt from my studio. Samples view lists out-dated Alloy RSS sample app and updated version as Classic. The Samples view (not those on the Dashboard) lists an out-dated version of the Alloy RSS sample under Alloy (1st screenshot) The Dashboard has the updated version: The Samples view also lists the updated (former classic) version under Classic (2nd screenshot) I'd suggest we remove both RSS samples from the view or even remove the view in full since it has other problems (missing icons) and is missing other samples (Movies, Directory) anyway. If not, then at least the Classic RSS sample should be removed and the Alloy RSS sample updated for the other repo URL.. OK, next step: Merge the PR:. Update listing of RSS Reader sample app in Studio to reflect new Alloy version. The has been and its listing on the dashboard needs an update as well. Merge PR for updated image: h1. Current model h1. Updated model. I imported the movies app via the dashboard and while the wizard was importing got the attached error. Error log attached. I can reproduce this every time.. I saw the issue during a TeamViewer session with a Titan but cannot reproduce it on my own machine. Let's close it as Cannot Reproduce and reopen when we see it again.. During a TeamViewer session with a customer we used the 64-bit installer for Mac while Appcelerator Studio was already installed. It replaced with no warning. The Studio had the dark theme enabled and so did the new Studio, but the selected tabs will be white on white instead of black on grey. I could reproduce the issue on my own machine. Not after the initial install of the Studio, but it did happen after letting Studio update itself.. When using \"Cmd \" to comment out a line, or block, of code in a controller, the following error occurs. I believe this only started after the update I was prompted to install this morning.. Error using \"Cmd \" to comment out a line. LiveView sees (dot)files as languages. ", "contenttype": "application/json", "created": 737358, "id": 74, "language": "en", "user_name": "fokkezb", "email": "fzandbergen@appcelerator.com"}]}