{"contentItems": [{"content": "Many parts of the code call these two methods very frequently: These are performance degradation and would be very helpful to cache these calls for 5 to 10 minutes to save these calls. I worked on a code for this but didn&apos;t apply it- here is the snippet. During the login process there are some repeated SQL calls. These need to be cached for better performance. Here is a list of the login SQL calls recorded by SQL profiler:. Bing: Finally after some research, it is because the \"Template\" folder doesn't exist. Logged it as improvement for now. First of all, add following entry in host file Steps: - Use gethost to log in to this site - click on host menu Edit Page Export Page - Provide enough info and check on \"Content\". Result: Error and exceptions displayed, and actually I couldn't find the exported template file.. Until DNN 8 (Beta 1) the ability to store cookies using Web API was possible, after the RC (Stable) build the API response truncates all \"Set-Cookie\" values from the Header. Example code works until Beta 1 (Build 674). This method needs to be upgraded to detect the special case of FW like currently implemented to detect FWs and MS articles about this here: - -. The new Publisher module is calling to show the creation time for logged in users according to their timezone preferences. This call in turn uses the property of class instance and along its call chain it calls the database everytime it is accessed. This creates a lot of DB calls. While profiling, I've found on a page with 20 published articles it was called 42 times. This is affecting Platform and all other performance under load whenever this property is used. This needs to be cached per user to enhance performance. Ash Prasad already showed this in one of the images he posted under issue CONTENT-4602 which showed it for 1 article. I found this is repeated per each extra article in the list-view page.. I noticed that some code adds cookies with instead of using the setting. This needs to be fixed to comply with the settings. For example, I created a site as and some of the platform cookies were okay, but other cookies were not - see attached. EVOQSOCIAL: Created Cookies path MUST follow 'site path' setting. EVOQSOCIAL: Subscription sub description is not localized. EOQSOCIAL - SI: Relationship Scoring Actions. Setup latest Suite build as FQDN site w remote SQL database Hit the installation page Give host password x 2 Start installation Installation finishes click through to Home page Check file Actual Result: Expected Result: No errors in log file. This is created based on the customer request: In \"\", we can see this: It would be much nicer if the SearchDocument class had an attribute for that avatar instead, like DocumentIcon or something. That would be much cleaner and would allow any custom search module to set an image.. After discussing with Natasha, this test case was intended for search in the OS file system and it was valid before moving the search to Lucene. At the moment, this in not valid anymore and I suggest it be deleted or replaced with something more relevant to Lucene search. BTW, '?' wildcard in Lucene is used for matching zero or one character only.. Redirection to other URL with in throws that is being logged in the log-file which annoys QA testers. This exception can be easily removed by catching this specific exception and resetting it as follows:. In Social, the search query sent to Lucene from the skin or main search page is not optimized and contains many duplicates. Here it a query sample - each is duplicate 20 times since there are 20 items in the advanced filter (attached image): This should be:. ", "contenttype": "application/json", "created": 737358, "id": 16, "language": "en", "user_name": "george.alatrash", "email": "-"}]}