{"contentItems": [{"content": "I've posted patches which authorize and . It's not yet decided if we will authorize the other endpoints at this time. Reviews here:. There are a couple issues related to the field in and (see linked JIRAs) that should be better documented. We need to help users understand the purpose of these fields and how they interact with the principal provided in the HTTP authentication header. See linked tickets for background.. Remove default value for the agent `work dir`. Following a crash report from the user we need to be more explicit about the dangers of using as agent . In addition, we can remove the default value for the flag, forcing users to explicitly set the work directory for the agent.. Enforce that DiskInfo principal is equal to principal. Currently, we require that be equal to the principal provided for which means that when HTTP authentication is disabled this field cannot be set. Based on comments in the original intention was to enforce this same constraint for , but it seems that we don't enforce it. This should be changed to make the two fields equivalent.. Enable actors to pass an authentication realm to libprocess. To prepare for MESOS-4902, the Mesos master and agent need a way to pass the desired authentication realm to libprocess. Since some endpoints (like ) get installed in libprocess, the master agent should be able to specify during initialization what authentication realm the endpoints will be authenticated under.. Add authentication to remaining agent endpoints. In addition to the endpoints addressed by MESOS-4850 and MESOS-5152, the following endpoints would also benefit from HTTP both* the master and agent in tests. However, this wouldn't allow us to test scenarios where HTTP authentication is enabled on one but disabled on the other.. Add authentication to agent endpoints state and flags. The and endpoints are installed in , and thus are to make authenticated. Other agent endpoints require a bit more consideration, and are tracked in MESOS-4902. For more information on agent endpoints, see or search for `route(` in the source code:. Add agent flags for HTTP authentication. Flags should be added to the agent to: 1. Enable HTTP authentication () 2. Specify credentials () 3. Specify HTTP authenticators (). When frameworks reserve resources, the validation of the operation ensures that the of the reservation matches the of the framework. For the case of the operator endpoint, however, the operator has no role to validate, so this check isn't performed. This means that if an ACL exists which authorizes a framework's principal to reserve resources, that same principal can be used to reserve resources for any role through the operator endpoint. We should restrict reservations made through the operator endpoint to specified roles. A few possibilities: A second ACL could be added for authorization of operations, with an of * Our conception of the object in the ACL could be expanded to include role information,. ` reserve` and endpoints allow operations for any role. Design doc for scheduler HTTP Stream IDs. This ticket is for the design of HTTP stream IDs, for use with HTTP schedulers. These IDs allow Mesos to distinguish between different instances of HTTP framework schedulers.. This ticket is the first in a series that adds authorization support for persistent volume creation and destruction. Persistent volumes should be authorized with the of the reserving entity (framework or master). The idea is to introduce and into the ACL. ACLs for volume creation and destruction must be added to , and the appropriate function overloads must be added to the Authorizer.. and fail on CentOS It seems that mounted cgroups are not properly cleaned up after previous tests, so multiple hierarchies are detected and thus an error is produced:. After using the current installation instructions in the getting started documentation, will not run on CentOS because the version of elfutils included in devtoolset-2 is not compatible with the version of installed by . Installing and using devtoolset-3, however ( fixes this issue. This could be resolved by updating the getting started documentation to recommend installing devtoolset-3.. Install instructions for CentOS lead to errors running `perf`. Pass agent work dir to isolator modules. Some isolator modules can benefit from access to the agent's . For example, the DVD isolator ( is currently forced to mount external volumes in a hard-coded directory. Making the accessible to the isolator via would allow the isolator to mount volumes within the agent's . This can be accomplished by simply adding an overloaded signature for which includes the as a parameter.. Add authorization for and HTTP endpoints. This is the fourth in a series of tickets that adds authorization support for persistent volumes. We need to add ACL authorization for the and HTTP endpoints. In other complementary work, authorization for frameworks performing and operations is being added by MESOS-3065. This will consist of adding authorization calls into the HTTP endpoint code in , as well as tests for both failed & successful calls to and with authorization. We also must ensure that the field of is being populated correctly.. The and config flags are currently not documented in the docs with the rest of the flags. They should be added.. Picojson supports a streaming mode in which a stream containing a series of JSON values can be repeatedly parsed. For this reason, it does not return an error when passed a string containing a valid JSON value followed by non-whitespace trailing characters. However, in addition to the four-argument that we're using, picojson contains a two-argument function ( which accepts a and should probably validate its input to ensure it doesn't contain trailing characters. A pull request has been filed for this change at and if it's merged, we can switch to the two-argument function call. In the meantime, we should provide such input validation ourselves in .. Introduce stream IDs in HTTP Scheduler API. Currently, the HTTP Scheduler API has no concept of Sessions aka or a . This is useful in some failure scenarios. As of now, if a framework fails over and then subscribes again with the same with the option set, the Mesos master would subscribe it. If the previous instance of the tries to send a Call , with the same previous set, it would be still accepted by the master leading to erroneously killing a task. This is possible because we do not have a way currently of distinguishing connections. It used to work in the previous driver implementation due to the master also performing a check to verify if they matched and only then allowing the call. Following the design process, we will implemented \"stream IDs\" for Mesos HTTP schedulers; each ID will be associated with a single subscription connection, and the scheduler must include it as a header in all non-subscribe calls sent to the master.. When the utor's environment is specified explicitly via , will not be passed, leading to errors in some cases - for example, when no DNS is available.. LIBPROCESS IP not passed when utor's environment is specified. If libevent is installed via , running will fail to discover the libevent headers:. Logs from the Mesosphere CI on CentOS 6, with libevent and SSL enabled. Add framework authorization for persistent volume. This is the third in a series of tickets that adds authorization support to persistent volumes. When a framework creates a persistent volume, \"create\" ACLs are checked to see if the framework or the operator is authorized to create persistent volumes. If not authorized, the create operation is rejected. When a framework destroys a persistent volume, \"destroy\" ACLs are checked to see if the framework or the operator is authorized to destroy the persistent volume created by a framework or operator If not authorized, the destroy operation is rejected. A separate ticket will use the structures created here to enable authorization of the \" create\" and \" destroy\" HTTP endpoints:. Add 'principal' field to. libprocess uses a set of environment variables to modify its behaviour; however, these variables are not documented anywhere, nor it is defined where the documentation should be. What would be needed is a decision whether the environment variables should be documented (a new doc file or reusing an existing one), and then add the documentation there. After searching in the code, these are the variables which need to be documented:. Add operator endpoints to create destroy persistent volumes.. Persistent volumes will not be released automatically. So we probably need an endpoint for operators to forcefully release persistent volumes. We probably need to add principal to Persistence struct and use ACLs to control who can release what. Additionally, it would be useful to have an endpoint for operators to create persistent volumes.. Test script for verifying compatibility between Mesos components. In my environment mesos build from master results in broken python api module : Unmangled version of symbol looks like this: During step finds development files and starts using them, thus adding dependency on . This breaks Python extensions module and perhaps can break other mesos subsystems when moved to hosts without installed. This task is done when the test will pass on a system with gflags installed.. ", "contenttype": "application/json", "created": 737603, "id": 49, "language": "en", "user_name": "greggomann", "email": "greg@mesosphere.io"}]}