{"contentItems": [{"content": "Steps to reproduce 1. Create a Picker with 2 columns 2. PickerRow title set to \"0\" in XML (or \"1\", \"2\", etc) 3. App crashes immediately Setting the PickerRow title to \"0\" in the controller js works fine. Android either method works fine.. iOS: Non-string PickerRow titles (integer,bool, causing crash. Hyperloop: iOS: Delegate issue crashes app. iOS: Autolayout does not work with latest master Build fails. iOS: App rejected by Apple due to use of the nativeObject API. Which exact version did you use when submitting?. My app got rejected by Apple due to use of the nativeObject API. I've researched it a bit and the contains \"nativeObject\" on line 168. I think this is the problem because uploading an app build with SDK didn't give me any problems and the class doesn't contain The issue affects iOS versions starting at because Apple disallow's private API usage in iOS. The first message will not be displayed every time the app is launched. Its inconsistent and will be displayed sometimes when the app is cleaned and launched but very rarely. If is called after being compiled, everything is logged as expected.. Hyperloop: Local-embedded frameworks containing sub-frameworks not recognized correctly. Local-embedded frameworks in the src folder containing sub-frameworks are not recognized like and files. W should find a way to recognize the following file types and compile them accordingly: - Objective-C headers - Objective-C sources - Swift sources - Image assets - Bundles - Frameworks - Static libraries Project to reproduce:. Removing from review for now. iOS: Support \"keypressed\" event. iOS: Change documentation on. Github recently published a new feature to create issue- and PR-templates for community contributions. In our case, we would be able to inform the user about the coding guidelines for extending the SDK, the CLA link, the necessary docs etc. For issues, we could mention to create a JIRA ticket first, attach build logs and provide the environment. The required files ( and ) are placed inside a .github directory. More information:. To support Hyperloop modules, developers need to access common Ti-utilities like we already do with . Common used classes: - TiUtils - WebColor - WebFont Problem to discuss is also: What do we do for existing modules that want to be migrated to Hyperloop? They often rely on existing proxies (although not recommended).. Hyperloop: Expose builtin utilities. Using the new property introduced by TIMOB-18515 you get strange behaviour when you play with to not only reposition but also enlarge the icon: The icon resizes when you the tab. And when you repeatedly tap on the icon it will continue to grow. See the attached video. While the behavior is native, we should only allow the and property to calculate the negative and automatically.. Not sure how to proper name this ticket, but it's something with the going wrong. So whenever we want to create a proxy or inside a callback of a (and probably other async callbacks), the proxy cannot be found and it throws the attached error. Example: The example will crash as soon as the callback is invoked. If we call it directly, the app wont crash. Note: The warning is logged before the crash. So it might be related to TIMOB-20397, although the gets initialized correctly with .. iOS: Main-Thread: Cannot create proxies in callbacks. Hyperloop: Couldn't find iOS CocoaPods with \"-\". iOS: Support SearchBar button title. iOS: Resolve Xcode compiler warnings. As part of the major release we should set the minimum Xcode version from to and remove the macros to cleanup the code base.. iOS introduces some new API's of the framework: - - - - - - - - That will simply result in new events to be used to check the session state from the main application.. iOS: not being fired. Android: Updated AttributeProxy to allow fontStyle to be set without having fontWeight to be manually set.. iOS: Support (aka Blur View). We should support the aka Blur View introduced in iOS 8 as a public API (instead of unrecommended solution of stretching a toolbar). Demo architecture:. For the release we should clean up the namespace and move components, that are also available on the iPad, to instead and deprecate the old ones: : - moved to (TIMOB-19522) - to - to - in removed since - to - to - to - to - to - to - to - to - to - to - to : - to - to - in deprecated since replaced with \"fullscreen\" on window - in deprecated since replaced with on window - to : - -. iOS: Support for `selected` event on TabGroup when tab already selected. Android: Add support for style in. The current implementation works. But to make it even more efficient related to memory management, I refactored a few parts: - Remove manual properties of inside the and access them through the property (since the delegate is not public and it keeps the object dependencies clean) - Release some properties that have not been released before - Add missing code docs in the header file - Change counter index from to and remove unused property that have been used during testing - Enable ARC in all related files (!) Demo code (should work exactly like before):. iOS: from webView is not working. iOS: Improve deprecation macros. The new properties for the should be renamed to as that is the name we use on all other API's like .. Adding tintColor property to Android using Pull Request:. A comment with security level 'Developers' was removed.. iOS: Custom fields for phone, address and email returns undefined. Currently we need to disable iOS9 App Transport Security (ATS) in the builtin KitchenSink whenever we want to test any ticket related to webview, httpclient, etc. As we disable ATS in our SDK as well, we should change this setting in the of the Xcode project. The image loads. An ATS error is thrown:. iOS: ListView separator has huge margins on iOS 9. iOS: Sample app crashes on start with SQLite error related to analytics. We used to have a property, that was removed as part of the release in around changes with non-attached images. The say, the property was already removed in but worked until I would like to get this property back to achieve a proper behavior in the following use case. : Use to make an image (blob) of a view, that covers a specified square inside another view. : The method works same on retina and non-retina devices. The method uses the wrong scale on creating the image blob. : Bring back the property, make the default value to as the current behavior expects. That would achieve the configuration of the property, but would not break any existing applications.. iOS9 offers a new return key to show a \"Continue\" button. We should support it and provide a fallback for older devices. Also, we should support the two missing keyboards for twitter and websearch. :. iOS9: Support \"Continue\" return key + new keyboard types. Support PHLivePhoto + PHLivePhotoView. iOS provides a way to receive, display and share live photos using the related classes. A live photo is a photo, that consists of several photos taken together as frames but it still is no video. It can be displayed using the and managed through the or (which we use). Summarized, our proposal should be: b) allow developers to display live photos in a new view proxy or directly in the existing using auto detection on the image source type.. iOS: ImageViews with remote images slow and failing. iOS: TableView header has wrong default height. Apple just presented the new 3D-Touch feature of the iPhone6S. There are new events available, as well as methods to check whether a device supports 3D-Touch capabilities. : - : The force of the touch, where a value of represents the force of an average touch (predetermined by the system, not (read-only) - : The value of this property is sufficiently high to provide a wide dynamic range for values of the force property. - : Shows whether or not 3D-Touch (aka forceTouch) is available. Possible constants: , and : - -. iOS9: 3D-Touch: Support (\"Peek and Pop\"). A comment with security level 'Developers' was removed.. Apple just presented the new 3DTouch feature of the iPhone6S. User can press a view and will review an instant feedback providing a preview of a view to select different actions, called . Each action have a , and property. Multiple actions can also be assigned to . That group can have have a , and property to keep track of the assigned actions. - -. Example code without external code dependencies.. iOS9: Upgrade coremotion module to support bitcode, rewrite code base. iOS9: Providing access to on. Android: Grouped Notification not working. iOS: in ListView disappears on half swipe back. Description A listView which contains a headerView or footerView and a ListSection disappear at the time to swipe window back. to Reproduce 1. Navigate from Page1 to page Page2 2. Swipe from left end of screen to half of screen. And cancel the swipe by moving back to left end of the screen. 3. All the contents of the disappear. Screenshot attached. Code. : - instead of in clicksource: Fixed! - eventListener in : Fixed! - Will be handled in own eventListeners as intended. - , , , click events: In progress! - Not covered, yet, since the right delegates not fire.. UIPickerView and UIDatePicker are now resizable and these views would enforce a default size even if you attempted to resize them. These views also now default to a width of 320 points on all devices, instead of to the device width on iPhone. Interfaces that rely on the old enforcement of the default size will likely look wrong when compiled for iOS 9. Any problems encountered can be resolved by fully constraining or sizing picker views to the desired size instead of relying on implicit behavior. Demo code: On iOS8, nothing should change and the height is ignored. On iOS9, the height should be honored and the picker should resize.. Via the new property behavior, iOS9 now allows keyboard input as an action on the lock screen. Reference: Sample code:. A bit more context: The property works for local notifications, but not for remote notifications. But it also seems, like other properties like , that have been there before, don't show up, too.. The following example crashes when you comment out the line: h2. Crash log. The provide a way to load resources only when requested. The resources are grouped into tags, which is done through Xcode (also need to figure out, how to do this on proxy side). The Idea is, to supply an easy way to access and download resources and release them after there are not needed anymore as part of the app thinning process. The current progress can also be tracked, as well as warnings regarding low memory. On demand resources are only available for iOS9. that means for developers who wants this, they have to set the minimum iOS version as otherwise it won't compile. Just do this in. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. The new iOS8 supports an destructive style, which is specified just like the cancel property. Pull-Request:. iOS: Support missing properties for UITextField inside. h2. Problem When info system button is added to anything other than it appears distorted (see attached screenshot). In the following test case, you may notice that I created two info buttons, one for view, the other for toolbar. The one added to view has ' style : ', which seems not acceptable. But accepting it may itself be a bug. However, it is the only possible way to add info system buttons to view and this feature is quite common everywhere. I'm afraid this distortion may cause Apple rejection. h2. Test case. A comment with security level 'Developers' was removed.. ! Would be a useful feature to have. Already need it for so much. This is something that should be built-in.. Alloy: Multiple Classes throw. When adding multiple classes to an Alloy-Element, the corresponding .tss file throws an \"unused\" warning although it is used. Example:. ", "contenttype": "application/json", "created": 737603, "id": 75, "language": "en", "user_name": "hansknoechel", "email": "hknoechel@appcelerator.com"}]}