{"contentItems": [{"content": "Ensure Job definitions are escaped in UI. Job Executions without Deployed Job (deleted) shall not be restartable. We do set a default value in: We need to document how this property can be used to allow for external services to use the XD Rest API and how you can customize it using. Run all shell integration tests also with enabled security. Fix Gradle dist build task. This should probably be changed to: Documentation:. Discovered Junit test failures that do not provide an assertion message. Therefore the Junit report is rather useless. 2 Classes (Maybe we should check the entire code-base): Class Class. When generating docs, the build tries to access You will observe output like:. Ensure that documentation is pulled and generated. Job deployment list returns 404 after Laptop wakes up. UI: Add support for stoppable notifications. Allowing for stoppable notifications (in case you want to see it for longer than 5 secs). REST: Make the Configurations REST endpoint. I am converting a Spring XD Sample (Batch notifications) from copying jars to (old way) To rather copy the module jar to (new preferred way) By doing so, I hit a classloader issue. Custom classes and resources are loaded in Spring XD using . However, the sample is initializing custom bean definitions and one of those creates a new using the . This class however, under the hood, uses the class loader to load SQL scripts: Therefore, the SQL scripts are NOT FOUND. A possible solution seems to be for to set itself as the context ClassLoader for the current thread:. Currently specified Cron Expressions are uted in the Container's default TimeZone. In we specify: This translates in to Which will call : \"Build a from the pattern provided in the .\" We need to pass-in a timezone. Definition When creating the stream via the UI or the Shell the timezone can be inferred (if not specified) but should be mandatory for the REST API, meaning being passed in as a mandatory parameter (OR alternatively, if not passed in we assume the Cron expression is specified for UTC). That way we could ensure that a (Stream Job) Definition is globally valid.. - Change DateFormat to be ISO 8601 compliant (with TimeZone). Mask Database Passwords in REST Controllers and Admin UI. Improve E2E Test Coverage. Add global Http Interceptor in order to centralize error logging. Using Rabbit as a transport, I get the below error when creating the following stream: In local mode, the stream utes just fine. Of course it works with . Nevertheless, I was not expecting that exception (see below) Issue was also verified by .. This source exists: But trying to access a non-existing source such as: Triggers in the UI: On the server-side: Accessing a non existing resource should probably result in a 404 status code.. UI: The user can view detailed information about steps for a specific job ution based on the type of the job. UI: The user can stop a specific job ution. UI: The user can view progress information about a given step. UI: The user should provide to gain access to the UI. UI: The user can create a new job definition by selecting a job template and providing additional configuration properties. Fix existing Karma unit tests + Migrate E2E tests to Protractor. E2E test warning. Job Plugin - Notification Channel not correctly bound to MessageBus. Create REST API for getting information on all job utions for a given ution id. Add \"spring-xd- \" directory to Git repo. Run JobCommands Tests against all transports. Shell: Add named channel list command. Shell: RestTemplate not posting using UTF-8. Currently, you have to set the default name node every time your start the shell. We should do 2 things: - Provide a default Name node Set Default Hadoop Name Node for Shell: - Should we provide some form of persistence? It kind of sucks that you have to re-specify the name node every time the shell starts up. Existing code:. Shouldn't we have something like a Listener and output some informational messages to the console, so the user knows the Container is up (Which contexts. Maybe even print a link to the docs))? Maybe even some simple ascii art (for demos)? Right now it looks somewhat barren. Redis provides something similar. This may even go hand in hand to provided a better configuration model (storing common config parameters centrally). Presently, Spring XD does not ship Windows binaries for Redis. However, Microsoft is actively working on supporting Redis on Windows. You can download Windows Redis binaries from:. ", "contenttype": "application/json", "created": 737358, "id": 6, "language": "en", "user_name": "hillert", "email": "ghillert@gmail.com"}]}