{"contentItems": [{"content": "Verified as fixed, Followed test steps provided by . Additionally, verified that there were no rogue folders within the 12 zip & the latest master as seen in this (now resolved) issue:. h5. Description: Whilst working on an automated test for properties, an issue was found when attempting to retrieve the properties using . fields with single string values were returned as intended, however fields with arrays such as do not return the correct value or an error with be thrown using the following code: ) However, a workaround to this issue is to use the method , which correctly returns fields with array values. Confirmed that this is a regression. h5. Steps to reproduce: 1. Create a new Classic project. 2. use demo code: 3. Build to device. 4. launch app and click \"New Nathan\" followed by \"Compare Nathan\" 5. In the console, \"Ncook\" should return the appropriate email value, \"person\" will not. h5. Result: calling fields with array values using will not return the appropriate values. h5. Expected Result: calling fields with array values using will return the appropriate values.. Created a new project and used the above sample code, and followed the steps as demonstrated in the video. Stream stops on background of app, however when trying to resume the app, the app closes completely and has to be relaunched. Tested with the following components: Tested on: Windows 10 Pro Windows Phone & device (Microsoft Lumia 640 LTE) Appc Studio: Ti SDK: Appc NPM: Appc Core: Node:. h5. Description: This is a from Incremental builds fail to update changes when targeted to iOS devices. However, this only occurs when the project has platform services , and incremental builds reflect changes correctly with platform services disabled. It is worth noting that the incremental build times are considerably shorter than the initial build for both instances ( 4 - 7 seconds ). This issue is verified as affecting both iOS8 & 9 devices, but does not affect simulator builds. h5. Steps to reproduce: 1. Create a classic project with services 2. Build project to device ( iOS8, iOS9 ) 3. Make a change to file 4. Build project to device again. h5. Result: Changes made to will not be reflected in the new build with platform services enabled. h5. Expected Result: Changes made to should be reflected in the new build with platform services enabled.. h5. Description: Creating a new contact with & including the will cause the following error when build to an iOS8 Device Sim: The same code will work successfully when build to an iOS9 Device Sim, and removing the property resolves the issue for iOS8. h5. Steps to reproduce: 1. Create a Classic Project. 2. Include following demo code to 4. Build to iOS8 device sim 5. Receive above error. 6. Remove property. 7. Build to IOS8 device sim. 8. Create Contacts works successfully. h5. Result: Create Contacts will crash and return aforementioned error on iOS8. h5. Expected Result: Create contacts should work successfully on iOS8, or return a warning to exclude the relatedName property when building for iOS8.. Description: After creating a new app, Initial build reflects changes successfully. However on making changes and rebuilding the app, it fails to update those edits. Tested both on Alloy & Classic projects. The issue is not apparent when building to a device, it occurs when building on a simulator. Switching build target from device to sim updates the changes. However a second build to sim fails to do update. Cleaning the project and rebuilding the app allows for a successful build to sim. When creating a project with appc new and doing appc run, changes fail to update on rebuild. However when creating a project with ti create and doing ti build, changes successfully update on rebuild. Steps to reproduce: Create a new mobile app project. Edit content in Save & build to sim. Make additional edit to Save & rebuild to sim. Result: changes to files made on step 4 will not be reflected on step 5. Expected Result: changes to files should be updated upon second build.. Am able to resize the UIPickerView & UIDatePicker on an iOS9 device, however receive the following error when installing onto an iOS8 device and attempting to launch the application: iOS8 device: iPhone 6 Plus (Model: A1522) iOS9 device: iPhone 6 Plus (Model: A1522) OSX El Capitan Studio: Ti SDK: Appc NPM: Appc CLI:. I have found since reporting this issue that the error is inconsistent. On rare occasions the org can be identified, however for the most part I am still seeing the error. (See Screenshot). This was tested again with the latest components: Tested on: Mac OSX El Capitan (15D21) Ti SDK: Appc Studio: Appc NPM: App CLI: Xcode Node production preproduction. When importing the sample Apple WatchOS2 app project and running, the following error will occur if the provisioning profile is changed after importing creating: 1. Import Apple WatchOS2 Sample App. 2. Change the Provisioning profile for the Apple Watch & Device in the found under \"Configure Provisioning Profiles\" 3. Run the project.. ", "contenttype": "application/json", "created": 737603, "id": 83, "language": "en", "user_name": "htbryant", "email": "htbryant@appcelerator.com"}]}