{"contentItems": [{"content": "Aptana Studio crash with exit code 13. Editor: Horizontal scroll bar flickers constantly. Can't access connections row from Project Explorer. Dialog reports call to nonexistent class in Eclipse (Luna). Update PyDev to version. Titanium Studio: Add check for pre-existing files to Ruby and Rails project wizards. When creating a new project, not all project creation wizards detect pre-existing files. New Project Wizards that correctly detect and warn of pre-existing files: Web, PHP, Mobile, Module New Project Wizards that fail to detect and warn of pre-existing files: Rails, Ruby Steps to Reproduce: 1. Create a new Titanium mobile project or any project MyProject). 2. but not disk. 3. Open New Project Wizard for any given project type Web Project, PHP Project, Titanium Mobile Project). 4. Name the new project the same as the pre-existing project MyProject). Expected Result: A warning should be generated notifying the user of pre-existing files.. Task tag clipboard icons are not refreshed after Task preferences are changed. Removal of a Task tag from the preferences window does not apply to currently open editors, clicking the apply button has no result as well. Steps to reproduce: 1. Load a code file that is syntactically sound and has a TASK task on a single line comment. (for instance: 2. Remove the TODO keyword. Expected Results: The TODO icon (clipboard) disappears from the line when the keyword is removed. Actual Results: The TODO icon is not removed until the file is reloaded. Suggested solution: Force reconcile on all our open editors. Failed to parse large JavaScript file, resulting in 100% CPU usage. JSON reformat document command changes empty file. The script stuyle tag type attribute incorrect auto completion. Suggest \"texxt\" instead of \"text\" To reproduce: Type list You will end up with. Somewhere between and validation now is overly strict about the \"events\" phrases used in the following code:. JavaScript comment moved to next line during formatting. h3. Steps to Reproduce Create JavaScript file with single line: Format it h3. Actual Result h3. Expected Result Comment at the end of line should not be moved to the next line.. Got into deadlock when making performance improvements on the partitioning the faster partitioner made this race-condition appear). The problem is that we have paths that lock onto the editor and document in different orders. See stack below:. Relates to APSTUD-3354. Error is described there in detail. Found same behavior in files with mixed html, javascript code. Occurs in Editors for HTML and Javascript.. h3. Steps to Reproduce create connections, shut down the program, restart and connections are gone. h3. Actual Result no connection info h3. Expected Result expect to not have to recreate connection info for all sites everytime the program is started. When launching Studio on a fresh Linux install, the Dashboard fails to load and Studio prompts to close. Screenshots attached. Log attached. This is not a regression. Steps to Reproduce: 1. Clean install Ubuntu. 2. Install JDK using the linux install manager. 3. Install Titanium Studio. 4. Launch Titanium Studio. Actual Result: Dashboard fails to load, error pop-up, second error prompting user to close Studio. Expected Result: No errors, dashboard should load.. Linux: Direct users to workaround if dashboard fails to load on fresh install. Lion: High CPU Usage. Show char limit in the git commit message field. It would be nice if aptana would show me when a line in the commit message field is longer than 50 chars so i know when I have to do an linebreak. Because normaly git commit messages should be never have longer lines than 50 chars. From here ( the suggestion is 50 chars is a good length. We could show a grey line in the text field, much like is done in the regular editor. We should also have a command-line option to change the value.. Remote View: Refresh required to see FTP connections after startup. XHTML: Invalid ' isn't allowed after elements' warning. Inside Aptana Studio, check out and import Ruble project Open and note the invalid warning in the gutter on the node This is valid syntax for XHTML.. XHTML: Invalid warning on \"html proprietary attribute. h3. Steps to Reproduce Create a new workspace Navigate to YAML settings Change to 4 spaces Click \"Apply\", then \"Ok\" Close Preferences, then reopen Note YAML value is back at 2 h3. Actual Result Indentation is only 2 h3. Expected Result Indentation should be 4. Create Jenkins build. This makes the latest version of Rubles available to all Studio users. This runs two git commands as part of the build script: .ruble projects from the master to the stable branch * Push the results back to Github. Git tag Aptana Studio builds on push to stable. Related to APSTUD-7238. As part of that build, (before the push): See if that git tag has not already been created. If not, create a new tag of the form (note the additional \"v\" at the front) studio3 studio3-php Pydev swt-webkit .ruble. Found in the log file (attached):. Cache for improved editor colorization performance. JavaScript: Formatter adds space at 'for' loops. Summary log from chat recorded on poker session Story Time 20120731: Ingo Muschenetz: dunno why I can't connect again. Trying. Function outline not linking line numbers properly. h3. Steps to Reproduce Open Aptana 3 Submit bug report Click returned link h3. Actual Result Safari opens h3. Expected Result Default browser (Chrome in this case) opens. PHP: Error formatting classes with numeric index. Formatting the following PHP code gives the error \"Unable to format. See error log for to comment out or remove the \"if\", the problem disappears.. At the moment, we only have DOM reference docs for HTML in the Studio's internal help pages. We need proper HTML help docs that provides better explanations and samples. Tasks: See See (currently commented out). Port the interactive console in PyDev to Javascript. Created branch in PyDev: to handle that. Notes: Rhino eval loop: Javascript XML-RPC library: Must check how to get in that environment Add documentation on how to use the console. At the moment, we only have a few DOM reference elements for CSS in the Studio's internal help pages. We need CSS help docs that provides better explanations and samples. Tasks: See See (currently commented out). If you add an PHP interpreter and add the default file you get the error message that Aptana can't save the file This is true because if you install php via the the repositories the normal Aptana user never has write access to that file. This save check should be optional.. h3. Steps to Reproduce When this textarea (Steps to Reproduce) gets filled too far (vertically or horizontally), there are no scrollbars to let the user know he can scroll the text. h3. Actual Result No scrollbars h3. Expected Result Scrollbars. Assertion Failed in. Aptana crashed when coding (some PDO function) and cannot open the file anymore with the following error:. PHPDoc block is not applied to the vars in the function itself. Aptana is not showing the documentation for the vars which are the parameters to the function. Please see the screenshot for a better description.. Autocomplete in html tag attributes eats up following attributes. h3. Steps to Reproduce 1. In a HTML document insert \"\" 2. Now place the cursor right before \"preload\" and start typing \"autoplay \" 3. When Aptana suggests the two values \"true\" and \"false\" select one and hit TAB or ENTER h3. Actual Result h3. Expected Result. h3. Steps to Reproduce Try to right click on publish function or click on publish button but this no work h3. Actual Result The publish button no work in aptana plug in for eclipse h3. Expected Result publish button upload, download and deployment settings. Publish button greyed out in Eclipse plugin version on Eclipse. SWTException: Widget is disposed in. Sorting files in the \"Files Transfer View\" doesn't work. h3. Steps to Reproduce In \"remote\" right click \"transfer files\". In the file listing that shows up, click \"last modified\" or \"size\". You would expect a sorting of file list by size or date. But this doesn't happen. Would be very nice if it works to show last edited files on top. h3. Actual Result none h3. Expected Result sort filelist by date (or size). The problem appears when working with javascript files (I'm manipulating a small library) and prototype is used to declare new function in some object. If I change the function's name, in Outline box each prototype function is represented 2 times instead of one. And each time a name is manipulated this happends again, so the number of functions continues to grow.. No content assist documentation for Zend Framework. Each time a build workspace operation is launched Aptana chokes on certain files which appear to be javascript files. Killing Aptana, deleting the suspected files and restarting Aptana seems to solve the problem. I t re-appears as soon as the files are put back into the project. There is a large selection of the following errors in the log file:. \"Building Workspace\" very slow, many errors in log file. Try this code and notice the incorrect colorization. Please see capture at Studio reports an error loading bundle upon opening. Steps to Replicate : 1) Open Titanium Studio Actual Results : Studio opens an error window and write this to log : !SESSION Microsystems Inc. BootLoader constants: OS win32, ARCH x86, WS win32, NL en US Command-line arguments: -os win32 -ws win32 -arch x86 !ENTRY 4 2 !MESSAGE An internal error occurred during: \"Loading bundle: and !STACK 0 assertion failed: Bundle not serialized correctly to file and at Expected Results : There should be no error in this scenario. It should instead be logged to a file.. Hi, The PHP source format is adding a new line after the operator. Ex: After Source Format: Regards.. Support ANSI colors in terminal output. Symptom: Ruby :Color Code is not working in Console Output h3. Steps to Reproduce Type This code and Show Output Code Starts from Here def colorize(text, color code) \" e 0m\" end def red(text); colorize(text, 'e 31m'); end def green(text); colorize(text, \"e 32m\"); end puts 'Importing categories ' + green('DONE') + ' ' puts 'Importing tags ' + red('FAILED') + ' ' Code Ends Here h3. Actual Result not Colorized Output h3. Expected Result Display some color as per no.. Found in a customer's log file. Unfortunately no reproduction case ATM. Suggested solution: out the root cause and fix it. When the terminal screen is filled up after typing commands and the output goes passed the bottom, the text jumbles up so typing in the terminal no longer works. I attached on screenshot of what happens but it does other things in that it won't work when the content goes passed the bottom. Possibly an issue with buffer flushing.. Ruby: Problem formatting Ruby source code where block contains only comments. HTML validation filters don't work. I am using custom HTML tag - lets call it . I added rules in: Options - Aptana Studio - Validation - HTML - HTML Tidy Validator (I tried all validators on the list) To test: add new validation filter to the HTML Tidy validator * See \"specialtag is not recognized\" in the problems view The editor still shows warning message and underscores the content of the .. Major lag in editing large files with word wrap enabled. h3. Steps to Reproduce Open a css file with 1000 lines Enable word wrap Scroll to bottom of page Start typing h3. Actual Result Keyboard lag (or whatever is going on) is so significant that unexpected results happen. h3. Expected Result Normal opperation with no lag. Not sure what happened, but it seems since the last update, if I have a file that is more than a few hundred lines of code, I get significant lag happening. This doesn't happen until you start to scroll down the page.. h3. Steps to Reproduce We just upgraded to Studio and now we get a ton of JSLint errors in our code. (Seems to be because of changes to default settings?) We could put the settings into jslint comments to make it work how we want it to, but that would require adding the settings to the 300+ JavaScript files that we have on our site. That is unacceptable. We need a place to be able to specify JSLint's settings on a global level. We use JSLint on \"reconcile\" mode, and seeing all of the errors (for things like supposedly \"messy\" whitespace, using multiple 'var' statements, etc) makes the tool downright useless for the actual errors that we need it to catch. h3. Actual Result (See above) h3. Suggested solution Remove the filter box from the validator main page and have the pencil icon open up a new window (similar to how formatting works). See screenshots. For JSLint (and all validators), we would keep a filter text box, as well as have another text box where a user can specify whatever JSLint commands they'd like to issue I'm assuming this would be in the form of a string of options that would then be injected into the comments of a file before parsing.. After I updated my aptana studio (yesterday) and I restart it. The workspace and index building takes longer then 1 houre! Before it takes max. I've many projects in my workspace but after update it is not possible to work because after saving a file the workspace will be build I can stop it, but the next time it starts again. Thats a never ending story. The same I tried with singe typo3 project. It was also not possible to build the workspace in a comftable time. I'm not sure what happens but the performance is now really I also set the java-heap space to 1024m.. Building workspace and indices takes far longer than expected with JSLint enabled. HTML validator should not flag no-value boolean attributes in HTML 4. Add ability to toggle HTML Tidy rules on and off. Add editor preference to configure column cutoff for code coloring. Slow text entry with large PHP files. The following are Lexing Parsing Warnings generated by JSLint. Option JSHint Option Expected ' ' and instead saw ' '. ? see this as relating to braces around for while loops (line 3003, approx), and eqeq (line 2744) and semicolons (2391) eqeq es5 Expected ' ' to match ' ' from line and instead saw ' '. ? Expected an identifier in an assignment and instead saw a function invocation. ? Missing property name. Looks for missing property when defining ES5 getters. missing a Missing ' '. ? newcap newcap Missing ' ' after ' '. ? Expected to see a statement and instead saw a block. Looks for braces in statement context to start a line). unclosed Unclosed string. Checks for unclosed strings Unclosed comment. Checks for unclosed comments. Unclosed regular expression. checks for unclosed regexps. Unexpected comment. Looks for comments in JSLint directive sections, html. If not, write a unit test to cover the case(s) encapsulated by this rule.. Auto-normalize newlines in Find Bar. GIT: Existing branches are not always shown. If there are too many branches, the Aptana GIT Implementation will not show them. Only the current branch is shown in the list, but all others are not. See attached screenshot.. Summary log from chat recorded on poker session Story Time 20120515: Ingo Muschenetz: restarting hangout. High CPU while working on a HTML + PHP file. Associating a file with an external editor only works until Aptana Studio is restarted. After closing a project and opening it up again later, GIT marks seemingly random files as being changed and then wants to commit them. I am 100% positive I did not change these files. It happens on multiple projects. In the example I show a screenshot of files in a Typo3 project, though this happens on other (non-typo3) projects as well. I never had this issue with other eclipse GIT plugins on comparable code. Included is a screenshot of the commit window, which seems to detect no difference in file content.. Aptana studio failed to comment a selected block of text, while editing a javascript source file. The error produced a stack trace on the console:. When shutting down Studio (on Windows), I noticed that it appears that the Aptana Studio process kept running and needed to be terminated manually.. JavaScript: Outline view does not descend into conditionals. Aptana Studio 3, build: The outline view doesn't display functions defined inside conditionals:. Publishing project also uploads ignored resources. Publishing a project also uploads ignores resources h3. Steps to reproduce: add new php project add .gitignore file in root of project rightclick on project publish run web deployment wizard finish web deployment wizard for an FTP server open preferences aptana studio publishing add and to ignore list press apply press ok right-click on project publish upload And both .project and .gitignore files are uploaded to server. I have also tried closing project and closing aptana after updating preferences.. Improve handling of \"Failed to parse\" for Validation. Found in a log file. It appears to happen when a file is edited outside Eclipse, \"refreshing workspace\" is turned off, and we attempt to build Suggested approach: Catch the specific exception Call refresh of the resource Try again If it still fails, alert the user (similar to how search fails) Write out this message as an to the log. From ( It appears there are at least two syntaxes we don't currently support, but should: Both return \"unexpected token (or ' '). Add \"Opened Editors\" scope. When validating the user's credentials for the JIRA login, clicking Validate behaves a little odd: the Validate button stays blue, and then a couple seconds later we get a beach ball. Also, the error message when it fails is a little obtuse since it shows the exception name - we can probably handle the specific case of bad credentials with a custom message? * Once we've validated the user's information, we should remove the field. I have setup an autosync with sftp for deployment and it works. If I delete the file, it does not get deleted on the server.. Autosync does not sync deleted files. Based on the findings for APSTUD-4690, we implement the rules in a new validator.. Building workspace hangs forever on file save. Since the last update to js files that are opened - and are not part of a Titanium project - do not get validated by jsLint. If you open a js file that is in a project and make an error, the error appears straight away. The same is not true for files outside projects, they don't get validated at all. h3. To Test Create a new JS file on your desktop. Ensure that JSLint validation is on in preferences Add the following content: Drag the file from the desktop into the editor area of Studio to open it (or open it via the File menu or Local Filesystem node) In you will be warned about the duplicate assignment of a. In the validation doesn't happen.. fails to cache remote file if parts of local cache directory are already present. Allow setting the permissions for both the upload and download of FTP files. File permissions are not preserved on file-download from No default permissions can be defined during ftp-download. (The FTP settings under \"preferences\" \"Aptana Studio\" \"publishing\" \"ftp\" only work for the upload process and publishing. See attached file. Same as \"advanced settings\" while syncing. There should also be In order to improve the process, suggest adopting a similar UI to Cyberduck (see attached image). Preserve permissions Download section Choose specific settings for files and folders. When we deploy a new Aptana (or Titanium) release, we deploy it to a new location each time on Amazon S3, or to the same location (but wiping the old contents) on It appears that the P2 system now requires the old update site to exist in order to be able to revert to the previous version. Suggest that we use the \"mirror\" task to merge in the previous versions (though Chris has suggested their might be a different approach to use as well) So, when deploying we merge in We can keep the repos to merge in on the build server (we do them as tagged builds now) and update those references as part of updating version s. However, maybe there is a better way to automatically figure out where these repos to merge in live. h3. Suggested Fix Upgrade the two deployment scripts (the bash one for Titanium Studio and the Ruby release one for Studio 3) to take a list of versions and merge those into a new repo Upload the new repo to the same location as before Test the combined version by installing Version A, upgrading to version B, and being able to revert to version A (assuming A & B are both versions on the update site). Aptana forces the path of the Document root on server to start with a \" \" (slash). In the git history view the linebreak in the commit messages is not That means that long commit messages are very hard to read. Please see the picture i added for you. You see the same log in the Terminal and in Aptana. The list view should only display the first line of the message (the \"Subject\") The details view should display the messages with proper line breaks.. This ticket involves the investigation of the complexity in replacing JSHint with our own validation framework What rules do we need to encapsulate Will the current approach (Xpath + custom AST walking) allow for the validation of all these cases For ease in migration for existing users, it is suggested we accept the current comment-based options that JSHint allows.. Investigate creating validator. This ticket involves the investigation of the complexity in replacing JSLint with our own validation framework What rules do we need to encapsulate For ease in migration for existing users, it us suggested we accept the current comment-based options that JSLint allows.. After installing standalone Aptana Studio plugin is not initialized after putting it into folder. To make clear, for Aptana Studio standalone it was possible to place and folder of some plugin into the folder and after that plugin loads automatically at studio startup. That is documented at and . h3. To reproduce Download plugin. It is small and handy plugin and always worked with all Aptana versions. Under Aptana Studio placing its files under do not make it load. Error log is empty, and Aptana starts as usual, without Regex Util plugin. The same thing (placing plugin files under folder) with Eclipse (indigo) is ok. Plugin is loaded normally as usual. Attached file is log info from Help - About Aptana Studio 3 - Installation Details - Configuration tab.. h3. Steps to reproduce Copy-paste from on the file Error occurs h3. Error Details Date: Thu Dec 08 CET 2011 Message: Error while formatting the code in your submit a bug report through Studio's support and include the relevant code which triggered this error. Severity: Error Product: Aptana Studio 3 Plugin: Session Data: Inc. BootLoader constants: OS macosx, ARCH x86, WS cocoa, NL en US Framework arguments: -keyring -showlocation Command-line arguments: -os macosx -ws cocoa -arch x86 -keyring -consoleLog -showlocation. I am using the latest version of Aptana as a plugin in Zend Studio When using Microsoft Filters (in this example, opacity), the line is marked as invalid syntax:. Add support for Microsoft filters syntax to CSS. See attached example. Unable to cloak folders. Why, after new updates, I am unable to cloak folders anymore? To reproduce: Set up a FTP connection with a project using the instruction here: Right-click on a folder in the project and select \"Publish Cloak this file type\". Expected result: the folder will show a cloaking decorator. Actual result: no decorator is added to the folder icon.. Use JFlex scanners for JavaScript partitioning. Use JFlex scanner for JavaScript colorization. Autocomplete (html editor) breaks multiline edit block selection mode. JavaScript: Outline view does not descend into functions. Add AST \"Live view\" to HTML editor to show the AST of a selected area of the document. When writing new rules that apply to the AST of a HTML document, it will be invaluable to get a preview of the AST of a specified area. Ideally, the live view allows users to click or select some piece of code and see the AST (or it could just be the AST of the whole document as an outline). Additionally, the user could type in a rule in the form expected by the validation engine, and see the resultant matching nodes in the tree or the document.. FTP: Changing file permissions in properties window does not change the permissions on the server. When browsing on a remote ftp server, changing file permissions in the file properties window does not ute a chmod command in the ftp console and does not make changes on the server. To test: Connect to a local or remote FTP server (I used the built-in server on OS X) Expand the site in the Remote view Right-click on a file. Change the permissions to something different. Save the properties. Note that the file permissions do not change on the server. Note that this does work with the SFTP protocol.. PHP: Assertion Failed error due to a syntax error. PHP editor crashed due to a syntax error. I was not able to reopen the file until I manually removed the following (invalid) line: Here is the log returned upon crash:. HTML Tidy: Error: String index out of range: 0. \"Short Tag\" snippet from XML autocompletes in HTML document, causing annoying content assist experience. Type: Aptana will add the closing for you Press enter (thinking your will get a new line), and a name tag is inserted. Actual result: Expected result: You can work around the issue by one of two ways: Hit \"esc\" before \"enter\" Edit the XML bundle and remove the \"short tag\" definition The XML definition should not apply in HTML, as that snippet seems It does not apply in HTML in TextMate.. User-defined functions not showing source file in content assist popup. Aptana startscreen fails with error cannot open shared object file\". Rubles don't appear to load correctly when Aptana Studio is in a directory with foreign characters. When i type in css file \" earlier i got next result: I use Aptana Studio 3, build: and after typing .class and left bracket, right bracket isn't complete and new line not created. Suggested fix: Attempt to replicate If it's an issue with our code, apply fix If it's a jRuby issue, link ticket to upstream item and place this ticket on hold.. We use a lock on the entire repo. We should have a separate lock for the config file, since most of the \"writes\" won't affect it.. Cannot format jQuery. See comments for code. The quick outline requires wildcards to search for items, whereas the outline filter does not. Please see the screenshot for an example.. Quick outline filter requires use of wildcards when searching. If a user edits the filters on a participant or modifies enablement, we need to force a clean rebuild of projects for the changes to take effect. Like JDT, we should warn the user of needing to rebuild all projects (and offer to cancel). Also, we don't need to do this if only changing reconcile options.. Set the built-in web server to use the computer's IP address Applying and restarting Aptana. Reboot your mac and open Aptana again Go run a html file as a JavaScript web application. The web server is bound to instead of the computer's IP address. Going in to change it to the computer's IP address shows that it is still set. Changing it back to clicking apply and then changing it back to the computer's IP address, applying and restarting Aptana resolves the issue temporarily.. There are an extra two blank lines in the text hover documentation. Open a new JS file Type \"var x new Array();\" Place the cursor before \"var\" and type \" **\" + Enter You will get an extra line:. Unable to create project in location with pre-existing files. If you create a new project (in my case PHP) and you point to a location which already contains files, Aptana won't allow you to create the project. You see a warning, but there is no way to skip this warning and create the project regardless.. Steps as listed here: File New File will create a new file. This will not respond to \"Undo\" (see Eclipse bug where they fixed that) To replicate: Eclipse (JDT): Navigator, but not Package Explorer or Project Explorer Titanium Studio (dev): App Explorer and Project Explorer Titanium Studio App Explorer and Project Explorer Open a file in the Editor. undo history.. Given a project with a very large html file (attached), I wanted to create new file (php). Doing so blocked Studio for 15 minutes while indexing was in progress and no way to cancel it unless I killed the application. The indexed file is not even on the same project. Indexing should not interrupt file creation.. Add Ruby documentation hovers for variables, types and methods. Add HTML documentation hovers for elements and attributes. See - description Remarks remarks Example example Specification. Investigate FTP directory failing issue to see if it's still a problem. Pre-select last used connection in connection menu drop down for repeated synchronization. I would prefer remembering of the last connection used for I have some projects deployed to more than one place (connection). When I make some little changes in the project (for example in template), it usualy relates to one specific connection. As soon as I check changes, I synchronize files with that connection. Now, whats wrong. In serie of more changes in a row, everytime I want to synchronize, I need to switch to the right connection prior to the actual because Aptana not remember last used connection. There is checkbox \"Remember my decision\" but it's unusable for my situation. I still need dialogue for selection of connection.. Add option to format object properties on separate lines. When trying to format this bit of JavaScript code, the formatter used to crash: Now, it just collapses all of the properties onto a single line. * Add UI and functionality into the formatter, allowing the properties to be formatted each to one line.. From - description Remarks remarks Example example Specification. Improve text hover for HTML elements. From - description Supported Platforms Remarks remarks Example example Specification. Improve text hover for CSS. From & 64;name: & 64;type - description Supported Platforms Remarks remarks Example example Specification & 64;type - description Supported Platforms: Remarks remarks Example example Specification. Improve text hover for JavaScript. Support usage of CommonJS Modules \"require\" method in JavaScript code completion. Given the following: We present content assist against the functions and properties defined in the module file * This would require changing the index to show what individual files require and filtering that in content assist.. Attached PHP file has the code that fails plus the error code Code:. PHP: Unable to format string with interleaved comments. PHP: Keep end ? on same line as previous. I badly write in English, I will write an example Aptana: Netbeans:. We have a couple classes that handle sniffing document type and then returning info on HTML tags being tags being forbidden. They're in HTMLParseState and We use this in our CA and parsing and would like to use it in Validation as well. Ideally this sort of information seems like it should be in the XMl metadata for HTML, rather than in a supporting utility class or two. New model elements Replace calls from HTMLParseState. Outline appears broken. Broken Linux links on. On the website the x64-linux links are broken for Aptana Studio.. Paste the following into a new HTML file, inside a project: Note there is an error in the gutter around alertMsg , but not in the problems view Save the file. Note, no change in the problems view Right-click on the project, and choose \"Build\" Note the problems view now contains a corresponding error. During the Aptana Studio and Titanium Studio build process, we need to create a set of JavaDocs to make it easier for end users to navigate and understand. This ideally is placed into a \"javadocs\" folder in this area so that they can be uploaded as part of the nightly sync. There should be some set of ANT tasks we can use to generate the docs. We also need to replace the default stylesheet with the JBoss one:. A number of items are written out to the log under the INFO level. However, if you have the slider set to ALL, that can provide an astronomical amount of data, particularly from the scripting plugin, assuming you have not selected particular components to debug. Add Only show \"trace\" items if level is set to and you have chosen to debug the specific component in question. This is in contrast to the current behavior for INFO where it will show all components if no specific one is selected.. We need some way to turn off validators individually, and in particular between build vs reconcile. This stems from the poor performance of the JS validators during large builds. They should default to be on for reconcile (only the ones currently on by default) and off for build (likely the same for the CSS HTML validators). We'll need a preference page similar to the validator pref page we had before (maybe just re-use fix it to work). One suggestion is to reuse the existing pref page and instead have a table at the top with two checkbox columns, one for build and one for reconcile. A less-optimal solution is to have two separate lists, one for each type of interaction. Perhaps we should say \"On Typing\" as opposed to \"Reconcile\"? Perhaps that is more user-friendly? Tasks: Add some methods fields to the participants to mark them as validators Create a migration function to migrate the old pref keys to the new scheme * Some build participants need to be unchangeable or hidden from the end user (like indexing). Studio infers wrong remote path after using both \"Go Into\" and having FTP time out. APSTUD-4069 is solved, however invoking the commands listed in APSTUD-4069 results in Scripting Console errors. Steps to Replicate : 1) Open Aptana Studio 2) Open a CoffeeScript file 3) Select Commands CoffeeScript Insert Heredoc \"\"\" Comment, Commands CoffeeScript Insert Heredoc \"\"\" Quotes or Commands CoffeeScript Insert Heredoc ''' Quotes Actual Results : The Scripting Console will show the message : line 3: column number: command not found line 4: syntax error near unexpected token `(' line 4: `whitespace \" \" Convert 8 commands to inline Ruby, 7 of which are easy and 1 which is complicated. Git not using and from .gitconfig. I noticed that when I do a commit using the gui (specifically the Commit command in the App Explorer gear menu), git isn't using the and from the .gitconfig in my home directory. I'm running the Studio 3 Beta plugin in Galileo on Windows XP, and I'm using msysgit When I do the same commit from the git bash prompt, it works fine. Is there a separate global git config for Studio 3? Is there an easy way to sync this with the .gitconfig in my home directory?. HTML content is indexed in web projects. The information store there should be included in the Index View under a separate top-level HTML node. Content provider and label provider for HTML Query index for content * Some icons. Improve additional information popup for JavaScript. Improve additional information popup for CSS. Improve additional information popup for HTML. Amend the current hover tooltip to add a link the HTML documentation for the specified item (if available). For core HTML, JavaScript and CSS functionality where the documentation is provided by standard metadata files, the URL can be constructed to point to In-Studio help. See Studio 2 for an example of this: For other elements (like Titanium properties) perhaps there is a mechanism by which we can provide a custom resolver to generate the URL. It could also be that this might be provided by an extension point or class property when the contribution happens. See for details.. Add icon to \"Open HTML docs\" for current content assist entry for JS language. JavaScript Core Reference HTML DOM 2 Reference * Titanium Mobile Reference (if applicable) Hover and Dynamic help for functions is identical to properties, except it shows the method signature. See for information on how to contribute dynamic help. See and for the majority of the including both the top content, and the list of resources at the bottom. Suggest we try running any JS code blocks through the formatter.. Create redirects for the most common studio pages * Updating links in our current project. Right now we index the full gems installation, which can take a little bit of time if the user has a lot of gems. It also impacts lookup since they're all stored in the same index. Ideally each gem (and version) would be it's own index and would get associated with ruby projects based on Gemfile (or other files' gem requires). Parse the gem file to find the gem versions and names Content assist only on gems used * Listen to changes to gem file to update index. The diff view is not readable with the default color theme. The black bars on the black background have zero contrast with each other.. PHP: Show functions inside conditionals in Outline view. Currently it is not possible to view functions defined inside a conditional in the outline view. They appear to be ignored. without if () it works:. There is no \"length\" property in jQuery content assist. There is no \"length\" on list, though it exists in the API: There may be similar items that are missing.. Theme export not escaping certain characters, creating an invalid theme file. I exported a theme to a file, reinstall an Aptana Studio, but when I try import it, nothing happened.. JavaScript: Instance method in SDOCML file missing in content assist. Create a new SDOCML file in a web project Paste in the following: Save this file and open a new JavaScript file. Type clearCache is missing from the proposals list. When using code folding in a PHP document if the editor find an error in my code it unfold all folded block of codes (functions, Paste the following into a document: Fold both functions Select \"public\" at the beginning of one of the functions and replace it with the letter \"p\". This will force an error in the document. Both functions unfold.. Syntax errors don't appear in ruler until after save with Build Participation.. The last line in a file is not clickable. Aptana Studio initially opens files significantly slower than Studio. If the end user creates an HTML file with a JavaScript file associated via a Script tag src attribute, changes to the JavaScript file will not be visible until the HTML editor is closed and restarted. Steps to Replicate : 1) Open Aptana Studio 2) Create a JavaScript file with the content : 3) Create an HTML file in the same folder with the content : 4) Resolve the JavaScript file in the outline so scriptFun1() is visible 5) In the JavaScript file, rename the function to scriptFun2() and save 6) In the HTML file, try to refresh the Outline via the node or by editing the src attribute value Actual Results : The new function is not visible in the HTML outline until the editor is closed and restarted. Expected Results : src JavaScript file changes should be available after the JavaScript file is saved. Proposed solution: Refresh the outline, preserving the open closed states of both the HTML and JS nodes. JavaScript content assist not automatic from between contiguous braces. HTML Editor Matches Double Quotes In Text Areas, Strings and comments. : the HTML editor auto-matches double-quotes in the text area. Steps to Replicate : 1) Open Aptana Studio 2) Open an HTML file 3) Enter a double-quote between the body tags Actual Results : The editor will auto-match the double-quote. Expected Results : The HTML editor is not supposed to auto-match single or double-quotes in text, strings, or comments. If you have a pair of braces enclosed by quotes and containing a matched pair, deleting the inner and outer characters in a certain sequence will cause a newline between the braces to move the caret one space forward instead of adding a (possibly indented) newline. Steps to Replicate : 1) Open Aptana Studio 2) Open an editor 3) Enter a double quote (or a single quote if the editor matches these), brace and any character the editor will auto-match so you have something like the sequence \"\" 4) Delete the first quote, then the second quote, then the enclosed pair so the caret is at the pipe : 5) Enter newline Actual Results: The caret will move forward as if you entered the right arrow key. Expected Results: The editor should add a (possibly indented) newline between the braces. To Do: We expect to do the following as part of this ticket Decide what the behavior ought to be * Modify the current behavior to be in line (if necessary). XML matching tag highlighting fails. XML outline does not clear upon replacing current content with erroneous content. Move Eclipse base for Studio to and remove support for Eclipse. Find Bar in split-screen editors copies text from wrong editor. Ship PHP, Ruby and Python features separately from Studio. Add \"Connection link to Remote View menu. Ability to control the auto closing of quotes and brackets separately. When I use and in JS editor content between them is still formatted. Testcase: original code when formatted, all items in array are merged into one line. When creating a wizard, we manually composite a foreground image onto a background image, but this is an intensive process. Instead, create a utility class that a supplied top image against a standard background image on demand. Thus, if a person wants to create a new wizard image, they need not manually have to do so. It will center the top image (horizontally and vertically) on the bottom image. Aptana freezes when opening a folder while a file is being created inside it. It's the secound time that my Aptana freezes (and locks the complete OS) when i am opening a folder in the App Explorer while a file is created in the folder I'm try to open. I was able to get my system back via switching to a new shell (STRG + ALT + F1) and killing the Java pid.. PHP: Add hyphened variables to double click selection delimiters. When you double click on something like depending on where you click, Aptana will select text. If you click to foo, Aptana will select \"$foo\", if you click on \"bar\" or \"baz\" Aptana will select only that text, without dash or period. You can see Aptana and Notepad++ comparison in the attachment. Someone suggested it a while ago in We have determined that we should be supporting the addition of the hyphened text -bar, in this example). Remove Firefox installation requirement on Studio startup and instead show prompt on Firefox debug launch. Currently, we prompt the user for an install of Firefox if we can't find it at startup. We should instead do the check and install if they've chosen to debug with Firefox.. ScriptDoc Autocomplete for JavaScript functions. Investigate replacement for HTML Tidy Validator. This item manifested after pasting the set of all HTML tags from the website : Into the HTML editor and arranging them in a valid order (list is included below to speed replication) : Steps to Replicate : 1) Open Aptana Studio 2) Open saved HTML file 3) Paste above list of HTML tags into editor and begin to arrange in valid order. I continue to witness performance issues and Studio Actual Results : When I discovered this Sunday evening, several malfunctions occurred sequentially. First was a NPE, then a Heap error, and finally Studio turned unresponsive until shut down from the task manager and opened with a new workspace without the offending file, which does not contain an excessive number of tags Studio is representing this as an unbalanced tree. Below is the stack trace for the second error : !ENTRY 4 0 !MESSAGE Unhandled event loop exception !STACK 0 Java heap space at Method) at Expected Results : Files this size should not consume excessive resources. It appears this is related to HTML Tidy. We need to investigate what functions HTML Tidy currently still performs (that are not filtered out) so that we can scope how hard it will be to replace it.. Steps to reproduce: Copy into a new Web project Open up the file Turn on \"Mark Occurrences\" Click on the first instance of \"function\" note that the annotations in the side bar come up quite quickly, but profiling, it shows a significant performance hit in At this point the IDE is unusable for quite some time (10-30 seconds) See screenshots for details. I noticed that if I only allowed 100 annotations to be created, performance seemed acceptable (though still kinda slow). Set \"Mark Occurrences\" as \"off\" by default. JavaScript Window Object Content Assist Missing some height, offset and screen properties, and createPopup method. JavaScript Document Object Content Assist missing documentMode,. Exclude files from the deploy tools using paths rather than by file types. Currently there is only an option to cloak file types from the deployment assistent. But very often it's not only file types with sould be excludet. For an example. I have a PHP project remote and local, i have for example local other usernames and passwords for the database connection. So i have to skip on every deployment the or i would kill the live system. Currently there is no way, because cloaking is not realy an option. I think a textfield where i can store the complete path would be very useful. The syntax could be like in an .gitignore file.. Frequent and Random Aptana crashes. i get multiple crashes from Aptana and I notice it regularly occurs when I am switching back to it (eg. apple-tab) from another app like Chrome. It's happened to me several times today. here is the apple problem reporter info after the app crashed: See attached file for full information. Suggestions to investigate: Does it matter if the internal browser is disabled Perhaps this will dissipate with Eclipse (now built on top of Eclipse. Ubuntu: Aptana won't save editor tab sizes. PHP: Context Information fails when there is a string in the parameter list. PHP No code assist on methods. In some context locations, the code assist may pop-up automatically to suggest available options. For example, an available list of functions, variables and constants will appear after typing a PHP arrow string '- '. Call other class methods do not work. there was no code assist when used like this. Assume the following snippet: If you type d+TAB, it inserts: If instead, you menu it will insert: Expected is:. Create sub-folder under temp for our temporary files. If i work with a lot of FTP connections, after some hours my tmp directory is getting very nasty. If you have some other tools that work directly in tmp, you don't find your own files anymore. (see the screenshot) I think it would be a very nice feature if i could determain a custom path for this files. Normaly on Linux you have . You can see other tools like pulse, orbit, ssh, always using their own subdirectory.. If you have methods with long parameter descriptions, sometimes the auto complete popup it very hard to read, as shown in the attached screenshot (the code is from the Zend Framework). The content should wrap according to the width of the popup (it appears to break early here). Content assist content wraps short of popup edge. PDT WST editors are not available in an Aptana PHP project. Set \"Project Natures\" to PHP WEB \"Others\" menu. Show better error messages when invoking a command without the proper Ruby gem Installed. If the end user invokes the command \"Convert HTML to HAML\" without the appropriate Ruby Gem installed, Aptana returns an error via the scripting console. Steps to Replicate : 1) Open Aptana Studio 2) Open a saved HAML file 3) Invoke the command Commands HAML Convert HTML to HAML Actual Results : The editor returns this message to the scripting console : Expected Result : The editor could return a concise error message. Suggested approach is to add a function which can be called before running the ruby command that will check for the existence of the specified gem. If the gem is missing, it will alert the user, ideally with directions on how to install the gem. We would then need to update existing commands where appropriate (approximately 10).. PHP: Add Open Type Method PHP feature. One feature that is sorely missed is Open Type in the Eclipse PHP PDT. Attached is a screenshot of the feature in Eclipse PDT.. Word Wrap shows keybinding conflict when used as plugin in Eclipse for Java EE. It appears some users are upset by the creation of an empty Aptana Rubles folder in on startup. Given that user rubles can now be created directly in-workspace as top-level projects, the current Aptana Rubles location may be antiquated, as users will rarely have to interact with the folder directly. Viewing here: It suggests that a possible better location would be under the Alternately, we could only create the Aptana Rubles folder if a user chooses to actually download and install new Rubles.. Support editing. Support for \"requires\" and imported modules * Auto-attaching of documentation sources (see for an example of possible workflow. We ran into an issue with PATH holding cygwin paths on Windows breaking git clones. I added a method to convert between the two, but we need to make sure we convert anywhere we're not uting inside the Terminal bash.. Aptana 2 has great feature for JavaScript formatting: \"auto format code block when typing closing brace ' '\". This setting accessible in Aptana 2 from: Window - Preferences - Aptana - Editors - JavaScript - Typing - Formatting It would be nice if such feature will be presented in Aptana 3 Attached screenshot of the preferences screen in Aptana 2 and another screenshot showing formatting behavior. h3. Suggested solution Add preference (off by default) for this setting Find relevant nodes in the AST into selection and perform format Add lots of unit tests. Our current unit test coverage hovers around 30% (class, method, block, and line) We need to get this higher. Here are the classes we need to test: Please create a sub-task for the class you want to test, and edit the document to indicate you've claimed that test. If there already is a task created for a particular class, it means someone else has claimed that one, so choose another. If there are a bunch of related classes, you can group that into one task. Coverage goals for all classes below is a minimum of 100% class, 70% method, 80% block, 80% line (default Emma values in Jenkins) URIUtil. The default PMD profile is too strict for our purposes. Create a default PMD profile all developers can use to validate code correctness before checkin. Please create a profile, run it against some of our current source code to see if it reports what is expected, and pass it around to the other developers for confirmation.. The default FindBugs profile is too strict for our current code base. We need to create a more limited profile that we can use to validate all committed code for possible errors. Please create a profile, run it against some of our current source code to see if it reports what is expected, and pass it around to the other developers for confirmation.. intermittently fails in editor. There is a very strange issue that has been happening to me since I started using Aptana Studio at version when I copy (or cut) some text from the editor and paste it somewhere else in the same or different file, Aptana will paste the last thing (or second to last, depending on how you look at it) instead of the most recent thing I just copied. I thought maybe just my keyboard wasn't working, since I had never experienced something like that before. But then my co-worker (who is also using Aptana asked me if I was experiencing copy paste issues too. That's when I knew I wasn't the only one. We noticed that the times when he can't copy paste is when Aptana is using up 100% of the CPU. So, not sure if there is another bug and this is just a side-afect, or if this is a bug that can be isolated. I don't know how to replicate this. All I know is that it is happening at seemingly random times. Update: Some people have reported relief after unbinding the shortcut 'command + c' from 'copy' under Unbinding this shortcut resolved the issue of copy paste randomly not working. It also appears that this is a long-standing Eclipse issue: Which suggests that there is some more investigation to do here.. Mac OS X Lion has a full screen feature for a lot of native apps. It would be great for Aptana to have a feature like this.. Implement a new JavaScript validation framework. We have multiple different validators for JS. They are inefficient, out of date, and nearly Propose creating an infrastructure to replace this with a single way of defining rules. Brief requirements: Should encapsulate these rules ( It should allow for style usage validation for things like Titanium Mobile projects. This kind of validation might only happen in JS files in Titanium Mobile projects It should allow for cross-file validation. Ideally, those rules exist in some form that can be modified and converted into our new format.. This would crib from the previous implementation we had for Aptana Studio some years ago: User needs to set up their JIRA account. There should be a preference area for that When filing a bug, ask them the following: A summary of the issue (mandatory) Steps to reproduce the problem (mandatory) Include log file, current platform configuration and any other log items If possible, properly assign component and scope to the item in question (should be part of the method call instantiating this dialog) Allow them to attach a screenshot The same item would be available from the file menu, though some of these things would not be filled out component, scope). This would use the JIRA API to submit the bug (. \"New From Template\" should list all possible file types, and provide a template option for each. Add XML parse-level validation. Currently, to set PHP up to preview against a local web server, a user needs to follow the directions here which are overly complicated (something like 5+ major steps) Suggest instead the following: Note: This is more similar to NetBeans than PhpStorm. The latter just assumes you have a PHP server already installed. On create new project first screen, ask: Radio Button: () Use local web server () Use remote web server If \"Use local web server,\" allow them to create a new one (unlikely that they could reuse existing) If remote web server, allow them to create a new FTP SFTP connection (perhaps they could reuse existing?), and then specify the remote url for preview On creating the project, automatically do the following: This would mean creating something like project name: myproject, project location Create a new run configuration with the preview server above create the FTP connection as specified above Create a new run configuration with the preview server above Thoughts appreciated.. Expand Collapse icons in Project Explorer drawn with 1px borders. Add F2 support for Content Assist Hover. F2 should pop up the content assist tooltip, or if hovering over content, F2 will provide focus.. Implement improved terminal hyperlink detection. On terminal windows with a long history of output (a couple pages), scrolling up with the mouse wheel will jump back down once it reaches a certain point. However, if you manually drag the scroll bar up, you can see history beyond the jumping point. I've seen this reproducible on Allen's machine when you tail rails logs. You can see similar symptoms in the attached movie. A short investigation showed that the issue relates to the implementation of hyperlink detection in Terminal. Disabling hyperlink detection eliminates the issue. Suggested fix: Re-implement hyperlink detection code to make it free of issues.. Chromium: Update WebKit Browser implementation to the latest source base. From the current system: template \"Custom Template\" do t \" .html\" end By default this WOULD DO environment substitution. Also add a setting to allow turning on off parameter substitution (identical to project templates). Menus aren't visible in Ubuntu Unity window manager. Aptana doesn't show the menu bar in Unity window manager on Ubuntu. When editing HTML, CSS and Javascript files, the non-selected entries in the code completion widget are all white (see attached screenshot). The colors stay the same regardless of the Gnome theme selected. The colors of the tooltip correctly matches the system colors, but code completion is always displayed like this. When opening a file in a non-aptana editor, the code completion widget correctly matches the color of the tooltip. I run Ubuntu and Aptana Studio. No file system is defined for scheme. From the log file:. There's still no multi line Now I know there's the DRY principle that any good coder should utilize. But there's just tons of situations where it's needed. Like where the DRY principle is practically not applicable. Also searching other's code for a specific line is much easier if you can just paste a chunk of code into the search bar. You know - tutorials - that some of us have to do to stay on top. In the meantime, you'll have to use regular expressions (use R for carriage returns). Longer-term, suggest modifying the find bar to allow for a \"multi-line\" option. Proposed spec:. Updating to latest RCP on dev installs JDT plugins. PHP: Error updating PHP error markers. Add ability to to select word via camel case. In my old Aptana2 + PDT the camelCaseWord. In the current version the whole word in selected. Is it possible to change this behaviour somehow (maybe with an option)?. Find dialog cause text selection to \"invert\" colors. This is what happens: I select some text - I open the find replace dialog (I press CTRL+F then click on the magnifier icon in the search bar) At this point the selection is gone (like it is \"inverted\" or something similar), so the option to find replace only in selected line is useless. I'm on the latest build (win7) and never experienced this before. The error log is clean.. Eclipse PDT provides the option to have trailing whitespace automatically removed from files on save from the end of a line where it has no impact). Is it possible you could add this useful feature?. Project Explorer is showing duplicate files and folders. In the attached image, Project you can see the current improper behavior. In attached image, C-C++ you can see the expected behavior. The view is proper in Project Explorer for Web Projects. This is with a new install of Eclipse Helios CDT and Aptana Studio 3 on Arch Linux. This also appears in a few other circumstances (see linked issues).. This is something that was shipped with (skipped out on so don't know if it's there). Don't know if this is planned for (on the product page I've seen that JS debugging is coming soon), yet it would be great if this were to be found into Aptana again (same goes for the ability to run a script through the PHP parser to get the output). I've found the debugger to be one of the main Aptana features I use during my lectures (I'm a lecturer at a technical university), helping the students to understand what's going on on \"the inside\" of a PHP process.. Trying to get started with Aptana Studio Debugger on a standalone install of Aptana Studio (Mac OS X - Intel). Following online help: \"This walkthrough will instruct you how to install the Aptana JavaScript debugger, add a breakpoint to your code, and display the current values of your variables. 1. Import the debugging sample as a project. In the Samples View, expand the Aptana Studio Samples node. But in the Samples View I don't have the specified node, I only have samples related to plugins I have installed. Where do I get the Aptana Studio Samples node ?. Aptana Studio does not ship with debugger sample. Given this pattern: Aptana Studio is not able to recognise this pattern correctly. I wonder if it's possible to tell Aptana with ScriptDoc. If yes, how? I've only seen comments for classes. Additionally var self ; could be replaced by a super constructor, which is not working either. Can I expect this to be supported naturally by Aptana soon? I'm really searching for a good javascript IDE which also supports this kind of writing javascript in a way.. singleton scriptdoc code completion. Dragging an image into the HTML editor should create an image tag. Dragging an image into the editor should create a img tag. You can view this behavior in TextMate. Dropping an image onto the HTML editor inserts an image tag with the relative path to the image (from this HTML file), the hight and width, and the alt text as the version of the filename: dragging gives me:. PHP Autocompletion for parent methods. When you overwrite a parent method you often need to call it from the new method, example: Aptana does not autocomplete the methods after Suggested fix: Attempt to replicate Check to see if the item is fixed in or in a newer version of the parsers If not in our code and can't be fixed, link to PDT issue referencing the problem. Aptana tries to open a new instance of itself when opening files via Windows Explorer. Breakpoints not working on conditions in alloy apps. iOS: \"There are missing app icons\" error is returned if you build a mobile project stack. Android Textfield is not vertically aligned at center. iOS: Error: cannot be used because it contains an alpha channel\". To create: install appc run Remove SDK version from appc use The following error is returned:. In TIMOB-18976 we added the ability to ute JS on the main thread. We now should set this as default. Note, this can ONLY be merged in if it causes NO behavior changes. If it does, then we must wait until. Create default classic project. Install on device with LiveView Enabled via Studio. Receive follow error: Installing on device without LiveView installs with no errors. Installing via CLI appc ti build -p ios -I -T device -l trace installs with no errors.. Changes to Classic Alloy apps are not updated on rebuild. Description: After creating a new app, Initial build reflects changes successfully. However on making changes and rebuilding the app, it fails to update those edits. Tested both on Alloy & Classic projects. The issue is not apparent when building to a device, it occurs when building on a simulator. Switching build target from device to sim updates the changes. However a second build to sim fails to do update. Cleaning the project and rebuilding the app allows for a successful build to sim. Steps to reproduce: Create a new mobile app project. Edit content in Save & build to sim. Make additional edit to Save & rebuild to sim. Result: changes to files made on step 4 will not be reflected on step 5. Expected Result: changes to files should be updated upon second build.. From release the patch method doesn't work. CONSOLE :. iOS: JS files in Resources get minified if minification is not \"skipped\". Android: cannot be cast to. iOS: Apple Watch App not installing on real device. iOS: ListView randomly not shown when using dynamic item height. iOS 9: Implement native auto layout to use on iOS9 SplitView-. The iOS9 SplitView component requires its children views to use the iOS auto layout engine. This is also known as This needs to be implemented in Titanium Views.. iOS9: Adopt IPv6 requirement for App Store Submissions. iOS9: Xcode 7 (beta 2) iOS 9 are unsupported. iOS 9: Support. As part of hand off, Search, and deep linking the developer will need access to all of the defined in their bundle ( via ). To define one or more all you need to do is to an node under such as:. iOS: ViewProxy modules error on building with \"error: expected ')'\". iOS9: Create framework check. iOS9: Background GeoLocation Support. iOS9: Implement NSUserActivity for Core Spotlight. iOS9: Implement. iOS9: Support Watch Connectivity. iOS9: Deprecate. iOS9: Update Contacts to reflect new API. iOS9: Create XCAssets (imagesets) w the cli and access resources within those catalogs at runtime. Android: Enable building with android M preview. Android: Setting (to false) crashes. Android: Label shadow color & shadow offset property not working on android lollipop. iOS: Posting a photo to Facebook gives \"Unsupported FBRequest parameter. Android: VideoPlayer is not playing mp4 videos anymore on Android. 1. Run the example code \" \" in our . 2. Then click the views events button Result: Should display the result. Result: There will be a error in log console: \"Error getting shared calendar invitations for entity types 3 from daemon: Error Code 1013 \"The operation couldnt be completed. error. iOS: ImageView is not rendering remote urls. iOS: ImageView with Remote URLs broken. Android: HTTPClient Onload Callback handles GET request incorrectly. iOS: Apple Watch support to the open the iOS app in the background via. TiAPI: Allow developers to opt-out of sending certain analytics events. ACS Photo uploads fail with 500 error. Download pre-release SDKs from authenticated stream. Since Ti SDK WebView does no recognise the html file when using File system, if there is space in app name. 1. Create a classic project named \"Simple Test\" (with space) 2. Create a folder named \"html\" under Resource folder. 3. Create a simple html file name like following following code into file Result: The webview should display normally. Result: The error pop out in console log: *\"couldn't load URL: 1. No such problem in SDK 2. Change the app name without space, problem gone.. iOS: WebView do not recognize local HTML File using if Project Name has a space. iOS: HttpClient timeout on POST request to a HTTPS server. Currently, if you upgrade to Node and attempt to build with a SDK, it will fail. This is expected by us, but confusing to the end user. To fix, we will warn the user that they should downgrade (or upgrade) to a supported node version Check the root file for the node range supported Compare that against the node version installed. If the installed range lies outside the supported range, print a that this node version may not work as expected and encourage them to upgrade (if older) or downgrade (if newer) to a supported node version.. Tooling: Organize parity report platforms. Remove the packaging of the BlackBerry distribution from the regular SDK.. BlackBerry: Remove from SDK Distribution. iOS: Investigate including native extensions in a Titanium project. Once we have made all the updates for APS we should fold back this version of the SDK into to reduce the number of different active branches in the APS repository. It would be greatly preferred if in the Titanium SDK build script we referred to a tagged build of the APS SDK and pulled in that version as opposed to checking in artifacts.. TiAPI: Move master version to. Update the master branch of to version. Mac: Cannot build projects - \"EACCES\" accessing .log file. TiAPI: needs to support click events. iOS: Alert dialog issue with persistent set to true. Android: android lib - Log cat bug causing some logs to disappear. iOS: After a Popover hides, Apps stop getting focus events on Tabs windows. This feature encompasses bringing coding to HAL Windows.. Android: Titanium crashes if back button is hit soon enough after app launch. The file generated on Jenkins becomes corrupted by the console output. Example ! The script that runs the JSCA generation on Jenkins is located here: Calling:. Windows: becomes corrupted during generation on CI server. TiAPI: returns only the first 3 digits of the version. Windows: Projects can not be deleted if it's built once. We now have Travis compiling the debugger on every check-in. Add a simple suite of tests that once the debugger is compiled: Create a simple application Set a few breakpoints Exercise the debugger against the simulator using the debugging protocol.. iOS: Reproducible crash with remote images in ListView. Android: Unable to run KitchenSink on Genymotion emulators. Brand new install, get this error on a brand-new CLI created project (ti create -p windows): The only thing that was odd about this install was that I installed everything while running Windows Home? I updated to Windows Pro after getting an error about hyper-v not being supported on my edition of Windows. Don't know if it's related. I tried creating a new project with Ti on an existing VMWare install, and it's working so it's not this version of the SDK creating a bad project.. Windows: Error during compilation - TypeError: Cannot read property 'visualstudio' of undefined. iOS: App crashes on deleting last row of tableview. Windows: Custom class issue due to WebKit Bug 135250. Windows: Move Duplicate Into Existing. iOS: Dialog arrow starts in center instead of at edge of view. Windows: No emulators found when trying to build project. Windows: Build - Cannot build for Windows emulator or device when path exceeds 260 characters. iOS: Cannot load images from the. iOS: Removing a ListView while SearchBar has focus results in crash. iOS8: Unexpected log output and intermittent crashes on iOS 8+ devices. iOS: App crashes while parsing XML. The Titanium framework uses a custom version of If an app links to Apple's that was introduce in iOS 7, Apple's App Store validator fails because it detects calls to and which both are referenced inside Attached various disassembly that shows the calls. Apple most likely created a special rule so existing Titanium projects are not automatically rejected, but disables that rule if newer frameworks such as JavaScriptCore are used. Now we have an experimental version of our PSPDFKit plugin that works in the App Store, but we really need JSCore to have all of our features - we don't want to provide our customers with a crippled version just because of a naming clash in the Titanium framework. The proper solution here would be to rename prefix the internal Webkit-methods.. iOS modules can not be built if there are any JS files inside the root assets folder. h5. Steps To Reproduce 1. Create an iOS module 2. Place a javascript file with some code in the assets folder at the root. 3. Build the module h5. Expected Result Module should build as usual h5. Actual Result CLI is throwing following error. We need to move the assets folder inside iphone folder.. iOS: 64-bit Platform reports wrong value for iOS. h4. Problem Description Custom fonts are not working on MobileWeb, But works well on Android and IOS. h4. Steps to reproduce 1. Create new mobile project (classic titanium) 2. Add this code: 3. Create a fonts directory inside Resources 4. copy the attached font to the fonts directory. 5. Select as the Mobile SDK 6. Run in mobile web h4. Actual Results The custom fonts are not show. h4. Expected results The custom fonts should appear, as used to happen with Mobile SDK h4. Extra info I tested this and the last known working version is Mobile SDK. MobileWeb: Custom fonts are not working. LiveView: LiveView crashes. Description This occurs on iPhone 6 ONLY initialized at index 3, displays index 1 (by setting its currentPage variable on creation). Expected results: Item at index 3 is shown Actual results: Item at index 1 is shown reproduce: Unzip attachment into any Resources folder for a Classic Titanium project. Run sample as iPhone6 and we see the issue return, but slightly differently index gets set to 2, instead of 1 (when it is initialized as 3). Unfortunately, we cannot use this as a workaround, as the view structure we need to build for the actual app needs the scrollableView to be in a container with other views, or to be set up without the vertical layout.. iOS: initialized at index 3, displays index 1. Android: Enable for android builds. Add compiled architectures to module manifest template. With the addition of 64-bit support, it becomes helpful to know the architectures available in a compiled module. We can then use this ins tooling to make sure modules are compiled correctly for use. We update the module template manifest file with the following values ( ): Android: architectures: armeabi armeabi-v7a x86 BlackBerry: architectures: arm x86 iOS: architectures: armv7 i386 x86 64 arm64 An example:. The iOS beta includes support for WatchKit, implemented in a similar fashion to Share Extensions (TIMOB-17335) We should provide support in the Titanium SDK for developing applications.. Android: of generated project has two modules tag. Android In a two column picker the selection indicator does not match the postion of the selected item. See: Implement proxy for EmailDialog.. iOS: Map annotations show buttons event is not declared on iOS. Android: CloudPush - events not fired correctly. MobileWeb: When hiding a view and showing it again the view is reloaded. iOS: Rebuild supported closed and open source modules for 64-bit. We need to update and re-build the following modules: h3. Commonly Used h3. Packaged with the SDK TIMOB-18089 (Core Motion) TIMOB-18091 (Encrypted Database) Removed from the list since it's android only. Upgrading this to 64-bit: Please review which is currently failing, but can likely be fixed easily.. Upgrading this to 64-bit: Please review which is currently failing, but can likely be fixed easily.. Upgrading this to 64-bit: Also note comments about Please review which is currently failing, but can likely be fixed easily.. Windows: Implement. Windows: Implement. Windows: Implement. This encompasses a few sub-items: Create a default project structure for new modules Hook up Studio to create new module projects.. Windows: Implement. Windows: Implement. Windows: Implement. Windows: Implement. Windows: Implement. iOS: Support Apple's integration of TestFlight beta testing. We need to support different TLS versions in our XHR. A property () will be added to for Android. It is currently iOS-only. See for where it is ultimately used. While TLS is not vulnerable to POODLE, we may wish to make the default TLS. Android: Creating & saving contact does not add the contact to the phone's contact list. iOS only returns \"en\" as language. In IOS simulator (not on device), can only return \"en\", no matter what the system language is set to. This is the code that sets the default locale:. After starting a map view, everything works fine for a while. If you do a lot of scrolling and zooming, you don't see any map details any more after a while on some devices Samsung Galaxy S4 w Android Oppo Find 7 w Android Google Nexus 7 w Android Switching between satellite and standard view doesn't change the bevhaviour. After clearing the cache (application settings) and restarting the app, the map works fine again for some time. So I assume it's a memory issue. * In addition some users report that the performance of the map view is, compared to the Google Maps app, worse and the use of internet traffic is higher. I attached a sample project. You just have to enter your Google API key and adapt the app id. If you have any questions or need more information feel free to post a comment.. Map: Android - Google Maps v2 map tiles not showing when. Android Connection closed by peer. Android Improve CLI support. iOS: times out on GET request with POST data. Android: Please add text settings (font size, family, color) to searchbar and searchview. Windows: Launch Emulator. Android: Default classic & alloy apps stops responding after launch on android x86 64 bit emulator. Android: App fails to install for any Android version other than with. CLI: Check for iPhone platform in breaks Windows environment. Windows: Cross-platform C++ Logger. Android: App crashes in. iOS: Add floor property from CLFloor needed for indoor geolocation. In iOS 8 Apple introduced some APIs for indoor geolocation. See: There is also a slide deck from WWDC 2014 talking about this in more detail. It is a trivial change, but a useful one. The only down side is that finding a list of buildings that have been mapped by Apple is a difficult task. Here is the pull request:. iOS8: KitchenSink control ButtonBar property 'Style' does not work. The module which is part of the SDK needs to be updated for the new iPhone 6 and 6+ launch images. I've created a PR that fixes this and is future proof for other subtypes () and scales () as well: To test: 1. Create a project 2. Move the launch images from to 3. Add some text to the iPhone 6 and 6+ images in the new folder 3. Build the project 4. Run on iPhone 6 or 6+ and see it is not showing the i18n images. h4. Problem Description The user wants to sync a ecommerce's cart inside a webview with a view showing the number of items in the cart in the app. Therefore, he wants to have an event in the webview that throws an event when the cart is updated via AJAX. h4. Extra information We did some research, and we found some info that could be useful. And this method public (WebView view, String url) StackOverFlow mentioned that method as a way to catch ajax calls:. A comment with security level 'Developers' was removed.. iOS: Aborting upload causes file to stay in RAM. Android: Add property to. i want to use loading dialog in android that is not dismissed when touching outside and use back button to cancel loading operation when using and it displays loading dialog just fine but when touching anywhere in screen, it dismisses the dialog. Android use false to prevent this action. Please add or find a solution for this problem. After discussion on TIMOB-17718, we believe that we should enable available under iOS as well and return. iOS8: Alert dialog does not consider window orientation modes when keyboard is displayed. Android: Cannot open new window after last window closes. Using \"Open in to send a file to my app let my app crashing on opening before the first line of code will be uted. Here is the log:. iOS8: App crashes after starting using \"open in from another app. I have already consumed the change from TIMOB-17662 by setting autorotate to false in and this issue is still present. I initially mentioned this issue in Case 2640 which has been closed so that we can focus on this specific case. I have uploaded an app called and screenshots which illustrate this issue. CASE 1 (landscape window in portrait mode) Launch the app in Landscape mode with the Home button on the right Rotate the app around, notice the UI changes to reflect the orientation correctly. Get it back into landscape mode (Home button on right). Click Launch Camera Click the (X) button and then immediately rotate the tablet to portrait up or portrait down. Notice that the image capture view will close and the app then rotates into landscape orientation. It should rotate to portrait orientation. See screenshot Home On CASE 2 (portrait window in landscape) Kill the app Launch the app in Landscape mode with the Home button on the right Rotate the app around, notice the UI changes to reflect the orientation correctly. Rotate the app to portrait mode (Home button on bottom). Click Launch Camera Click the (X) button and then immediately rotate the tablet to landscape left up or landscape right. Notice that the image capture view will close and the app then rotates into portrait orientation. It should rotate to landscape orientation. See screenshot Home On This is FIS Mobiles top priority issue that we would like fixed in the TiSDK.. CLI: Hitting the enter key after entering the data for CLI prompts in CLI setup wizard, does not take the cursor to next line. CLI: Running \"ti build -p iOS -T simulator command throws error is not defined'. iOS8: UrlSession - is not supported\" message appears if you require in the module. iOS8: Add ability to request Geo Location Permission. iOS8 has moved over AlertDialog and OptionDialog to Also the correct way to show popovers is now to set the to Titanium needs to refactor these three proxy classes. Will probably also need to change the supported API.. iOS8: Refactor Alert. iOS8: 'rsync failed' and unable to submit apps with Xcode 6 if including DSYM file. iOS8: Listview: Separator Insets values are not respected on the side of the title data if the listview row contains a title data. iOS: Two instances of iOS Simulator launched when one of them is iPhone 6 6 plus. The previous instance of iOS simulator is not killed and the second instance is created when one of the iOS simulator is iPhone 6 iPhone 6 plus and the second instance is any other simulator apart from those two. Steps to Reproduce: 1. Create a project 2. Run the project through studio or CLI on iPhone 6 simulator 3. Once the project runs on the above simulator, try to run the same project on any simulator other than iPhone 6 iPhone 6 plus Actual Result: A second simulator instance is created. Expected Result: There should be only one instance on simulator.. iOS: Add images and new icon sizes to new-app templates and samples. iOS8: OptionDialog doesn't work in a Popover. iOS8: Access to &. iOS8: Popover: The app does not change orientation when popover is visible. iOS8: Add Support. Add a property to return the application setting URL on iOS 8 so that we can use to launch directly into that screen. For example:. iOS8: Add to determine whether the app is currently registered for remote notifications.. Returns a Boolean indicating whether the app is currently registered for remote notifications. Add support for so that the developer can check if the user has authorized notifications.. iOS8: doesn't work without view-property on iPad. CLI: Should offer to create the Application (or other user designated) folder if it does not exist.. iOS: black stripe on the bottom(see attachment) when using showCamera with transformation parameter of scale(1) and an overlay rotating 90 degree. In Badge when trying to set the App Badge the console prints out the statement below. The App Badge property can't be set by using either the set method or changing the property because of this. The attached is a test case which can be used to reproduce. This is a regression as the test case can be used to set the App Badge on both an iOS7 and iOS6 device. To Reproduce 1. Add the attached to a project and build to and iOS8 2. Tap the either of the Set App Badge labels Result The App Badge is not set and the console prints out the above statement. Result The App Badge should be set to 20.. iOS8: Unable to badge an application icon. iOS: CLI: Building for all IOS devices throws i is not defined\". h5. Description There is a visual deformation of a keyboard, when focus in a text field. h5. To reproduce 1. Run iOS Keyboard. 2. Click the text field. h5. Actual result The keyboard is deformed h5. Expected result 2: Not a distorted keyboard, which should not disappear and rotate with the device.. iOS8: Simulator - unexpected behavior before launching the app. h5. Description When launching the app on iOS8 Simulator, I encountered that as soon as the simulator started, it hanged with the black screen for a while before the splash screen appeared. The simulator displays the home screen with the installed app icon. The second attempt to launch the app is successful. Note: the black screen appears for iOS7 and iOS8 Simulators, the return to the home screen happens on iOS8 Sim only. h5. To reproduce 1. Create the default app 2. Run iOS Simulator h5. Actual result The black screen for a while, the splash screen and return to the home screen. h5. Expected result The application should be launched successfully. iOS: The app fails to install on iOS device after a second iOS device is also plugged in. CLI: Some iOS build options with \"ti build -p iOS\" command is not prompting for input value when run without values. iOS: HTTPClient: AutoRedirect false returns 200 status code, not 301 302. CLI: Running \"ti create prompts for the directory to place the project but giving the error message as well. iOS: Unable to check if a JS source file exists on iPad device. iOS: Unable to Set Multiple Cookies in Request Header. Android: Converting a blob into a valid image does not maintain dimensions. When using and setting the properties in the create method to false it is ignored and they default to true. The workaround is to use one of the two ways below to set the properties to false. or To Reproduce 1. Create a project and add the attached 2. Build to an Android and then tap the button Result The properties set to true, the URL is and auto-encoded, in the Studio console you should see what is attached in Result The properties should stay false and it should not auto-redirect or auto-encode the URL.. Android: Image incorrectly sized when using with custom theme. In please add the following code to the function (at about line 434 in SDK) This will add support for the full date format, which is the same as the long date format, but with the day of the week. You can add the same code to the following function to support the full format for time as well. A very simple change. Thanks.. TiAPI: Support \"full\" date format. iOS: APSHTTPRequest send fails with assertion on. CLI: Choosing the latest version of a module does not pick the latest compatible one. Integrate ioslib into tio2. Querying simulators, Launching simulators (Xcode 5 & 6), stopping simulators. CLI: Support Android. windowslib is the communication library we use when interacting with Windows devices. In this case, it does not yet exist, but needs to be pulled from the existing Windows detection code done for the Windows Hybrid SDK. It needs to both the needs of the current Titanium CLI as well as the tiO2 project. This task involves both the initial refactoring, as well as integrating it back into and. androidlib is the communication library we use when interacting with Android devices. It needs to be refactored to handle both the needs of the current Titanium CLI as well as the tiO2 project. This task involves both the initial refactoring, as well as re-integrating it back into and. Android: Refactor androidlib. Adding Environment functionality: 3 Adding Xcode functionality: 5 Launching simulator Stopping simulator Bring back into Titanium CLI: 8 * Bring back into tiO2: 3. Android SDK not loading due to EPERM failure. iOS: URLSession Module returns blob instead of file location - causing low memory crash. Android: contentOffset property of not accessible. iOS8: Support iOS 8. Android: App crashes when using searchBar border properties. App crashes if we use the searchBar properties borderRadius, borderColor, or borderWidth. And use this searchBar in a tableView using search property. Environment: Titanium SDK: Titanium CLI: Android SDK: OS X Version: Appcelerator Studio: to Reproduce the issue: 1. Create classic project. 2. Paste this code file. 3. Run this code with the testing environment. Code Thanks. Android: Android menuItem with actionView can't handle. Android KS- Facebook crashes. Android KS- Photo Gallery crashes. Here is why and how it can be fixed. I debugged why autoRedirect property of is ignored for The default property of autoRedirect is true. When autoRedirect false is set, is always zero in Therefore the redirect check if statement if && ! 0) does always fall through. ; needs to be called in advance. Android: TIME Picker is too small when useSpinner is set to true. CLI: Windows 7 hangs on build during \"Powershell\" detection. When you try to perform a \"ti build\", the process hangs (0% of CPU) forever. After hours of debugging (with I discover an issue in the module. Basically the 'spawn' uted (line 385) to detect the powershell, for odd reasons, never emits the 'close' event and so the process hangs. Skipping this detection, the build continue normally. I have described in more details the problem in the following post: Not sure why this happens, but I'm not the only one with this issue.. iOS8: not working properly. iOS8: KitchenSink: Views Options Dialog: Pop up does not show up on iPad. iOS8: Orientation: Screen gets distorted when orientation changes. In addition to the X and Y properties, views in the Android L Developer Preview have a Z property. This new property represents the elevation of a view, which determines: The size of the shadow - Views with higher Z values cast bigger shadows. The drawing order - Views with higher Z values appear on top of other views. We could use this instead of sorting the views manually like we do now.. The material theme provides a new style for your app, system widgets that let you set their color palette, and default animations for touch feedback and activity transitions.. description The developer's app includes a Ti module that wraps a 3rd-party library that uses the iOS Reachability class. It appears that APSAnalytics also uses the iOS Reachability class. Both the 3rd-party library and the APS system include this class in their respective libraries causing a duplicate symbol error during linking. Below is the error I get when manually building the app:. iOS: Duplicate symbol linker error when using APS. h5. Description: Ritu experienced an issue during update to GA components which resulted in her ti config JSON getting corrupted. The cause or timing of this are not known. No other team members experienced it during our update testing, so at this point seems isolated to a single system. When a project is created in Studio in this configuration, the is not rendered correctly. In addition all commands for the CLI fail, see below for details: To fix the issue, the JSON structure was manually edited to be valid. h5. Steps to reproduce: Steps are mostly unknown, but have more detail on config Configure a system in the following manner: One latest development version of the SDK in your titanium folder, but no GA Latest modules from a previous development build install Studio Latest version GA npm components (acs CLI Alloy Check for Appcelerator updates in studio Update your NPM components and SDK Check in terminal \"ti config\" h5. Result: JSON structure is invalid, and the CLI is unable to parse. CLI commands fail, and Studio editor fails to render (since components are missing from CLI-built project) h5. Expected Result: CLI identifies bad structure and offers information on solution. iOS8: Add support for Share Extensions. CLI: fails to build to device with Android. Crittercism: iOS crashes do not show up with module. Android: Animation is broken if you don't stringify the affected view. iOS8: Add support for Interactive Notifications. h4. Problema Description Before navigating for awhile the map stop loading, that only happens when using Android and Google Play Services h4. Community Extra info h4. Tests Nexus 4, Android Google Play services - stopped working Nexus 4, Android Google Play services - OK Xperia Neo V, Android Google Play services - OK Galaxy Nexus Android Google Play services - OK Razr D3, Android Google Play services - OK h4. Testcase h4. Logs. Android: Orientation does not change for Window inside tabGroup. h4. Problem Description The geolocation bug which used to exist in version (TIMOB-4982) has been reintroduced in version The last working good version is . h4. Test Case 1. Create a new mobile project (classic) 2. Paste this to 3. 4. The map never ask for permission for the GPS access, not even if the user presses the location icon google will briefly flash \"Location could not be identified\" h4. Extra information Use case: When we open a html5 page that as a geolocation titanium does not give access to GPS on the device.. Android: Geolocation is not turning on in Webview. TiAPI: Add support to HTTPClient for PATCH requests. CLI: Android: Ti SDK picks up the latest incompatible version of the map module. 1. In the manifest file of map module change the minsdk to (this is because map module does not build with & throws errors). 2. Use SDK and build an app which has map implementation in it. Result: 1. Even though studio does not show map module in the module list, the SDK CLI picks up the incompatible version & throws errors: Result: 1. The SDK CLI should pick up the latest compatible version of the map module build.. iOS: Search disappears from ListView. Android: LiveView throws errors if action bar is implemented in the app. I am using web view in my alloy application to render charts using RGraph HTML5 library. My code works perfectly fine on iOS. Unfortunately on Android I keep getting an error indicating that RGraph library files haven't been loaded: : (main) Uncaught RGraph is not defined I have attached the HTML file & function from my controller code that can be used to reproduce the issue. RGraph library can be downloaded from here : I changed the extensions of all js files in the library to .jsf to stop Titanium from compiling them. And this is the structure of my folders in the project Similar for iOS. The rest of the project follow the common structure of alloy project. Please don't hesitate to contact me if you have any questions. Here is the js code that I'm using: Here is the HTML that I'm trying to display:. Try code above, after animation Window color is reset to. iOS: Can't create modal transparent Window. iOS: DocumentViewer shifts up on second tap when it's in Landscape mode. iOS: Blur event fires twice on TextField. Here is the example XML:. TiAPI: Allow multiple markers in ListView. Android: has text relocations. This is wasting memory and is a security risk. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Investigate' (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. Android: ListView shifts when loaded a second time or loaded into a window without a tab. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Triage' (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. TiAPI: Add scroll end start events for ListView. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Triage' (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. Android: ImageView: Image is not getting displayed inside table row It is reproducible on SDK as well. It works fine on iOS platform. Steps to reproduce: 1. Run the below app Expected: Should see a tableView rows with Appcelerator logo in each row. Should be able to scroll up and down without crash Actual: Image is not getting displayed.. iOS: Unable to disable animation when using. h3. Reproduce Step Run below test code. (case1 & case2) You can see wired section animation h3. actual Result see this video : When is same, it work properly. But if is changed, it work with wired animation h3. Expected Result If set animated to false or animationStyle to NONE, there are no animation.. Fold Titanium Diagnostic Test into CLI. We have had good luck with an initial implementation of a connection diagnostic test for Titanium: We should fold this into CLI This should result in a tool that customers and sales engineers feel comfortable using at customer sites to diagnose any issues that may be occurring. We should run this as part of `ti info` and `ti setup`.. Android: NPE at. h3. Steps Followed: 1. Create a default mobile app. 2. Launch the app on android Actual Result: Build fails and 'Modules could not be found' error displayed in Console log file. Please refer the attached log and console log file for further reference. h3. Workaround We manually added the required modules folders from mobile SDK location into our Studio WorkSpace in the respective project's module folder.. Android: NPE when running Android app in a distribution or debug version. Android: Module Packaging - Titanium fails to package android module project. iOS: Battery Platform event listener doesn't work after first call. In we deprecated FastDev. In we need to remove the code altogether. For now, if you wish to use it, you still can from the command line following the instructions in. needs an error event. h5. Problem When clicking on an annotation in a mapview, no event is generated for SDK but its working well for SDK For more details visit h5. Test Code h5. Steps to reproduce Please follow my steps to reproduce this Create new project Replace code to my test code Run with IOS SDK Click on annotation pin. Annotation appears with title and subtitle Click on title or subtitle Its shows alert message Now change to iOS SDK and follow steps 4 to 6 For iOS 7, if you click on title or subtitle, alert message will not display. iOS7: No event generated on click of map annotation title or subtitle. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Release (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Release (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. Android: Allow full Activity lifecycle access for Titanium modules. Android: Update Facebook Module to version. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Release (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. iOS: SDK should have under 10 compiler warnings (it currently has 159). The reason why is because we don't put the directory inside the app root directory like we do for iOS. Instead, it's in an adjacent directory to the app root directory. In other words, it's however it's not accessible because apps can't leave the app root directory. There's no way for an app to access module assets from a Titanium app. The only way I've heard is you have to use write another module that effectively proxies the assets. It gets worse, modules paths are not namespaced like on iOS. So if has a file called and also has a they collide and only one of the files will exist. Yes, this is really bad design. Yes, these are bugs. Yes, they should be fixed.. CLI: Improve detection of Android SDK and SDK Home locations. BlackBerry: 'java' processes belonging to 'Appcelerator Studio' might kill the CPU. Android: Automatically generate ProGuard configuration file. Android: Image with Menu text on Menu Item for Android Menu is not being displayed and menu text is cut off. LiveView: Create Error Warning Screen. LiveView: Does not trigger code errors. 1. Create a default application 2. Enable LiveView in Run Configurations 3. Run on iOS simulator 4. Replace into 5. Save LiveView error is not triggered LiveView error is triggered. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Release (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. Android: Real Switch on Android. Android: Add support for creating video thumbnails. I have the same issue that needs to be resolved urgently. Any progress on this?. Steps to reproduce: Create a new SingleWindow application from a template Start the project under LiveView (in this case, iOS simulator) Edit the files in i18n. Note that saving those files doesn't restart the app. Expected behavior Editing a file in the i18n folder would refresh the application.. Android: KitchenSink: text does not size to fit in buttons. Android: 'longpress' event is not working in ListView. iOS: Accessibility - Label inside scrollview does not work properly. iOS: Accessibility: Accessibility does not work on Slider Control. iOS: Accessibility: Accessibility does not work on Slider Control This is not a regression. Issue also exist on SDK Steps: 1) Run Acceptance Access 1109 on Accessibility module. 2) Touch the second slider (with LVH defined in sequence) Actual Result: Device just reads Expected Result: Device should read aloud LVH(This is slider2 label , This is slider2 value , This is slider2 hint) followed by 'seek and value adjustable. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Release (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. As seen in the (another place) there's a new subtype of tab bar in the Android, called Scrollable Tabs.. Android: Implement Scrollable Tabs. CLI: Add support for Windows Mobile platform. This task is for writing the , , , and builtins for the CLI for Windows platform as per the .. Windows: Implement. TiAPI: Cannot add a whitespace at the end of string in i18n. iOS: TableViewRow selection causes child view's to disappear. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Release (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. Need to implement at least: *. BlackBerry: Implement important functionality. Need to implement at least: *. BlackBerry: Implement important functionality. Need to implement at least: *. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement. Need to implement at least: ute. BlackBerry: Implement. CLI: Building for android with '-b' -build only flag starts the daemon & waits for the device after building the app. BlackBerry: Implement important functionality. CLI: Alloy: Mobile Packaging Failed. Android: Make generated projects importable into Eclipse. Ticket for tracking the update of JSCore to the version shipping with a later version of iOS. Document is here: We can pick a version based on a tag from Some versions we have been able to ascertain, but it is unclear why we wouldn't just pick the latest stable version. iOS iOS (KHTML, like Gecko) Mobile 12B411 iOS (KHTML, like Gecko) Mobile 12A405 iOS (KHTML, like Gecko) Mobile 12A365 iOS: (KHTML, like Gecko) Mobile 11D167 iOS. iOS: Update jscore to version. Windows: Implement \"title\" and \"setTitle\". Use the implementation matrix to see what's remaining (these are things that are not implemented but supported in Cascades): Implement at least: *. Blackberry: Implement important functionality. Blackberry: Implement important functionality. Blackberry: Implement important functionality. Blackberry: Implement important functionality. BlackBerry: Implement important functionality. Use the implementation matrix to see what's remaining (these are things that are not implemented but supported in Cascades): Implement at least:. BlackBerry: Implement important functionality. Use the implementation matrix to see what's remaining (these are things that are not implemented but supported in Cascades): Add at least: *. BlackBerry: Implement important functionality. Blackberry: Implement important methods. Implement at least: *. Blackberry: Implement important functionality. iOS: TableView scrolls back to focused text field on scroll end. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') 'Tooling' (on board Planning') * 'Triage' (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. BlackBerry: Add support of javascript implementation of parts of the Ti API. Blackberry: Support overriding the default UI unit via. Implement at least:. BlackBerry: Implement important functionality. BlackBerry: Implement setLayout getLayout. BlackBerry: Complete methods properties events. Complete UI View methods properties events NOT required by Kitchen Sink Add at least:. BlackBerry: make sure that TiObjects get to the destruction state. BlackBerry: Implement important functionality. Use the implementation matrix to see what's remaining: Implement at least:. BlackBerry: Implement important functionality. Use the implementation matrix to see what's remaining (these are things that are not implemented but supported in Cascades): Add at least:. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. iOS: on iOS is broken. BlackBerry: Implement important functionality. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') * 'Release (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. * Implement basic Blob functionality: accessing data, getting size, appending, convert to string. Blobs are primarily used to wrap native data structures or sources (ex: file descriptor, image, buffers). The goal of this ticket is just implement the proxy front facing APIs. Internally it should be architected to support wrapping various data sources. For the initial implementation support \"buffer\" based blobs would be a good first step. Blobs are not creatable, but returns by various API methods in Titanium. For testing this ticket implement the method. This should return a Blob which should allocate a buffer and copy the data over. Blob streams and to image conversions will not be implemented at this time. Separate tickets for those will be created. h3. Acceptance Test Look into using the test in Anvil for Blobs. The test is currently very small, so try to improve it. Anvil may not run right now on BlackBerry, but we can just copy the test into an application for now.. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. An individual row for a TableView . In iOS, to a degree, this is but is more the data than the view. For example, TableViewRow does not recycle while the cells do. Implement at least:. BlackBerry: Implement Simple TableViewRows. BlackBerry: Implement important functionality. BlackBerry: Implement important ScrollView functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement ACS CloudPush module. BlackBerry: Add support for ACS Cloud module. BlackBerry: Implement module API. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important Gesture functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. BlackBerry: Implement important functionality. This may be completed. It only looks like the following are required: *. Related to TISTUD-998, right now in Studio you can select (some of) the properties of an AVD (Run- Run Android Emulator) but this isn't configurable enough for some cases (although you can modify an AVD created by Studio in the tools, as long as it has the right name). It would be nice to have the feature to select a pre-existing AVD in the run so that you can use an existing AVD without having Studio create a new one for you. It appears to require build script modifications allowing for the specification of an arbitrary AVD.. Android: JSS with import and js with include files not working. Android: should accept an alias password. iOS: Support building to device, directly to the device, skipping iTunes. When building to device, it would be good to build directly to the device rather then building, then having to sync via iTunes. Here is a good jumping off point: For those people who wish to sync to iTunes, we will inject a fake \"device ID\" that represents iTunes Sync and this will revert to using the existing mechanism.. Android: Add compiler warning when using maps with Non-Google APIs SDK. iOS: fieldCount is a property beginning in Update Anvil, KS, etc.. iOS: searchHidden value does not stay when window containing scroll view is blurred focused. When loading a switch with a value set to 'true' the switch shows an animation going from 'off' to 'on'. Users would like a property added to the switch object of 'animate' as a boolean value, to turn off the animation on-load if the value of the switch is preset to true. Reference ticket:. iOS: Allow developer to disable animation on switch object. This issue was previously scheduled to be worked on in more than one sprint: 'Release (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Release (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. Android: Support passing customized launch params to Android emulator. The user folder for my profile contains an ampersand - real names hidden). This is preventing Titanium from creating the Android AVDs needed to test apps, giving the following error: Error: is not recognized as a valid sdcard value. It looks like the command that creates the avd is stripping away part of the string when it tries to create an avd. I've manage to track down a function 'create avd' in which I think may be the culprit, but I'm not sure where to go from there. The sdcard has been created, so the problem must be after that point. There are a multitude of methods for renaming the user folder, none of which are straight forward (registry edits, I'm hoping someone can tell me a way of making Titanium function with this, albeit rare and idiotic, usage case. Does anyone have any suggestions?. I couldn't find an existing ticket for this, but I remember it being mentioned somewhere before. Would like to be able to draw vector shapes on top of a map with various colours opacity textures. Bonus points for code that assists with drawing and manipulating the vector with touch events, placing markers on the corners for resizing etc. Otherwise, at the very least some event triggering for clicking + interacting with the vector shape. This adds a whole other dimension to mapping applications for plotting areas and recording information against these areas.. When creating projects with ACCS enabled, we need to validate the name. So far, I know that are not valid for ACCS projects. So for Titanium Mobile, we need to check the only if ACS is enabled. For a standalone ACCS project, we need to add a check for valid strings. An alternative would be to format the project name so it's valid for an nettle \"new\" command. I'm not sure what the implications are. Note: There may be other strings that are not valid h3. Suggestions For existing projects, if a appears in the name, prompt the user to pick a new name. Python not on the list in commands menu. See for more information. If multiple devices all present themselves with the same launched app and same security key, we need to allow the suer to select between them Add a small 16px icon next to the device to identify it (iOS Android, but could eventually be something like iPhone iPad) * Okay Cancel to select a device. on the device also performs an \"OK\". Debugging on Device is a multi-step process, and we should guide the user through the steps. Once the user presses the \"debug on device\" command, pop up a dialog that shows the four steps: Sync to device (iTunes) Connected Suggest having a dialog with the four steps (1-4), and having each step bold in turn as we ute that step. The menu options for debugging should be disabled in < SDK There may be other locations we need to check as well, like validating the launch configuration.. \"Right click Open in New window\" in Dashboard should honor Eclipse browser settings. Alloy templates are similar to rails preset set of files, more a set of commands to run to generate a scaffold. We need to present Alloy templates alongside traditional templates as part of the new project wizard. Alloy templates need to specify some sort of tags specifying them of type \"alloy\". Create Jenkins build. This makes the latest version of Rubles available to all Studio users .ruble projects from the master to the stable branch * Push the results back to Github. As part of the build, (before the push): See if that git tag has not already been created. If not, create a new tag of the form (note the additional \"v\" at the front) appcelerator studio3 studio3-php Pydev swt-webkit .ruble. Dashboard: Search Option: Change endpoint of search to. The search option in Dashboard needs to point to the new endpoint. An example query is. Widget is disposed in. Open Shift has new images and logos. Replace the branding in the project wizards with new images. Wizard banners during project creation (48px image) * Deploy wizards (16px images). Window New Window new Titanium Studio window instance cannot open the dashboard. This is not a regression. There are no log messages. Steps to reproduce: Titanium Studio Window New Window Navigate on ToolBar in New window and Tap on \"Dashboard\" button logo), or Help Titanium Studio Open Dashboard to open the dashboard. Actual result: Dashboard does not open. Expected Result: Dashboard should open.. Sign-Up Splash: make cursor change to hover on mouseover of hyperlinks. Currently the hyperlinks are active but appear as colored text. Add a hover to the items so the cursor changes to a \"hand\" to highlight the link nature. See main bug TISTUD-1948 for screenshots. We decided against underlines as they look busy in context.. Ability to sort the certificates and provisioning profiles in Titanium Studio platform. When, there are many certificates or multiple provisioning profiles, its really difficult to sort them. Please add sorting by clicking on the column name.. Similar to TISTUD-1825, we need to check and see if is installed during the initial Studio install, and if not, run the installer. Once we've updated TISTUD-2001, we just need to alter the installer to actually include the check. See the parent ticket for the URL from which to download the installer.. Pass in JAVA HOME to Python scripts. While testing \"Build Acceptance Android Only\", I attempted to build a default Titanium Mobile app (just the standard template) and I encounter the following problem: I check and the $JAVA HOME is set, but was not available to the Python script. Studio should check for the JAVA HOME before beginning a build, check if it is correctly set, and if it is missing or incorrect pass in a correct version into the build. This issue is a not a regression since the bug is due to a user of JAVA HOME. Steps used to reproduce: 1. Ensure that the $JAVA HOME global variable is set ( ls -R $JAVA HOME ). 2. Create a new Titanium Mobile Project. 3. Create a signing key. 4. Package for Distribution (Package Distribute - Android App Store) Expected result: Android correctly packages and a package file is created in the specified place. Actual result: The packager gets to where it can not find java as $JAVA HOME isn't available to it. Tested by multiple sources on Titanium Studio build and on both Ubuntu and using SDK replicated the same failure. Switching back to SDK fixes the issue in all studio platforms, as is the first version to use JAVA HOME in the packaging scripts. Suggested solution: If it is, check if the JAVA HOME variable is correct by checking for at that path * If it is incorrectly set, or not set, infer the JAVA HOME location by using values from Studio's environment.. Titanium Studio: SDK Updates: canceling extraction does not produce a warning. During an SDK update, if the extraction process is canceled, there is no longer an error message generated. This is a regression. This worked in It is worth noting (not part of the regression) that the partially extracted SDK remains in the SDK folder, resulting in an invalid SDK. When the SDK is in this invalid state: It is still selectable by titanium projects, and if it is a stable release, it will not be recognized as needing an update. Steps to Reproduce: 1. Download any version of the SDK using a method such as: Help Check for Titanium SDK Updates or Help Install Specific Titanium 2. During the extraction process (which occurs after the process), press 'Cancel'. Actual Result: No error dialog, no error logs. Expected Result: Error dialog pop-up and error logs, with a button allowing the user to open an window to the extracted location on disk (if they wish to remove it themselves). Change AppID validation to only allow upper and lower letters (A-Z, a-z), digits (0-9), and period. Steps to reproduce: 1. Create default TiMobile app 2. During creation of default app, include an underscore in the application id name 3. Install app to device Actual: In the console, will get error. See attachment. Expected: Replace underscores with dashes in the app ID. Note: You can install to Android device without any issues A similar issue happens if you have a '-' in the app id. In order to have the widest cross-platform appIDs, we can only allow upper and lower letters (A-Z, a-z), digits (0-9), and periods. Once a user has installed, we need to install the nettle package for deployment: If not, install it. Suggestion is that we don't really know if we need to sun under sudo. We should try without, and then prompt the user if we fail in that case.. Rebrand functionality as Appcelerator Custom Cloud Services. Summary log from chat recorded on poker session Story Time 20120710: Chris Williams: I will not be silenced. Enable packaging of Alloy applications. This may not require any additional work. We may simply need to run the existing script as we do with typical Titanium projects. See here for confirmation:. Enable running of Alloy applications. This may not require any additional work. We may simply need to run the existing script as we do with typical Titanium projects. See here for confirmation:. Add blank Alloy project template to project wizard. By default, a new Titanium project is an Alloy project. Select the \"blank new alloy template\" as the default in the titanium mobile project wizard. This creates an alloy project without any template.. Install Alloy package using NPM. Include offline API and Help documentation. h4. Problem Description If you don't have a working internet connection, you won't be able to browse the Ti Mobile SDK Docs from the help menu in the Ti Studio. Would be nice if we include the doc in SDK's Zipfile, so you can get the exact doc according to which SDK you are using. This will make easier to work with Titanium when in a flight or similar places. This should be a separate feature added to the update site.. Add check for pre-existing files to Titanium Mobile Project creation wizards. Signup link in Ti Studio login dialog does not work if browser preferences are changed. Check to make sure is installed For linux, install for Ubuntu, otherwise ask user to install themselves. If it is, confirm it's within the currently supposed version range. If not, inform the user to upgrade or install a new version If it's not installed, download the current package from an appcelerator web site (so we can ship a stable version). Each platform for Titanium Mobile has extra content placed into a tab. approximately something like: Add a mechanism whereby each platform can contribute a tab (similar to that shown in the screenshot, and via an extension point) that contains additional configuration information. As an initial pass, suggest just showing the text content of the for that platform in a text box so it can be edited. In the future, we could amend this to show additional UI. The \"All Platforms\" in the screenshot is not applicable.. Add per-platform mobile configuration tab for editor. When creating a module in studio, the creation fails with internal error: could not move file. Screenshot and log attached. This only occurs with android modules. However, android modules can be created from the command line. Steps to Reproduce: 1. Go to New Titanium Mobile Module Project. 2. Type in a project name and module id. 3. Deselect Use Default Location. 4. Browse to a new location Desktop ti). 5. Create the module. Actual Result: Error. Expected Result: New Module.. Titanium Studio: Upgrade Install Titanium Module to Project to include module in. If a module is installed to project using Help Install Titanium Module, the module is not added to the If a module is packaged to project, it is included in the There is no log info. Steps to Reproduce: 1. Create a new Titanium Mobile project. 2. Create a new Titanium Module project. 3. Package the module to a directory Downloads). 4. Go to Help Install Titanium Module. 5. In Install from URL, select the packaged module zip. 6. In Output, select Project, and select the app project you created. Press OK. Actual Result: Module gets unzipped to project, but the module is not in the Expected Result: Module should unzip to project, and a module xml tag should be added to The module should be visible in the TiApp Overview.. Titanium Studio: If Titanium SDK root folder is read-only, Studio will not prompt the user with an error. If the root Titanium SDK folder is readonly and latest sdk is not there, Studio will not find an sdk to update when update sdk is called. Step to reproduce: 1. 2. Delete the latest version of SDK folder 3. Give \"Titanium\" folder \"read only\" permission 4. Open 5. bar 6. Select \"Check for Titanium SDK updates\" Actual result: displaying MSG. \"No update available\" Expected result: Documentation web page should load in a browser.. Download the latest beta release from Run Studio. After logging in, it will crash with the following log:. Titanium Studio: Menu bar: Submit a the tab key only jumps between text fields, not all fields. Rename \"Titanium Mobile Project\" to \"Titanium Project\" and \"Titanium Module Project\". In keeping with the removal of Desktop functionality from the core of Studio, we should rename \"Titanium Mobile Project\" to \"Titanium Project\" and \"Titanium Mobile Module Project\" to \"Titanium Module Project\". When trying to setup Android inside Titanium Studio, the wizard fails showing a window with the following error message: \"NLS missing message: in: OK\" I managed to install the SDK manually, but I get the same error message when I click the UPDATE button. This is a regression from This does not occur in. Android SDK wizard fails with the message \"NLS missing message: in:. Last line in JS editor does not have line number when word wrap is enabled. Create interface to manage existing Titanium SDKs. The enablement of the platform targets is inconsistent Steps: 1. Create a mobile project with just mobile web and SDK 2. In the enable the android and iphone ipad targets 3. Change the sdk to < 4. Save the Results: Checkbox for are checked but enabled 5. Close the and reopen it Results Checkbox for are checked but disabled The checkboxes should be disabled as soon as the SDK is switched (since we can't add change platforms after the fact in SDK <. Titanium Studio: Project Explorer: Python option is not available in the list of \"New From Template\" under python file. Allow non-commercial iOS developers to deploy iOS applications. Titanium Studio visual interface does not show common js modules such as the amazon Titanium AWS module can be found here: It is installed sibling to the commonjs module in the commonJS folder After this is installed the visual editor does not show the module as available. it can be manually entered into the file and works, however the visual interface does not show it PLEASE READ THE FOLLOWING TICKET: there is a bug that is direct conflict with this request:. Description: While attempting to set a browser before running a mobile web preview, I noticed that the list of browsers did not include any specific browsers except firefox. It would be ideal to populate the list of installed browsers rather than have the user populate the list manually. Steps to reproduce: 1) Install Studio 2) Create project with mobile web target 3) Run in browser 4) Select \"run and use the browser selection section Result: Firefox is the only 3rd-party browser listed although I have Chrome, Firefox, and Safari Expected: Firefox not displayed, or all installed browsers displayed Note: The version of the browser is displayed here as part of the name of the browser.. Add \"continuous integration master\" stream to \"Install Specific Titanium. Improve accuracy of Testflight publish progress indicator. Studio: Local variables do not appear in content assist. h2. Description Developers need to be able to leverage the Android x86 emulator that was made available with Android SDK r17. It claims to have performance increases beyond the standard emulator making for a better development experience. h2. Proposed Solution(s) It would be good if you could specify by default whether you want to use the x86 or standard emulator for all projects, perhaps in . It should be the standard emulator by default as the x86 emulator currently does not include the Google APIs (which would prevent the KitchenSink from running) and it does not support V8, as detailed in the linked ticket. Also, it should be configurable on a per-project basis as well, for the same reasons I listed in the above paragraph. So: We need to upgrade our AVI detection to show the available ABIs per device For devices with multiple ABIs we need to allow the user to select which one to use as part of the launch configuration, and that is passed as the first argument to the SDK for SDKs For < we only pass the device argument We could add a preference in Titanium Preferences to default to x86 or standard emulator (were available). This would se the default ABI selection in the launch configuration.. Titanium Studio: Multiline Search: add \"Select All\" command to select all to search and replace boxes. When clicking on text in the search or replace boxes, it is difficult to select all the text. Steps to Reproduce: 1. Open studio, create a new project, open the file. 2. Open search bar (command + f on osx). 3. Copy paste a larger block of code in the search box. 4. Attempt to use the \"Select All\" command to select all the text Expected Result: All text in the box highlights. Actual Result: Select all doesn't work.. h4. Problem Description I published an App to the App Store and Google Play but the app never appeared on \"My Apps\". The original guid was: Because I noticed new projects showed up on \"My Apps\" I've created a new project and transplanted the guid to the of my app. Released it to the Play Store and this enabled the app to show on \"My Apps\" where it says \"122 analytics events were processed for this application since May 1, 2012\" but it still shows 0 users, 0 sessions and \"There were no events logged during between 5 7 and The new guid is: I wrote more about this in but haven't received any feedback. Can you take a look?. Currently, the default studio workspace is Titanium Studio Workspace. Because the workspace contains spaces, Android modules cannot be packaged. One suggestion is to change the default workspace to one without spaces to facilitate module development. As per discussion, it was suggested to use:. Android modules created from command line cannot be packaged in studio. There is no package option in the UI. Note: Android modules created in studio, and iPhone modules created from the command line, work as expected. Steps to Reproduce: 1. Create an android module from the command line. 2. Import the module into studio. 3. Attempt to package the module box icon Package Android Module). Expected Result: Package option should be available. Actual Result: Package option is not available. h3. Suggested solution When importing an existing Titanium project, check for the existence of a file, and set the appropriately.. With support for JavaScript (commonJS and MobileWeb) modules being added, we now need the ability to display and select javascript modules in the TiStudio Modules panel. Show the modules In the popup to select per-platform versions, for commonjs modules, only show a single drop down for selecting a version which will apply across all platforms.. Add ability to log out of Jira account for \"Submit a ticket\". This assumes a project you have not yet created a local repo for Right click on a project Team Create on Name of repo Description of repo Organization you wish to publish to Public Private radio button See for information on publishing a new repo We should be proactive about seeing if we can test if a user has rights to create a repo within an organization, and if they have rights to make a repo private so we can alert them before the creation process.. Right click on a project Team Share GitHub Name of repo Description of repo Public Private radio button See for information on publishing a new repo If we allow a user to clone from organizations, we should also allow them to push to organizations. In that case, there is a slightly modified flow where we would need them to pick an organization first, and then we make a different call if pushing to an org.. I would like to be able to log in to my Github account and save my account information, possibly in our new \"Accounts\" preference page. Store: Password Additional buttons links: Sign up (to sign up for Github, which directs to the website). Add a UI to manage Keystore certificates. Similar to other platforms, support the creation of BlackBerry modules. We don't yet know exactly the steps involved.. The new Blackberry simulator utilizes a VMWare appliance. We'll need to launch against that. Improvements: Add IP address override to launch configuration (see TISTUD-1597 for root IP specification) Add password override to launch configuration (see TISTUD-1597 as well) Steps to use the integration: Launch VMWare Device Find out IP of device. User enters this in the main preference page, or in the launch configuration Run launch script, passing in IP address, password as arguments: required optional, for devices. Add a dashboard controller when given the URL to a module .zip file, installs the module to the SDK location on disk. If for a specific project, update the file (equivalent to what we do now when packaging a module for local distribution). Fail Titanium Studio build if plugin is missing rubles. In TiStudio open the file of an app with the GA, and click 'Enable'. An app is created in the cloud services. Click it again and another app is Suggested fix: Check to see if the file is dirty. If yes, alert the user that enabling cloud services will save the file. They can then choose to proceed, or click cancel. Enable cloud services. Save the file.. Using the dashboard search bar or the top ad link (\"Reach Million Appcelerator Developers\") launches in a generic browser with no controls, providing difficult navigation. To address this, we'll need to switch the code that launches the browser in this case to be the same as the other cases on the dashboard (all other links open an external browser, and that appears to work correctly). it's a matter of triggering a portal action instead of using target \" new\" as part of the href.. Fail Jenkins build if Studio contains JDT plugins. Trailing semicolon after curly brace in conditional causes error in JS formatting. Steps to reproduce: 1. Create a new .js file in a project 2. Copy the following code and paste it into the .js file 3. Press on mac to format the pasted code Actual result: The following error is generated in the log file: !ENTRY 4 0 !MESSAGE (Build Error while formatting the code in your editor. Please submit a bug report through Studio's support and include the relevant code which triggered this error. Expected result: The code is formatted correctly. It appears to be that last trailing semicolon. Delete that, and it works.. If the current set of release notes is from a full HTML page that does not contain a , the release noes will launch in a new browser window. Allow for override of as a command-line option to make testing this easier. First try to grab apidiv. Then try to grab interior of body node, or if no body node, then whole content. If either work then replace release notes template with new content. If all else fails, use whole content and don't use the template. Notes: Anchor links didn't appear to work (might need to be munged?). After first loading Titanium Studio the template HTML Expected results: Should see a list of all available templates for HTML files. Actual results: Only a strange entry and the HTML 5 template appear.. When creating an application in ACS, we need to pass the GUID along with the call. The format will be: ti guid , passed to the call.. Use built-in ANT when packaging Android modules. Created a new Android mobile module project Attempt to package the project Run into this error: snippet of code: final Process osProcess It appears it can't find ANT. We package ANT as part of Studio, so we should instead use the built-in ANT rather than calling it on the command line. Workaround: Right-click on Click (the first option). When using the Android NDK, if you have spaces in your path Studio Workspace), Studio will fail to be able to build an Android module project. Suggest putting up a warning when creating a mobile module project warning users about the issue and informing them how to solve it (direct them to the wiki page on how to move switch their workspace:. Replace with accordion. Initially open a section to configure TISTUD-1456 perspective ** See APSTUD-4798 and APSTUD-4799 for actions to call The bottom half of the accordion is similar to what we have currently If we reduce or remove the top toolbar, we may wish to surface some common initial configuration options to the first tab of the equivalent to an initial questionnaire. It could be perhaps in some normally \"hidden\" area for \"advanced configuration\" if we determine it's useful but is confusing on first run.. An exercise in simplifying the new user experience: Create new \"Studio\" perspective add keyboard shortcuts commands for \"occurrences\", \"block selection\", \"show whitespace characters\" remove outline view remove servers, problems, terminal, console view ** keep console view hidden unless an error comes up. Studio: Build Participation: Windows does not update content assist for new class methods in Javascript. Packaging of Android module fails to copy built module to destination. When creating a mobile module project, we should be more strict about the name validation and the module-id validation. module-id should follow the Java conventions for package names (just like we do with Android).. When packaging to a non-existent directory, an error is presented and the user cannot package. Steps to Reproduce: 1. Create a new project. 2. Package for mobile web. 3. Create a path using a new sub-directory hand-typed. Expected Result: Should be able to package app and new directory is created. Actual Result: Warning prevents app from packaging. Suggested solution: Don't show warning * Pop up error if issue creating dir. Remove option to launch Mobile Web Preview in internal browser. The studio internal browser may not fire touch events to mobile web apps. Steps to Reproduce: 1. Create default app. 2. Preview in internal browser. 3. Click on buttons. Expected Result: The app should respond to click events. Actual Result: No response. Works on the other external browsers. It apparently sometimes works on some machines and not on others. Based on feedback, it appears there is some conflict between Mobile Web and the internal browser. Thus, the best option is to remove the ability to use the internal browser.. We'd like to make it easier for users to extend and contribute to the Titanium Desktop (TIDe) project. Refactor the current Titanium Desktop plugin(s) into a new repo We can remove references in the plugin, since the update process will likely be much different in the future Do we need to create the concept of a Titanium type desktop, mobile, ?) that would contribute a few things into the system Add a feature enabling users to install the plugin separately on top of Studio Create a hudson build to build this plugin and push it to a deployment site Change the license of the plugin to Apache 2 See attached image for dependencies.. Create a new Android Mobile Module project It should create the project, but have the warning \"Unbound classpath container: 'Default System Library' in project 'testAndroid'\" Attempting to fix that, it seems you should edit your Installed JREs preference page. However, the Standalone version of Studio doesn't have it, unlike the version of Eclipse (see screenshots). Attempting to install the JDT tools via the notes on this page (though substituting Indigo as a version) does not appear to work as you get conflicting dependency errors. It seems we either need to remove the JDT items, or we're not fully shipping the full set. Suggested fixes: Remove the django templates from Pydev, and allow users to install them optionally.. Auto-configure browser list to contain all installed browsers. Description: While attempting to set a browser before running a mobile web preview, I noticed that the list of browsers did not include any specific browsers except firefox. It would be ideal to populate the list of installed browsers rather than have the user populate the list manually. Steps to reproduce: 1) Install Studio 2) Create project with mobile web target 3) Run in browser 4) Select \"run and use the browser selection section Result: Firefox is the only 3rd-party browser listed although I have Chrome, Firefox, and Safari Expected: Firefox not displayed, or all installed browsers displayed. Add ability to read packaged rubles from the Titanium SDK directory. Add platform attribute to module element(s). Clicking \"Publish\" multiple times when package application for distribution on Mobile Web results in an error. Summary: When an application is selected to be packaged for distribution on Mobile Web, an error is shown Steps to Reproduce: 1. Create a new project 2. Click on the Publish button and select the option for Package Mobile Web 3. In the pop up window, select the third option for Create a new project for the new mobile web app 4. Put in a project name and click on Publish (do it at least 2x quickly) A packaging error is shown with the message \"Failed to package project\". Unable to preview mobile web application when launching preview of page. Steps to reproduce: 1. Create a Single Window project from template wizard 2. file URL, and evidently it does not work that way. It is probably easier to extendd Studio than to fix this behavior in Mobile Web. Suggested fix: * When creating a new project as part of the mobile web packaging wizard, create a new default server for use in preview and associate it with that project.. Unable to locate module when launching Mobile Web application. Summary: When a single window template application is selected to be run on Mobile Web Preview on Browser and Mobile Web Preview on Emulator, an error is shown Steps to Reproduce: 1. Create a new app, with template as Single Windows 2. Click on the run button and select the option for Mobile Web Preview on Browser or Mobile Web Preview on Emulator An error is shown Unable to generate Mobile Web App. Error: Titanium Mobile Web Compiler Compiling Mobile Web project \"SingleWindow\" Copying Copying Studio 3 Copying Studio 3 Copying Scanning project for Searching for all required Locating Ti+ Unable to find Ti+ module It appears that the is being left off the module definition, which then causes this issue.. Kevin, thoughts?. When RSS Reader or Geocoder are installed from the pane, deleted (without filesystem removal), and reimported into studio, the projects import with a different project name: and instead of Geocoder and RSS Reader. If the user attempts to reinstall the sample from the pane, there will be a fatal git dialog box and the project will disappear from the filesystem. Steps to Reproduce: 1. Install RSS Reader or Geocoder from the samples pane or dashboard links. 2. Delete project from workspace without removing it from the filesystem. 3. Re-import project back into studio from workspace. Expected Result: Project should have same name as before. Actual Result: Project has different name. 4. Install the project again from the samples pane or dashboard links. 5. Press ok, accept the install. Expected Result: Project should be overwritten and a new version of the sample should take its place. Actual Result: Git warning dialog, followed by automatic deletion of project from the OS.. Studio: Kitchen Sink Nook not available in samples. iPhone modules are displayed as not supported when the Titanium SDK version is set to version or newer. This appears to be due to the fact that the manifest file for iPhone modules currently do not include the 'apiversion: 2' entry. The 'apiversion' entry was added for Android modules in Titanium SDK version to indicate that the internal module API had changed. This change only impacted Android modules and it should be checked for Android modules because older versions of Android modules will not work with Titanium SDK version or newer (and vice-versa). This is not the case for iPhone modules (currently). The check for the 'apiversion' tag should ONLY be done for Android modules. It should be ignored for iPhone modules. To test: Create a new Titanium Mobile project Open up and add a module to the project using the modules panel (I used Note the module appears active Edit the module manifest file to raise the apiversion to something like \"3\" in the iOS and Android (current maximum version is 2 for Save and restart Studio. Note that the module now appears greyed out, but should be available for iOS. Steps to reproduce: Create a new Titanium Mobile project Put a breakpoint on one of the \"var\" declarations in Launch the iOS simulator When debugging stops on the breakpoint, note the error as shown in the screenshot. Application \"null\" has been packaged message when starting a server. The command in Studio needs to call out to when cleaning iOS targets in order to ensure that stale information is removed. The exact command that needs to be performed is: We need to call this before deleting the iPhone folder. This bug is the Studio version of TIMOB-8025. Please get cbarber to test and resolve that ticket when complete.. Trying to open the from an FTP server returns this error: This caused the attached logfile to be generated in the Titanium log. Steps to reproduce: 1. Create a Titainum Mobile project. 2. Upload the Mobile project to an FTP server. 3. Attempt to open the Actual result: An editor opens showing the above error. Expected result: You should be able to open the but it will be treated as an \"external\" so some editing options are disabled.. Remove as Android SDKs requirement for Android development. Description: On one of our newer installations of Studio, the Android SDK is properly configured to support SDKs. The Dashboard configuration page shows an incorrectly configured Android SDK. In comparing the listed text to the actual configuration: We were missing the SDK. The result is that imported samples could be run as expected in the emulator, but no project could have the deployment target set during creation of afterward. The tooltip text lists similar requirements, see attached image. Steps to reproduce: 1) Configure a system with ANY supported SDK Android SDK (Android - 2) Launch Studio, add the Android SDK path in the studio preferences 3) On the dashboard, check the configuration utility's report on the usability of the Android SDK Result: If you don't have both and SDKs, the configuration is determined to be incorrect Expected: Only is installed (and required) by default. Add Titanium platform support info in CA for Titanium namespaces. Currently, we warn users about not installing Xcode Once that support is in, we'll need to remove that warning: new text: We also need to update the sdk info links for the Xcode download to. Please try running the same command Titanium Studio does on the command line: Do you get the same result?. Change Studio to reference new platform -clean option. Once TIMOB-7652 is complete, we'll need to switch to using that mechanism over the current one. Note, this only will work on SDKs above so if the SDK is less than that version, we need to use the old system for now.. Our current JS CA implementation queries the index file for the entire project. This means that we show content assist for all JS files in a project when bringing up CA in a JS file. We now detect \"require\" invocations and store the required module name in the index. We also have the ability to filter index query results by a list of documents. Using these two items together, we should be able to filter JS CA by required files only. Note, that we may not want this as a default behavior for web projects. So, for the time being, we should implement this for the TiMobile nature only.. Using the sample snippets in the Epic containing this ticket, we will need to create documentation that shows that code being scriptdoc'ed for use as a module. We need to update the wiki pages here: *. Suggest we may wish to keep \"Edit Profile\" available ( as that is the third link currently available of and also currently present on the dashboard.. The available packages in will change names and pricing of those will be on a per-app basis. Hence a paid subscriber might have more than one package, so we can no longer display the user's plan level on the dashboard. Instead we should just display the following: a link labeled \"My Account\" pointing to the user's account. Titanium MobileWeb when previewed against an internal browser shows empty content. The current iOS dashboard configuration screen is a confusing regarding min max versions of SDKs. So lets display which iOS versions are compatible with this and below that have a link that points to here : Regarding the actual text, here is a proposal: An iOS SDK is missing. Titanium supports the following range of iOS versions: Min iOS version: Max iOS version: Algorithm to calculate this: if inclusive ' ', leave the versions as is. if exclusive '(', subtract .1 from the last position, and add .X to the end, (We can ignore the exclusive lower bound case at the moment: unlikely we'll need it) Button ('install or update iOS SDK\") Note: If you intend to develop mobile applications using an earlier version of the Titanium Mobile SDK , please consult the Titanium Compatibility Matrix. (this is the link shown above). Description: Currently the configuration utility performs a check of iOS platforms to see if is available. From what I've been told this is non-exclusive, meaning would be shown to satisfy this check, but with coming out, the upper bound needs to be corrected. 1) Evaluate the logic here: 2) Note the iOS platform check as including and < Result: Only iOS SDKs would meet with success Expected: Logic evaluates based on target supported iOS SDKs. Add a new platform to the dashboard (add an icon with and without a questionmark) Mobile web will show a question mark on first launch, or first time it appears Clicking on the question mark will show the information in the following panels (based on There will be a link which opens Preferences General Web Browser, and another link which opens Mobile Web previewing works best in modern HTML 5-compliant browsers. We recommend you configure your Studio browsers before working on mobile web projects: 1) Click to open browser preferences. 2) Add one or more entries for . Alternately, if your default system browser meets one these requirements, you can leave the preference alone. 3) Save and close the preference. Text to replace for OS X: Safari 5+, Chrome 10+, or Firefox 10+ Linux: Chrome 10+ or Firefox 10+. At the top of the \"Register Existing\" and right below the \"Publish\" screen dropdown, add the following text: \"TestFlight allows developers to publish beta builds of applications to a group of users organized into a This might need to be contributed as part of an extension point or interface.. Create test plan for module additions. It appears Xcode has changed the location of developer tools. In particularly, it's packaged as a single application, with the platforms and command-line tools installed underneath. Homebrew has a function that finds the proper path prefix: no longer seems to be installed by default, so note that we have to have a fallback here Else check if Developer exists. If so, use that. Else ask spotlight where Xcode is (mdfind if that succeeds, append to that location. Type names missing from JavaScript hover. We moved the SDK check to for demo purposes. Revert this back to by Titanium Studio GA. Add \"release notes\" overview to Titanium SDK update dialogs. As in Studio we previously prompted for user updates with a custom dialog box containing a browser pointing to a remote URL containing the latest set of release notes, similar to this: but formatted differently. I've attached a screenshot of how 1Password does it, which seems fine. Ideally, this dialog would follow clicking on the yellow toast (though note the case where we had both a SDK and a Studio simultaneous update should handle that gracefully) The SDK and Studio dialogs will be identical, save the URL in the middle. However, we only do the SDK update dialog right now, as we completely control that process.. We can fix the issue, but it seems that the command-line SDK should have an option to clean. Added linked ticket for that idea.. Below is a several simple examples of a CommonJS Module. Add XSD-based Validation for and editors. CSS \"Add Color\" Command places the caret before, not after the inserted color. Please see capture at : Upon invoking the CSS Add Color command, the editor places the caret after the new color code. Steps to Replicate : 1) Open Titanium Studio 2) Open a CSS file 3) Select Color CSS Add Color Actual Results : The caret precedes the new color. Expected Results : The caret should be after the new color.. Error in log file: \"Was unable to add folding position\". JavaScript validation continues to report a syntax error, even after error is corrected. With the introduction of the Snippets View ( we need update the existing snippets to add more context and improve This is accomplished by adding the following fields to Snippets ( category: A name of a category used to group the snippet with other similar snippets. Optional tags: keywords that describe the snippet. Used as means to easily filter snippets. Optional Example: In addition is the entry that defines a grouping for snippets: These additions will make working with snippets much easier for user via the Snippets view The changes are also outlined here (towards the bottom):. 1. Import KS from Samples 2. Compile to device 3. Without cleaning compile to iphone simulator We semi-solved this with TISTUD-697, but we missed a case.. Currently there isn't an way to delete an OpenShift app from within Studio once it is created, and if user runs into issues with creating a new app, exceeding the limit for the number of apps per namespace or trying to create one with one that already exists, and would need to delete an app, they would have to go back to command line with gem to resolve it. Perhaps add a command (using Rubles) for OpenShift to delete an app (by typing in the app name). JSON outline does not update if there is an error in the code. Please see capture at The JSON Outline does not clear if you replace all current content by pasting in syntactically erroneous content. Steps to Replicate : 1) Open Aptana Studio 2) Open JSON file 3) Add content that will register in the Outline 4) Select the entire file and paste in syntactically erroneous content Actual Results : The Outline freezes in its initial state. Expected Results : The Outline should clear when this happens. Proposed solution: Display a message (similar to a status message) inside the outline view with the message \"The outline view is due to syntax errors in the document\". suggestion is that the message is noticeable, but not obtrusive, as it may appear during normal editing.. Allow snippets to be scoped by project type. Have this code in a JS file: The result of this CA is: In this case, the Titanium Mobile ruble is contributing a snippet which does not apply inside a regular JS project. Suggest is we have some way to allow snippets to be scoped based on project natures titanium mobile), or perhaps a more generic mechanism jquery snippets enabled in a \"jquery\" project, where there is no corresponding nature) Suggestion is to add a meta scope of:. Titanium Studio: Improved error reporting in preferences window for invalid Android SDK. Create test plan for Snippets view. This involves taking the current built participant reviewing the test plans and unit tests, and performing the tests. Current wiki: Suggested approach: Review the unit tests. See if they exercise the functionality. Run them through Emma to check for code coverage All tests are marked as full. The point of a test plan is to break functionality into smoke, acceptance and full levels of test. If the tester can't figure out these coverage levels, they need to work with dev to figure it out. An actual description of what \"Build Participant functionality\" is would be helpful if the test plan is going to be run by anyone other than the author. There seems to be multiple features in the test cases Often missing set up steps - For the PHP and Ruby specific test cases, how do we setup our environment to test those test cases? Unclear if it applies to Aptana or Tistudio. Overall, the test cases should be more detailed since the test plan seems to be dealing with different programatic syntax and the test plan needs to clearly define what it is testing. (ignore for now) In the \"Declarations and documentation\" tests, need specific examples for the programatic syntax Document a class, declare a class, declare a function * 1112 - 1115 refer to Aptana Studio. Also the location is Mac-only for the preferences. Unless the testing is Mac only either leave out the menu path or put Linux and Win info too.. Warn before launching in if there are errors in the project. If i type bad javascript and compile, it's not always apparent from the logging what the heck is the issue. We show parse errors in the gutter of the editor and in the problems view. If the project has errors, we pop up a dialog as shown (similar to JDT) warning the user of the error and confirming they wish to continue. There also needs to be a way for the user to reset the preference warning (suggest a single button to reset all checkbox preferences, not one per preference). When developing an Android module, you either need to set the ANDROID NDK environment variable, or set in the of the module Marshall suggested instead that when packaging we call ANT directly (instead of the module build scripts) and pass to the scripts. We can get the preference from TISTUD-952. To test: Create a new Android modules Set the NDK location Package the module. If it succeeds, the test is successful. Incorrect packaging would result in the build failing and prompting a user to specify the NDK path manually.. Force installation of Android NDK if user is doing Android module development. Unsure how to have a conditional install, however, the user does need to have the Android NDK installed before proceeding with building an Android module. Suggest the following: Add the NDK to the file. Locations are available from Download from that website Perhaps install the NDK under the chosen SDK directory, android ndk? Create a Android NDK Home preference in Preferences Titanium Studio Titanium Test for this preference being set when creating an Android module. Update dashboard with new tests Add NDK line in Titanium preferences. We need to restrict the modules selection in the TiApp UI to an API-Level that is enforced on a module. The platform team adds an api-level value into the module's manifest, and will add a into the file of the Titanium SDK. We'll need to read both to find an API level match, and do whatever needs to be done in the UI in order to allow selecting only valid modules, and display warnings when incompatible modules exist in the tiapp. To test: Create a new Titanium Mobile project Open up and add a module to the project using the modules panel (I used Note the module appears active Edit the module manifest file to raise the apiversion to something like \"3\" (current maximum version is 2 for Save and restart Studio. Note that the module now appears still available, but should appear greyed out Note that this change is only relevant to Android. iOS does not care about apiversions. As demonstrated in , for some reason some browsers, in certain circumstances, will not download files with filenames that contain spaces. Please consider renaming the Windows and OSX install packages in to Update to respect the new names. Paul, I'll leave this one to you or Chad to close.. Show error in problems view if a project has an incorrect configuration. Run git clean on build subfolders during project clean. Anytime you do a on a Titanium mobile project, the and directories have any existing files deleted. This is bothersome when those files are the easiest way to ensure that the and paths exist when storing a project on git. If they don't exist, a user attempting to build the project will get an error on their first attempt. It would be ideal if, when a is performed on a project, that any existing files were left untouched in those directories. Running a git clean should restore the project to the state it was check in with.. In order to create a better validation experience for and files suggestion is to create a DTD for them. Note that spans both mobile and desktop applications. I don't know if it's feasible to create a DTD that spans both cases, or if it should be split into two.. Rework info message for 'native' and 'implements' from Mozilla JS validator. In my JavaScript source code when editing in Titanium Studio, if you use the words 'native' and 'implements' as function names, it gives me a warning of a syntax error in the syntax highlighting, but everything compiles and runs fine. This is because those items are future reserved words. We should rework the messages as , and say something like \"Native is a future JavaScript reserved word. Its usage may not be compatible with all JavaScript runtimes\". Currently, when Studio first runs, a \"configuring python interpreters\" dialog comes up. Instead, we should integrate this dialog withe the current dashboard configuration process. It would allow for checking and configuring Python interpreters through the Dashboard configuration actions. Add check for python configuration to current dashboard check * If check fails, add button that pops up the same dialog as shown now. Note that for Aptana Studio, this would require us implementing a similar dashboard as Titanium Studio so that we may perform the same checks there.. Add dashboard support for checking GIT (windows only). Configuring GIT should be allowed on a Windows OS through the installation of Portable GIT. Add check for git configuration to current dashboard check * If check fails, add button that pops up the same dialog as shown now (which ultimately does the installation) Note that for Aptana Studio, this would require us implementing a similar dashboard as Titanium Studio so that we may perform the same checks there.. Description: While evaluating the impact of using git-managed projects in Studio, I encountered a situation where the git project's was missing the deployment targets in the xml view. The targets were checked in the \"overview\" view however. A quit and relaunch of studio then populated the deployment targets in the xml view, and removed the checkmarks in the \"overview\" view. Before studio quit and relaunch: After relaunch: Steps to reproduce: 1) Import KS-iPad from 2) Build from device to populate build folder 3) In terminal, switch branches to master with git checkout -f master 4) Switch back to with \"git checkout 5) Examine Result: The does not have the Expected: overview matches xml detail and deployment targets are selected and \"true\". Change \"Deploy\" tool tip to \"Publish\". For clarity of terminology, please change the tool tip for the \"deploy\" menu to be \"publish\". This better fits with the current usage of that menu and the items inside. Correct references to \"Deploy\" in wiki documentation. We should be opening the file after we generate a mobile module project, as a means of getting users started more easily.. Open file in editor for user after generating mobile module project. When a run debug configuration is created, we need the ability to pass additional command-line arguments to the android emulator. As an example, the -scale argument in order to use skins whose full scale causes them to be larger than the screen you are running on. For example, I am using the Motorola MD860 skin for the Atrix 4G whose screen is 960 pixels high. The resulting emulator window is some 1200 pixels high but my screen is only 900 pixels high. If you run the AVD from the AVD Manager, it offers the option to run with a particular screen size which uses the -scale argument. We need the capability to do this in Studio. I would recommend simply adding an extensible option to specify any additional command line arguments. The standard Eclipse launch configurator allows this on the Target tab but that appears to be disabled in Studio. Please re-add the tab and allow those arguments to be passed to the emulator. Note: This can only be allowed on SDK versions that support the this won't work on but should work on. Add preference for default settings on android run debug configurations (API & Screen size). Request Enable Studio to change the default settings used when it creates an Android Run or Debug Configuration for the first time on a project. Currently, Studio installation creates new Android configurations using API: and Screen: WVGA854. This is an inconvenient that emulator screen size is too big for laptop screens, taking up over half the display, so this change the default to something smaller. Also be able to control which API is used by default. info To customize device resolution density from command line: emulator -avd HVGA800 -scale 96dpi 160 Further info can be found here as well: Suggest creating a child page of the titanium preference page to hold that information and allow the user to set it.. Allow for the creation of mobile module projects. This is an umbrella ticket to be split into smaller tasks. iOS Steps: We need the following: New Titanium Module wizard (allowing user to choose iOS Android or both) Import an existing module project During wizard, ask user if they wish to create a shell test project to act as a test harness for testing the module to compile the module and deploy it (this would mean deploying it to the root titanium install directory on disk so that other apps can use it) Ability in other editors to include modules in your project (these could be already installed ones, or ones from your workspace) Create documentation for module (tidocs to JSCA file) Upload finished module project to marketplace. Chromium: Ctrl+W and Ctrl+Shift+W do nothing when focus is on the embedded browser. Add Support for debugging on Android devices (tethered). we have the following issues open for ios and android to add debugging support for device Enhancement request - Add Support for debugging on device once these are addressed studio would need to add UI to support the features. This ticket is only for the Android side of the equation. The task here is to agree on a discovery mechanism with platform. It might be that we pass the IP address Studio is listening on to the device, or we might have the device broadcast and Studio would listen. After that, the rest of the process is identical to the current mechanism. Additional ADB info:. Cannot right-click on a folder in project explorer. Add unit tests for SDKLocator, SDKManager, SDKEntity classes. Allow users to add new platform targets after project creation. Description: While testing studio, it was noted that new deployment targets could not be added to an existing project. For example, a project created for an Android deployment had the iOS targets grayed out. It is possible to manually edit to set targets to true. This enables the \"run on simulator\" for iOS, and in my test was able to launch the project in the simulator. Steps to reproduce: 1) Create a new Titanium Mobile project in Studio 2) Select \"Android\" as the only deployment target 3) When the project is created, open and note that only Android is available to 4) Open the pure xml tab of and set deploy target for iOS to \"true\" Result: Your project can be launched in the simulator, but installed on device will launch then quit and has no icon. Expected: Either no ability to add or remove targets after project creation or the ability to add with the same default structure as during project creation. Suggested solution: Call platform script to initialize new platform. This would (most likely) add another build folder, and copy several resources into a specific location Validate project specifics as per what we would do in the new project wizard * Suggest we don't remove platform the user we can't remove platform support for a project if they try to uncheck a box.. A comment with security level 'Developers' was removed.. h1. Feature Support specifying the \"Abstracted LCD density\" of an Android Virtual Device in the \"Debug Configuration\" in Titanium Studio. Also add the field to the Titanium preference page to support a default value. Right now, only the API, Screen, and Log level can be changed. By adding this additional field, it would be easier for developers to test multiple densities. h2. Associated Helpdesk Ticket. Allow a ruble to contribute the image for a template. Outline window doesn't always show javascript object outlines for self-invoking functions. Running the BlackBerry emulator is similar to running the Android Emulator. The option is launched from the \"play\" menu in App Explorer and Project Explorer, and automatically appears for all projects with BlackBerry as a deploy target, The following options need to exist for the launch configuration: Filter: This filters the amount of log output in the developer window based on the level selected. Info is default, Debug shows more than Info, and Trace shows more than Debug. With Blackberry Debug is normally as low as you need to go, Trace will have a lot of simulator messages that won't be useful in normal circumstances. Clear SDCard: Clear the sdcard on the next simulator launch. If you receive a while launching your app, you should stop the simulator, and click this on the next launch. One the emulator launches, suggest showing a pop-up (which may be dismissed in future runs) that shows the user how to start their app: \"Locate your application in the \"Downloads\" section of the main Blackberry menu. You can do this by hitting the Blackberry key on the simulator, selecting the \"Downloads\" folder, and selecting your. Replace colons in project names with underscore characters. It currently shows Aptana, Inc when hovering over the installer image. Would be 5 points if it is already in correct format.. Update the verified publisher in Windows installer to Appcelerator. Change \"Install Titanium SDK From to \"Install Specific Titanium Add radio button: Install from Update stream: Cascading drop-downs \"release\" stream: (filter on OS) ** \"continuous integration master\" stream: (we may need to work with platform to either a) regularize the format or b) allow for the extension point to apply some regex xpath to the JSON to grab build info). Create new Titanium Studio Splash Screen. There is a placeholder image for now but needs replacement. We can replace the existing size, or use a new different size, but we'll just need to configure a few new options:. Add iframe for Ad Content to screen. Retrieve content for frame from similar location as in TiDev. Assume some static content for offline mode.. Avoid force update if studio doesn't find the required cli information in the file If doesn't have required CLI information, studio is forcing to update everything. Expected: Avoid force update, means, \"remind me later button\" on the update wizard should be enabled. This is the effect of TISTUD-7705. Create Appcelerator studio error reporting strack trace model. Subtask from TISTUD-7697: The wizard suggests that you select the targets here but deselecting doesn't affect the actual listed targets in the It just determines the choices given in the next step. So the wizard should either remove the unselected targets (and populate this list by reading the available targets in the Xcode project) or it might as well skip this step and show the next step right away for all targets. It completely make sense and keep everything in one page, as we hardly have 2 targets.. Eclipse can only send errors, similar to that, we should identify our own error patterns from studio.. Identify the error patterns from Appcelerator Studio. Prototype Error reporting feature with Appcelerator Studio. Update with the new version * URL:. If you run \"npm ls -g appcelerator\" when a pre-release version is installed, \"npm ERR! code 1\" is returned. If you run \"npm ls -g appcelerator\", \"npm ERR! code 1\" is returned. does not occur Steps to reproduce: Actual: No error should be returned when you run .. Installers: Update with the new version. Windows Installer: Installer should install NodeJS on a clean machine. Appcelerator Studio Windows Installer should install NodeJS on a clean machine.. Add prominent display of \"what you like what can be better\" to solicit feedback. Help Studio Submit a Log in Fill out fields Error reported is: \"Field 'versions' cannot be set\". Since the update of studio (and even before the updated XCode 7 had finished downloading - I still had the previous XCode installed), no simulator \"option\" appears in the launch pad area (see graphic below). No amount of reinstalling (done this twice now) is helping. I can confirm that there is indeed a simulator resident at: and then after showing package contents, in: Shows as per the 2nd graphic attached. appc ti info also reports simulators: Help! UPDATE This problem is only apparent on ALLOY projects.. OS X installer should check for and install correct version. Launching creates a new process without killing the previous one. Failed to publish to MobileIron: No message body writer has been found for response class. Marketing needs to swap out the OpenX javascript code on Ti Studio home tab to the following js code:. When testing Studio, it is difficult to tell what build is included in the installers. Viewing you can't tell what version of Appcelerator Studio is included. 3 suggested changes: Output the version of Studio being packaged in the installer build logs When building the installer, create a companion file called That file is uploaded to On add hover text over the installer links to highlight what version is published there (for those who need to know). If you import a Titanium project with ACS enabled, you will be prompted to change or leave the existing keys. But the choice is not clear. Create a project with ACS enabled; need to use Titanium stack (Titanium Studio: CLI: SDK: Note the ACS keys in the Next, in Appc Studio, open Studio dashboard, , and select You will be prompted to replace keys, but the dialog is confusing.. Import: ACS - Improve UI in Prompting Dialog. Once the download of the prerequisites or studio starts there is no way to stop the installation. For the studio, once the installation starts only the back button is enabled which allows the user to go back to the previous steps but no option to cancel installation unless force quit is attempted. So it would be good to have a cancel button to allow the user to terminate download once it has started.. Studio: Mac: Options relating to Windows projects appear in Studio on Mac. Sign OS X application with \"Version 2\" of developer signature. From Apple: Beginning November 1, 2014, apps submitted to the Mac App Store must be signed with signatures created with OS X Mavericks or later (v2 signatures). Apps without v2 signatures will be automatically rejected on upload. If you build code with an older version of OS X, use OS X Mavericks or later to sign your app and create v2 signatures using the codesign tool. Structure your bundle according to the signature evaluation requirements for OS X Mavericks or later. Considerations include: Resources should not be located in directories where the system expects to find signed code. \u0003 *. Description: The test machine is having the installation as mentioned in the environment. Running the iOS application with iPhone Retina (4-inch 64-bit) simulator by setting ti SDK to in gives an error \"invalid device id value\". This is a simulator works with App Studio and Titanium SDK With and ti SDK , the project built successfully and shows the simulator iPhone Retina (4-inch 64-bit) with black screen. The application didn't launch on it and the ution happen 2-3 times. But after that the application get launches successfully on 64bit Retina simulator with CLI. ti build -p ios -T simulator STEPS TO REPRODUCE: 1. Create an application for iOS platform in Studio. 2. Set the Titanium SDK in to and Xcode to at Studio. 3. Run the application on iPhone Retina (4-inch 64-bit) simulator. EXPECTED RESULT: 3. The application should build and launched successfully on iPhone Retina (4-inch 64-bit) Simulator. ACTUAL RESULT: 3. The application does not build and gives the error \"invalid value\". Please refer the attachment for details. With other simulators, its working successfully. The problem is with iPhone Retina (4-inch 64-bit) Simulator only.. BlackBerry: Installing through BlackBerry SDK through Studio does not install Momentics correctly. MobileWeb: Unable to launch mobileweb projects in Android Emulator. Android Modules can not be created in Windows machine. But module can be created using CLI. h5. Steps To Reproduce 1. Launch the studio on windows machine 2. Create an android module h5. Actual Result: Module can not be created. It fails with an error message. Please see the attachment for more info. Studio log is also attached. h5. Expected Result: Module should be created without any issues. Error:. From Weve been running Java 8 with it since 8 was released. Weve heard mention that we need specific versions like 6 or 7 installed by various parties before, but traditionally that was because of Android limitations. There is instead likely a `ti info` bug like TISTUD-6909 but on the iOS side. Somehow the CLI is giving us different JSON values than weve traditionally received Numbers where they used to be strings, objects where they used to be arrays). We couldnt reproduce it locally for 6909, but were able to test and fix based on the users ti info output. In this case, we are guessing we used to get an array and now get an object, but without the output we dont know where. Please run: So we can generate a test case for it, and fix it.. Platform Configuration window shows incorrect version after installation of Android SDK. h5. To reproduce 1. Import an existing Alloy project(in my case it was Alloy) 2. Change Titanium SDK to the latest(?) one and save changes. h5. Actual result Inactive Global Toolbar (screenshot) Note: The user can Run As Run configuration when right click on the project.. iOS: Console logs are not in an order as we instructed in file for iOS Simulators. (!) This is a since Studio dashboard is updated correctly when it is refreshed. h5. Steps To Reproduce 1. Open the studio 2. Delete the 3. Refresh the studio dashboard ( It will not update iOS SDK status) 4. Open Preferences Window 5. Click on iOS platform configuration section (Preferences Studio Platforms iOS ). This will update preferences window 6. Close the Preference window 7. Again Refresh Studio dashboard. h5. Actual Result Studio Dashboard is to reflect the Preferences Window status h5. Expected Result Studio Dashboard should be updated to reflect the same status as in Preferences window Same scenario will occur if we install Xcode on the machine while the studio is opened. h5. Attachments Xcode is deleted but studio is not yet restarted : Studio is restarted Screen Shot at : Xcode is installed but studio is not yet restarted : Studio log file at this scenario h5. Workaround Restart the studio. Then Studio dashboard will be updated.. Studio: Switching default titanium studio theme in the dashboard leaves behind black background in some views. Exception logged in Studio log when projects are cleaned. Error on opening Preferences Studio Platforms iOS. \"Invalid values\". \"Resource Not Found\" Exception when creating a classic project in Studio. Add hyperlink detector to jump from i18n translation keys in Alloy View XML text nodes to their definition in files. We should be able to navigate the user from usage of a translation key string to it's definition in an i18n file. This extends the previous functionality from TISTUD-6692: If you hold down Cmd and hover the mouse over the titleid attribute for first label, or L() macro on second label, They are not turning into hyperlinks.. When a project under the organization: studio, it starts creating the project and then when it is more than half way in creating the necessary folder, it hangs. However, project is successfully created under organization. Steps to reproduce: 1. Go to File New Project 2. Enter Project Name and select organization as 3. Click Finish Actual Result: Starts creating the project and then when it is more than half way in creating the necessary folder, it hangs. When the red square beside the progress bar is clicked it stops but the 'new project wizard' cannot be closed. Studio then becomes unresponsive and it has to be forcefully quit. Expected Result: project must be successfully created.. Clearing invalid proxy login, still does not allow the user to login to the studio and shows a message that the server is unreachable. This is not a regression as it also happens in Appcelerator studio Steps to reproduce: 1. Click proxy set up 2. Enter the following in the proxy setup host: 3. Click ok 4. Enter your credentials and login to studio the proxy settings 6. Login to the studio Actual Result: 4. \"Login server is currently unreachable\" message is displayed 5. \"Login server is currently unreachable\" message is displayed Expected Result: 5. Studio should be able to login The studio is only able to login when it is launched the next time.. Android modules are not recognized as Java projects. Windows: No shortcut added to Windows Start Menu. Studio: Alloy TSS doesn't understand bitwise operator. Add hyperlink detector to jump from i18n translation keys in Alloy View XML attributes to their definition in files. Windows: The installer is not able to install GIT from our URL. Studio: Studio does not recognize the previous Titanium installation directory after upgrading to. Windows: Alloy compiler does not show error details. Appcelerator Studio license link leads to Titanium Studio license agreement. If special characters (',' or for instance) are used in the keytool wizard then the keystore will fail to generate and an error popup will appear. Showing a warning in the wizard if any special characters are used might prevent users from seeing this error. To Reproduce 1. Publish an Android application and use the wizard to generate a new keystore. 2. In the 'Organization name' field, use a special character (Appcelerator, 3. Create the keystore Result Since this is an error with the keytool generator and nothing on Studio's side we should display a warning that specials characters will throw an error. Result Error is thrown with Java exceptions displayed on screen.. Appcelerator Studio: Incorrect message on the progress bar after enabling services. 1. Install the Appcelerator Studio version mentioned in the environment using the installer. 2. After the installation is complete launch Studio. Result: 1. We get an error dialog saying \"java virtual machine can't be found\". Please refer the screenshot for the exact error message. Result: 1. We should not get any error dialog & studio should launch successfully.. Studio can't find Java virtual machine on launch after install on a fresh Windows machine. Ubuntu: Organization text cut off when creating project. Ubuntu: Preferences window title appears as. Generic icon appears for Appcelerator Studio in control panel. Mobile module cannot be installed into a non existing folder. Unable to create new services to any of the Classic Alloy project. Steps to Reproduce: 1. Create new classic project 2. Go to New - service Actual Result: Unable to create service \"There was an error attempting to create a new service Reason: Unable to copy to because the destination directory could not be Expected Result: services should get successfully enabled. Refer to the attached screenshot and console logs for your reference.. Node ACS: Unable to create new service: Destination directory could not be created. I am okay deferring this.. Unable to create project, prompt for titanium login when already logged in studio. Studio installer does not install mandatory Prerequisite. Studio alloy menu shows Class Names for Alloy Components instead of component name. Incorrect Studio version is reported when JIRA ticket is submitted through Studio. JDK installation fails with message \"Wrong Size\". Importing sample apps from Studio Dashboard or from Samples window intermittently gives 'Auto-share exception'. Although the sample gets imported successfully but there is an exception prompt and also log file shows some exception trace. Please observe the attached screen shot and log file for more clarification.. Importing sample apps from Dashboard or Samples gives intermittent 'Auto-share exception'. Debugger Exception: No \"android-10\" or in the Android SDK in the device console log. Steps Followed: 1. Create a Titanium project and debug it on a device. Actual Result: The debug process is completed successfully and the breakpoints are also hit. But the device console logs show some Android dependency error. Note: The same error is observed for profiler also. Also if Android or API level 10 is installed than this error does not occur.. MobileWeb: Package MobileWeb Project wizard shows \"OK\" after selecting location path. AirWatch: Authenticate the given publish target. AirWatch: Create a register publish provider dialog. AirWatch: Add preference page. Trying to open Titanium Studio will fail due to a signing issue. A warning will appear telling the user that the software is unidentified and therefore will not be opened To Reproduce 1. Download the following file: 2. Attempt to run the application +Make sure that your security settings are set to default in system preferences. It should be set to \"App Store and Identified Developers\"+ Result A warning to tell the user the risk of opening the software, or open without a prompt. Result Warning states that the user cannot open the file due to the risk Note. You may have already created an exception for Titanium Studio. you have to revoke it: For example:. 1. Install the latest OpenShift Plugin (you will need to install Ruby and PHP first) from 2. Create a New PHP or Rack project 3. Get error \"Unknow request parameter type integer\" I believe this may be fixed by an update to the OpenShift library:. Default Titanium Studio Theme not selected on first launch. BlackBerry: Missing device IP address option. Windows OS: Incorrect default path is set for Titanium SDK in Studio as well as in CLI. Test Steps: On a clean Windows 8 machine: 1. Install Appcelerator Studio 2. Accept and install all the appcelerator components. 3. Observe the default location for Titanium SDK set in Studio preferences. Actual Result: is set in the default location for Titanium SDK in Studio preferences. But actual installation (appcelerator modules) happens at the location Expected Result: Default location for Titanium SDK should be: Note: CLI also shows the same default SDK location path:. Auto complete does not work in Appcelerator Studio with a brand new project and a brand new workspace. Download the latest version of Studio and install Create a new workspace Create a new project Open the XML or TSS file and try to get Mobile Code Complete suggestions Result: No suggestions or non-titanium suggestions will be made Workaround: Project Clean Clean All Projects. h3. Description If you set break points in your app then run in debug mode then switch to Performance Profiler and then back to debugging, the break points are all turned off and cannot be turned back on. h3. Reproduction Create a simple app Add breakpoints Run the app in Debug mode and confirm they work Run the app in Profile mode Re-run the app in Debug mode Result: Breakpoints are all disabled and cannot be enabled h3. Workaround Restart Studio. Create feature, builder, and Jenkins job for publishing AirWatch integration plugin(s). Studio: Theme resets with every update. h3. Issue While debugging into the new issues reported by the user (TISTUD-5614), I have run into an issue with Studio, that it incorrectly use the obsolete cache to detect iOS simulators and SDKs. Due to this, Studio always displays simulator version such as even though or are available on the machine. h3. Workaround To workaround the issue, delete the files under and then, restart Studio. It should refresh the iOS info and show all the valid simulators.. Android: Default emulator is not created on windows after android tools update to. Profile: iOS - Profile on device hangs with LiveView enabled. This issue was previously scheduled to be worked on in more than one sprint: 'Triage' (on board Triage') Starting from JIRA Agile an issue can only belong to a single future sprint. Read more about this change: This issue is now scheduled for future sprint 'Triage' (on board Triage'). If this is incorrect, please update the issue accordingly. This comment was automatically generated by JIRA. If it is no longer relevant, please feel free to delete it.. Android: Default emulator is not auto created on windows. h3. Steps to Reproduce This should be a subtask to : After Installing the current Beta version of TS (Titanium Studio, build: I was able to see the fix for Auto Code Completion, but it doesn't work 100% :) It is tru that you can now type and get the next LVL of API's but after creating a new object, the Auto Code completion stops working inside the object. So You cant see what properties the object have. Screen 2: Screen 3: h3. Actual Result No Auto Code Completion h3. Expected Result Auto Code Completion. Object property content assist missing inside object declaration. Intellisense Auto Code Completion is not working. h3. Steps to Reproduce I updated my Titanium Studio to and since that day the Intellisense hasn't been working. I just spend another 3 hours trying to find a solution, but now I'm giving up. I've tried to remove TS and reinstall it, but everytime I open it and start to write code the auto completion of TS SDK is not showing any API after the .UI API. So if I type T, then I can see option for API's such as Ti. Titanium. , And If I use Ti. then I can see all API related to Ti, but they are grey and say 'No description available'. If I select then I can't se any API for creating new object. such as createView, and so on. h3. Actual Result No Intellisense Auto Code Completion h3. Expected Result Intellisense Auto Code Completion. Themes: Unable to set theme to 'Dark'. BlackBerry: Authentication failed. Run - Blackberry Device Studio: GA Titanium SDK: GA No matter I change the password in Studio, the password in the command always display as '^ M'(see below) Password and IP for bb10 device are correct, but the Studio said Authentication fails. This work for the previous version of Studio and SDK, but fails in the latest version.. Android: Missing Java SDK. Please make sure Java SDK is on your PATH. Android: Add support for Genymotion emulator. This presumes Genymotion has already been installed. This is for adding any necessary support around the UI to configure and run Genymotion emulators. Running a iPad only app on iPad simulator starts the app in iphone simulator. Packing a Mobile Web project will fail, creating no packaged application and displaying no error. h5. Steps To Reproduce 1. Create a Mobile Web project 2. Package the project h5. Expected Result A packaged project should have been created. h5. Actual Result Nothing happens, with no error messages to display a problem either.. No editor descriptor for id. h3. Steps to Reproduce 1 - Close Studio and save the workspace with tab open 2 - Open studio again TO fix: Close the file and open again. h3. Actual Result Image attachments (No editor descriptor for id h3. Expected Result GUI for. Studio: Global toolbar - no visual feedback on click. Install only Android SDK 4. sdk). Expected : With SDK doesn't have dependency to have installed. It just requires at least one SDK. iOS 7: No logs. Android: Auto-create default Android emulator if none available. Android: Debugging does not work for android. Android: Unable to build for device with error \"Invalid device-id\". Android: module not available for addition to. We are deprecating FastDev in SDK Thus, we should remove the option to launch with FastDev enabled. BlackBerry: update prevents Studio from using BB NDK. h3. Description: BlackBerry has changed the flow of how we can get and install the BB 10 NDK. This prevents Studio users (and in particular, new BB users) from installing and using BB support. h4. Previously: We get the BB 10 NDK from the BB developer website link: provided in the appcelerator docs for BB. Install the NDK manually. Point studio to the NDK folder installed in the above step in preferences. h4. The new flow: When we go to the link to download the NDK, there is no way we can download just the discreet NDK. We instead download the Momentics IDE The Momentics installs the NDK in new locations with different paths than before. Referencing the path inside Studio prompts the user with an error about missing directories with prefix '' h3. Related They also have changed the flow to get the signing keys. Now it is done through Momentics or through the website. In both cases you have to register for blackberry ID & then only can get the signing keys. Studio Building workspace every time I save a file. Tizen: Tizen target greyed out. Description: 1. First make sure you have the tizen sdk installed & have configured tizen sdk in the studio 2. Go to create new app in titanium or appcelerator studio 3. Select the appropriate type of app classic or alloy 4. Notice the tizen deployment target Actual result: 1. The tizen target is greyed out Expected Results: 1. The tizen target should be enabled after its configured in studio prefs. Android: App log messages aren't getting filtered. BlackBerry: Allow BB project creation with spaces and dots in the app name. Right now Studio does not allow us to create an app with space or certain characters in the app name. This issue has been fixed from the sdk side & we can create apps with spaces & in the app name using the CLI.. Set cname does not appear to get called. Debugger: First debug session results in no variables in stack view. Debugger: Android SDK default version is not being saved on Windows. unexpected characters in the console, building the project on Linux and Windows. CLI: New Project: non-existing sdk error message not formatted. This is a could not happen in Studio Test Steps: New Project. project name. Finish. the creation of the project folder, cancel it by clicking on the red square at the bottom. Observe the error. Screenshots and logs attached.. The Alloy templates should be displayed as follows (no beta description): Alloy The tag category and the template should also no longer include the word \"beta\". \"Problem Occured\" build error if project imported using File Import General Existing Folder as New Project Next. Test Steps: Latest studio. an android device. a Titanium Mobile android project with GA SDK . click on the project and select debug debug configuration create a new configuration for android device run. Expected Result: SDK Error is an expected behavior but it should display SDK version or above.. CLI: console build log needs to indicate which Titanium CLI is being called. Titanium Studio: Android Updater prompt which appears at the bottom right hand side of studio displays 'OK' which is unnecessary.. Content Assist: 'Testing' function info popup in is showing all three parameters as (Object, object, object).. Studio: Installation issues with shown even after complete installation of ACS. Content overlay - icon, description etc for Denso turbo brand. Editing and saving while project is indexing hangs Studio. About box shows instead of correct text for non-English versions of Studio. This is not a regression issue. Steps To Reproduce: 1. Download studio installer and upgrade it to 2. Delete plugin files from folder. 3. Go to Help Check for Titanium Updates. From the window install, alloy, CLI and acs updates. Actual: After successful installation of all plugins, File New option does not appear. Expected: File New option must appear.. Deleting plugins from and reinstalling causes project option to disappear from File New menu. \"Failed to install Titanium\" and \"failed to install ACS\" errors are coming during updates installation. Updates: add update stream release notes docs. Alloy: Updates: add Alloy update stream release notes docs. During clean install of Studio, user is bombarded with a number of errors for Alloy and NodeJS. Error in logs when logged off and logged back in studio.. The app icon is an important identifier for a 360 app. Users should be able to update hte app icon via the editor Add a browse button allowing the user to pick a new icon * Restrict the icon to standard app store guidelines.. When Preferences Titanium iOS Configure button is pressed, nothing appears to happen. In reality, the dashboard is opening in the background to the configure page. I would recommend removing the Configure button because it is out of context. h3. Steps to Reproduce: Go to Preferences Titanium iOS and click the Configure button. h3. Actual Result: Dashboard configure opens in the background. From a usability perspective it appears as though nothing happens. h3. Expected Result: Either the button isn't there at all because it doesn't appear to do anything, or it opens a wizard that would normally be opened using the dashboard (if possible). Note that Configure buttons exist for all platforms and perform a similar result, even BlackBerry which does not have a dashboard configure entry. All platform Configure buttons apply to this ticket.. Update Titanium Mobile HTML template with new iPhone 5 splash image. Add validation build participant to highlight deprecated Titanium Mobile code. Once we have the deprecated flag for more JSCA members, we need to validate and warn about deprecated usage on both build and reconcile. Ideally, we can show the items similarly to how they appear in Java (with a and on hovering over the warning, show the description of the item (which will include the deprecation text). Prevent users from using a capital letter in module name or module ID. While creating a new android or mobile web module,if the 'Project name' field contains any capital letter, then it is giving error of the message and studio logs are attached with the bug. Steps to reproduce 1. Create a new titanium mobile module project and select android as deployment target. 2. Give project name - and module id - .Click next and then finish Expected result 2. Android module should get created. Actual result 2. It creates module with many files missing. Gives an error message for the same. Snapshot attached.. Check version strings from the browser settings vs the versions in sdk info and return results. Check the version strings in the name vs the versions in sdk info. The version string is appended to the end of the browser name. Return a similar success value to iosSdk with and. If on Mac or Windows, run the configuration in TISTUD-1414 and TISTUD-1738 if there are no browsers configured (if not, you would notice no browser names have version s attached). Related to TISTUD-1414. As discussed, we need to include the version of the browser in question as part of the browser name (see image for example) Ideally, this value would be dynamic, but that appears to be impossible given the current UI. In the case where the user upgrades the browser later, the suggestion is that when the user re-runs the configuration step to auto-search, we replace the version s of the existing browsers with the newer version. firefox -v. Create build participant to auto-compile embedded ACCS service when changes occur. For an integrated project, where the client and server are the same thing, we need to update the bindings for the embedded service when the service changes Watch for changes in the file If a change happens, re-run the compilation step to update the bindings.. By default, the first item in the first group is selected, and the corresponding description is shown. This should be the \"Alloy blank\" template for Titanium Mobile projects, assuming they have alloy installed. We have a way of defining groups or categories of templates, but there is no user-friendly name for them such that it could be displayed to the user. Add something that would allow us to group templates as shown in the mockup.. Add button to call new action to run project created in above step (APSTUD-4801), greyed out until a project is created, or there is at least one project in the workspace. If the user happened to close and reopen the dashboard, the \"just created\" project might be lost. So, we always run the most recent project based on timestamp.. See for more information.. If on Mac and Windows, the check described in TISTUD-2187 will be run on dashboard open with the other platform configuration options If there are compatible browsers, indicate the user is good to go If there are no compatible browsers, or you are on Linux, indicate the set of required browsers. Add a button to refresh the check (if it failed). Rename the first tab in the Dashboard to \"Get Started\" Update the wiki documentation to reference the new tab name (. ", "contenttype": "application/json", "created": 737603, "id": 35, "language": "en", "user_name": "ingo"}]}