{"contentItems": [{"content": "ios-sim needs to be updated to allow launching WatchKit apps in the simulator.. Module using Google Maps SDK works fine when run with crashes with. When an app is built using or greater it will include a 64 bit slice. If that app is run on an arm64 device (5s, 6, etc), when it requires a module that does not have the arm64 slice, it fails with an exception with message: We need to add a better message to make it clear what architecture the module is not found for.. The modules below have been updated to 64 bit. After they were updated, we decided to add an property to the manifest. For this ticket, we need to go back through and add this property to the manifest. For instructions on adding this property, look at this ticket: TIMOB-18065 h5. Checklist: update the manifest with architectures bump the last number in the version for each module (if it is now, the new version will be Note: modules which have one change log the versions should match on both platforms update the changelog (keep it consistent with logs before it) build the module and add it to github releases once the commit is merged h3. Commonly Used h3. Packaged with the SDK. With the addition of 64-bit support, it becomes helpful to know the architectures available in a compiled module. We can then use this ins tooling to make sure modules are compiled correctly for use. We update the module template manifest file with the following values ( ): Android: architectures: armeabi armeabi-v7a x86 BlackBerry: architectures: arm x86 iOS: architectures: armv7 i386 x86 64 arm64 h6. Modules with architectures in manifest: *. We need to update and re-build the following modules: h3. Commonly Used h3. Packaged with the SDK TIMOB-18089 (Core Motion) TIMOB-18091 (Encrypted Database) Removed from the list since it's android only. iOS Map Module: bump version to add to update. The module which is part of the SDK needs to be updated for the new iPhone 6 and 6+ launch images. I've created a PR that fixes this and is future proof for other subtypes () and scales () as well: To test: 1. Create a project 2. Move the launch images from to 3. Add some text to the iPhone 6 and 6+ images in the new folder 3. Build the project 4. Run on iPhone 6 or 6+ and see it is not showing the i18n images. h4. Problem Description When aborting a file upload the file that was loaded into ram is kept in ram. The ram does not get cleared unless the upload is completed. So every file thats uploaded and aborted is being kept in active ram on the device. If a user uploads a file and aborts the upload multiple times ram usage becomes very high and will cause the app to crash. This did not happen with the ram would get cleared when the upload was aborted. When watching instruments while preforming a upload you can watch ram using spike on each upload but never be released. h4. Steps to reproduce 1. Create new mobile project (classic titanium) 2. Please copy the Attached file to the Resources directory. 3. Paste the Sample Code to ( to test with large upload file that will automatically abort after seconds) :. Need to update the to in h6. changes: TIMODOPEN-423 * TIMODOPEN-432 Also need to update. I have already consumed the change from TIMOB-17662 by setting autorotate to false in and this issue is still present. I initially mentioned this issue in Case 2640 which has been closed so that we can focus on this specific case. I have uploaded an app called and screenshots which illustrate this issue. CASE 1 (landscape window in portrait mode) Launch the app in Landscape mode with the Home button on the right Rotate the app around, notice the UI changes to reflect the orientation correctly. Get it back into landscape mode (Home button on right). Click Launch Camera Click the (X) button and then immediately rotate the tablet to portrait up or portrait down. Notice that the image capture view will close and the app then rotates into landscape orientation. It should rotate to portrait orientation. See screenshot Home On CASE 2 (portrait window in landscape) Kill the app Launch the app in Landscape mode with the Home button on the right Rotate the app around, notice the UI changes to reflect the orientation correctly. Rotate the app to portrait mode (Home button on bottom). Click Launch Camera Click the (X) button and then immediately rotate the tablet to landscape left up or landscape right. Notice that the image capture view will close and the app then rotates into portrait orientation. It should rotate to landscape orientation. See screenshot Home On h5. Issue reproducible with the following code. Change event name from to The current name of the event does not accurately reflect the purpose of the event. Because of this, it needs to be changed to something more meaningful. h5. Test Instructions 1. Run the code below 2. Click and then Allow 3. Click 4. Background the app 5. Swipe down from the top of the device to see the notification center 6. Swipe the notification to the left and click one of the buttons 7. If is displayed in the device log, then the event was fired correctly. you can download the new module here:. Build error if Map module in app build with TiSDK prior to. ListView with a search, where the itemclick event opens a window. This defect works in the tutorial app ( ). The customer is having the same issue in their own app. 1) Wait for the elements list to open 2) Scroll down a bit, half a screen or more. 3) Click on an element (the name, not the symbol) and wait for the new window to open. 4) Close that new window by clicking the \"Done\" button. 5) Scroll back up to the top. Notice there is a white space where the Search was. At this point, it should be noted that the search is still there, it just appears blank. If you click into it, it'll appear as it should. h3. Edit: Simpler test case, copy and paste into. h4. Expected Behavior: Take an horizontal screenShot and attach it to an email and the image attached goes horizontal too, or save the screenshot on the Photo Gallery and save it horizontal too. h4. Actual Behavior: The image saves and attach to the email vertically, even if i create a matrix transformation and rotate this one, if i add to the window the image rotated looks good, but if i save to the photo gallery or attach it to an email, looks vertical again h4. Test Case:. Extracting a module or sdk to the Titanium directory generates errors in Studio, see below. There are a large number of errors and it looks like they are all the same. h4. Steps to repro: 1. Open a project in Studio 2. unzip a module into your Titanium directory 3. notice the error dialog that pops up and the errors in the log.. ", "contenttype": "application/json", "created": 737603, "id": 87, "language": "en", "user_name": "jalter"}]}