{"contentItems": [{"content": "bin nexus-run helper app does not function if installer had unselected service start. Presently we have a lot of bean validation annotations on methods which need to specificy message in order to generating meaningful validation responses, due to java < 8 not exposing the parameter names of methods. We can use paranamer before we require java8 to get the same information: and remove the need for lots of verbose bean validation annotations. So that: Can be simply:. EhCache on unused instance from Shiro session serialization handling. Difficult to find the Nexus software license Nexus 2. Validate repository name. ATM we only invoke in servlet filter. We need to have a means to set this in other context, like scheduled tasks.. The forgot feature of Nexus can cause performance issues against an external realm. We should consider options such as: - optimizing the generic queries that the resource performs for external users - provide a configurable way to disable the feature - consider removing the feature entirely if that is easier - removing the Forgot Username and Forgot Password resource privs from the built in anonymous role. Acceptance Criteria: - Remove Forgot feature from UI (just remove the js code). Enable User Token and the Protect Content feature. When a request is made to a content path with valid credentials that are not Nexus user token credentials, Nexus responds with 401, but no entity explaining why. Problems: - the end user is confused, because they know they have entered technically valid organization credentials. - the Nexus admin is confused because they either have forgotten about or were not the ones who setup the Protect Content feature, or just assume protecting content is a good idea, so leave the box enabled. - the Protect Content feature is valuable, but it is a rather odd special case that affects all realms in Nexus because of the special Token it creates internally, so an administrator is not reminded it may be in play because it is not near where all the other realms are configured - a Nexus admin must enable DEBUG and TRACE logs to see why there was a 401, assuming they can even understand what loggers to enable and what to look for Improvement: Simple continue to respond with 401, but include a simple message body explaining the reasoning - that user token credentials are being enforced in Nexus. In this way a simple test using curl that gets 401 response will help the admin, end user or Sonatype Support in quickly identifying the problem.. A few places still not using Review all usage of API * Pending further investigation fore coreui and proui modules.. NX3 loads outreach iframe with parameters to allow the outreach bundle to template. NX2 should get this. Example in NX3 of the params:. Refine button text for server disconnected dialog. The updates to the POM validation rule are lacking some sanity checks for nulls. INFO jorlina - Closing staging repositories INFO jorlina - STARTED Closing staging repositories: INFO jorlina - Saving model INFO jorlina - Saving model INFO jorlina - Saving model WARN jorlina - Aborted walking on repository (staging: open)\" from path \" \", cause: null null WARN jorlina - Rule 'pom-staging' evaluation unexpectedly failed Aborted walking on repository from path ' '. Caused by: null 28 common frames omitted. master is already updated ( ), should bump this up on and branches to avoid CLM complaining (though its complaining about non-issues). and master have been updated. A comment with security level 'Developers' was removed.. Will need to verify style changes and rebuild baseapp.. Inconsistent use of Name in component search. Missing option to set reset user password from user admin. Analytics field not really timestamp. If a repository is out of service it is still processed by the download indexes scheduled task. It should not be. Interestingly, update indexes task does not have this problem.. Request this URL through a NuGet proxy repository of The outbound request made is this: A 200 response is received with XML describing the artifact, but then no request is made for this: If you then enable \"fetch all versions\" in the \"download nuget feed\" and make the original request again it will work. I'm not sure why this is necessary since the path is the same, and Nexus knows that the artifact exists due to the first request's return value.. Include staging database details into support-zip. With the move to nosql db for staging, we have lost the ability to include the in support-zip.. Nexus has 2 LDAP plugins one for OSS and one for PRO. We should remove the OSS plugin and move the PRO plugin to OSS. Including all of the tests, etc. Can probably leave the packagenames asis, unless we feel its better to rename those to at this time? This will also include opensourcing the SSL plugin.. Fire up Nexus and retrieve this URL: This works. Now try the same with Nexus This will fail, the artifact is rejected by file content validation. I'm not sure why, the magic number is correct, and various zip programs I tried (including jar) unpack it without complaint. jvm 1 INFO admin - Proxied item evaluated as INVALID during content validation sourceUrl. On RSO: Cause: Why is this an ERROR log? Is this a problem that needs to be fixed?. Error logging: M2Repository - Got. Print warning in log if high-strength JCE is not installed. Upgrade to siesta (based on JAX-RS w RESTEasy). update httpclient dependencies in and. As said in summary. When first scheduled, we had an oom exception. So we increased the max memory to 1 GiB. After that we had no more oom issues. The task ran for 147h 43m 57s and finished successfully. During this time he cleaned up 8270 releases (as derived from the log entries \"Recreating Maven2 metadata in repository ID 'releases' from Disk space went from 134GiB down to 75GiB. While it was successfull I think this is incredibly slow. The fix might be similar to the one from issue NEXUS-4640.. Remove deprecated classes and api. Way too often customer log files contain entries like the one below, and it turns out the contained exceptions were logged at DEBUG. So there's a failure, and no way to know what happened. We should log at least some of the stack traces from the contained exceptions. Maybe up to a limit of 10 or something? WARN n0158588 - Scheduled task (Optimize a repository) failed :: Optimizing repository Hosting index. (started runtime Exception(s) happened during at Caused by: Multiple exceptions happened, please see prior log messages for details. 15 common frames omitted WARN n0158588 - Exception in call method of scheduled task Optimize a repository Exception(s) happened during at Caused by: Multiple exceptions happened, please see prior log messages for details. 15 common frames omitted. CLM configuration should be replaced with a capability. Advantages: drop code for reading xml Disadvantages: book updates?. This has been an in Nexus PRO, and we are trying to remove the concept. There are much better choices for managing users (jira for example) and IIUC there are no significant users of this plugin. This plugin needs to go away.. Add order column so that sorting can be restored to default order. Remove use of Plexus components in Nexus. Make easy to implement a capability. Multi selection lists field type. WARN - - Could not get null at. Concurrent modification exception in procurement. Information Panels vanish from UI when clicking on SNAPSHOT with classifier. When an exception is thrown inside nexus, there is usually duplicate or even triplicate logging of it's stack trace. Usually logged at source, logged by jetty, and thirdly logged by problem reporter. Can this be reduced safely? If you are looking for examples, see the log files inside this tar file: On Wed, Jan 4, 2012 at PM, Jason Dillon wrote: When something bad happens, looks like NX is logging the exception why? Once here: jvm 1 ERROR - Detected Error in Nexus and another here: jvm 1 ERROR - Unhandled exception or error intercepted. Cancel of capability behaves oddly if selected more than one capability to view. Do not propagate undefined factory for a capability back to UI. There are two tweaks to the solaris scripts that are included with the build that would prevent errors when running the script as a different user. 1. change the nexus scripts they are under: by changing the following line: this does not work in solaris since it does not recognize the '-m' switch. The script runs fine if the '-m' switch is removed 2. Change the SMF script It is found under: The way is is now, if the smf script is set to run as a user other than root, it will fail. change: to. ", "contenttype": "application/json", "created": 737603, "id": 69, "language": "en", "user_name": "jdillon"}]}