{"contentItems": [{"content": "I noticed a bunch of warns like this when testing docker It appeared there was one for every layer I pulled that wasn't in the repository when I pulled from a docker group. For reference, some images can have 5-7+ layers. Pulling from proxy generated no such warn. There was no warn for layers that already existed so hypothetically this would be a diminishing concern over time (tho you could be utilizing new layers everyday, not sure how it works in practice). This seems excessive to do on the WARN level when there is no (as far as I can tell) adverse behavior. Filing for triage discussion. I did not check older NX3 or older docker at this time.. noted that he was seeing messages like: WARN *SYSTEM - Could not locate scanner descriptor\" This message was listed in NEXUS-8239 ( 5) but I believe at the time got mixed in with the actual 5 report (the double message) and I overlooked making a cleanup ticket against it. This occurs when you run the RHC tasks against a repository. Possible quick fix might be to add an empty properties file but code check would need to be done.. I noticed after uploading a license, that the license area shows \"This field is required\". This statement is not there before uploading. See attached. I am not totally convinced we need validation at all with the way our licensing is currently setup, but if we do have it I think the order of value is: 1) Show it when 2) Show it always 3) Show it after success License uploading has been broken for a while so not bothering to back check older NX3 as I'd need to check back before it was even broken (pre-official releases). I did not check NX2 at this time.. Noticed that when using a context path in Nexus when you put that path into your .bowerrc the resultant interactions error with errors like below. Only workaround seems to be not to use a context path. I am not sure how critical context path is for people so leaving major for now. On sudo bower install jquery bower not-cached nexus+ bower resolve nexus+ bower error (HTTP 404) Stack trace: Error: (HTTP 404) Request. at Console trace: Error Logger. rejected System info: Bower version: Node version: OS: Darwin x64 Setup was with a single bower group containing a bower proxy and context path nexus . Bower is new to so no backcheck (or NX2 check) can be done.. First time starting nexus via docker has karaf log warn. Starting nexus for the first time via docker generates the below warn. No adverse behavior is noted so far but keeping for record and to avoid log spam. WARN - Can't update cfg file (Permission denied) at Method) at WARN - Can't update cfg file (Permission denied) at Method) at WARN - Can't update cfg file (Permission denied) at Method) at WARN - Can't update cfg file (Permission denied) at Method) at WARN - Can't update cfg file (Permission denied) at Method) at WARN - Can't update cfg file (Permission denied) at Method) at This file is new to Did not check NX2 at this time.. I found I cannot generate a file from the UI including everything checked in Windows. This does not occur in MacOSX. I checked with who was also able to see this, so not just my env. See below for long stack trace with several errors. On screen appears \"Cannot get property 'file' on null object\". This does not affect m7. I did not check NX2 at this time. Debug was off during this test.. I noticed that if you attempt to enter a value into \"Connection field within the \"HTTP request settings\" section of a proxy repository configuration you get an error \"Failed to Validate Facets, 1 Failure\" and the below in the This occurs with debug on or off. I did not check older NX3 at this time. This does not occur in ERROR admin - Failed to validate facet: Can not instantiate value of type from Floating-point number no method at (through reference chain: Source) Method) at 102 common frames omitted. Error on LDAP Realm activeness; can stop LDAP logins. I created a new raw hosted repository and then created a new role with read and edit repository view privileges to that new repository. Then I created a new user and gave it that new role. I noticed that I was able to add a file to that raw repository despite not having add privilege. As far as I know, add is not contained in edit and this seems a bug. I did not back check older NX3 or NX2 at this time. NX2 did use CRUD rather than BREAD which is testable however not sure the comparison is worth it unless to regression check.. I just noticed that if you're attempting to edit a docker repository, the port has validation over it that says \"Port is already in use\" and thus the saves cannot happen. Really annoying workaround is to delete the repo and recreate it. I doubt that will fly in a production env. Less (but still) annoying workaround is to change the port 1 number and make your changes then edit it back up and save again. I did not check older NX3 at this time but I suspect this is regression caused by a too tight NEXUS-9572. No docker in NX2 so no test needed there. Debug was off during this test. From WARN admin - Validation failed; 1 constraints violated: 1) Port is already in use, type: class property: value:. While testing the rebranded NX3 UI, various team members noticed that in some browser OS permutations, the header image was cached leaving the old N image and no version (see attached). If dev believes this should be 2 different tickets (or wants me to make subtasks) let me know. This did not happen in all browser OS permutations. You can force this to happen by clearing browser cache, loading a pre-rebrand version of Nexus to get the N image there and then loading the new version of Nexus. See attached let me know if unclear. As far as I can tell this does not affect the 404 page or the describe page which I think are templated slightly differnetly, so that may help. It may affect them and I did not have them cached am not 100% certain of that and have not double checked.. running rebuild npm hosted metadata scheduled task can change repository value. Some fields allow adding but not removal via keyboard. I noticed recently, that on fields which are for numbers that have arrows to increase or decrease, that you can add numbers to them via keyboard but you cannot remove them via delete. So, in attached screen (for example) I can make timeout equal to 2 by typing 2 into the field. I can subsequently make it 20 by adding a 0. But I cannot make it 2 again by deleting the 0. If you do this, nothing happens. Workaround is to use the arrow keys which can be annoying to impossible with bigger numbers (like docker port). You can now also workaround using provisional scripting. ADDENDUM: It was noticed while this was in progress you can also workaround this issue by highlighting the number and overwriting it. I checked m6 and this does not occur there so I believe recent regression. I did not check m7 or older NX3 at this time. I also did not check NX2 at this time. Debug was off during this test.. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. noticed in NX3 when you search for an unknown component it returns our 404 html rather than the handled error. Example of current: Example of expected: After checks with and , he asked me to file if I saw the same (which I do). I did not back check older versions of NX3, but I recall seeing this for a while and just assumed it was as it was supposed to be. Might be we deployed this way. I did not check NX2 at this time.. A comment with security level 'Developers' was removed.. resource does not check drop privilege. A comment with security level 'Developers' was removed.. Noticed that in Gnarly the \"Verify user mapping\" results from LDAP show results however, there's no modal title, columns or close button and the results are half off the screen and unscrollable to. You can however close the modal with the escape key as a workaround (though there's no workaround I see to seeing the full results or sorting). This behavior is specific to Gnarly as it works correctly in m6. I've included screens of both. noted this was this way when he started work on NEXUS-9370. There were a couple LDAP fixes in Gnarly however none I saw believe specific to this button modal. Debug was off during this test. I cleared my browser cache before each attempt to be sure nothing odd was caching.. Looking at a support issue I attempted UNKNOWN - Service failure Detected content type , but expected : Source) Source) at Source) Source) Source) Source) Source) Source) Source) Source) Source) Source) Source) Source) Source) Source) Source) All works with strict content type validation off. This is NOT the issue the user was seeing, however, does show a possible issue with content type validation and docker.. Content type validation blocks some docker fetching. While testing the initial RHC Lifecycle implementation for NX3, I noticed an error that said \"Error accessing Sonatype server: Professional license is required for access to this despite the fact my license was correct. I decided to change it but on doing so got the attached error. Despite it giving a green confirmation, the license did not update (so I was unable to perform the check above). I believe this worked in previous versions of pro so there may be something else going on. I am pretty sure this is due for an update but spoke with who suggested filing so we don't forget since we didn't make changes in this This occurs with both debug on and off. Despite my recollection, I didn't actually check older NX3 at this time. I've been running oss exclusively since m4-m5 timeframe. JS from debug mode: Uncaught TypeError: is not a function VM1057 VM1057 VM1034 VM1034 VM1034 VM1034 (anonymous function) VM1034 (anonymous function) VM1034 VM1034 VM1034 VM1034 VM1034 (anonymous function) VM1034 (anonymous function) VM1034. Base URL capability has a validation message for the URL field \"must be a valid URL\" - rest of the site has 'This field should be a URL in the format \" I looked to make it consistent but couldn't find it in github so I am ticketing instead. I made this a bug rather than an improvement because I think the level of confusion is potentially high if you enter and it asks for a \"valid URL\". I did not check older NX3 or NX2 at this time.. A comment with security level 'Developers' was removed.. Restore Task's notification email help text. While testing, I noticed an hourly scheduled task not running (see attached). On follow up test I was able to get it to run. I am able to reproduce this intermittancy consistantly by making the start time for the scheduled task in the past. For example, the one from the screenshot, I set to (AM) before remembering that this was military (24-hour clock) time. Nexus is smart and updates \"next run\" to the next hour, however, it seems the task never fires. If you have the start time in the future it seems to work fine. noticed similar in his NEXUS-7797 revamp I believe. He wrote: Start time: logs show: INFO admin - Store trigger: triggerClass: calendar: 'null' 0 nextFireTime: Mon Nov 02 PST 2015, UI shows: Next run Mon Nov 02 2015 GMT-0800 (PST) I actually do not see this log message line, but I believe it's the same issue after his comment in NEXUS-7797 in response to my test notes. I did not check older NX3 or NX2 at this time. Debug was off during these tests.. Hourly scheduled tasks can not run when UI next reports. Adjusting a schedule task updates last run and last result fields. If you have an existing non-manual scheduled task (iow a task with a start time set) if you click into it to see details then click away without making any adjustments you are prompted to discard changes or remain on the page. If you remain then click the discard button the start time goes blank and you are able to traverse away without prompt (on weekly schedule, the day to run the tasks also clears). Leaving minor since this is especially confusing since that field is required. This does not affect manual tasks because they have no start time. I did not check older NX3 or NX2 at this time however I do not believe it was related to the change (discovered while testing link) since it occurred in m6. also noticed this while performing the change itself (and relayed in an email). Debug was off during this test.. Just performed the following events in a fresh build of Gnarly: Cleared local .m2 repository folder Hit The pom was returned. Unless I am really confused I believe block setting is not working. I attempted the same test except instead of being blocked I disconnected from the internet and got back the (expected) 502 error. I tried again but did not clear cache and was able to see the pom (so it was cached). I attempted this in m6 and experienced the same behavior so do not believe it related to NEXUS-9182. No errors in log, debug was off during these tests. I did not check NX2 at this time. If this turns out to be NOTABUG, I would like to recommend we reevaluate the help and documentation text to be a smidge more clear.. Blocking repository does nothing. Installer does not create desktop icon in CentOS KDE. While testing the installer I ran a basic setup and at the end \"Completing the Sonatype Nexus Setup Wizard\", I kept 'Create Desktop Icons' checked. On CentOS KDE the icon did not create. I tried several permutations of installs and no dice. This blocked testing of several issues I was trying to test in Linux. On CentOS GNOME it did create so nothing is currently blocked however, I am filing at least because I believe it's worth documenting something not working when it is checked. Marking minor however I guess it's arguable if you're using CentOS KDE ) Recommendation to send to install4j. Review with Joe to see if increasing the logging levels gives better information.. Logger related(?) error at top of console after reset. noticed that he set the logger to TRACE, restarted nexus, and the logger value of was reset to ERROR. I was able to repro this but it does not happen for all loggers. I checked and the values are defined there but for some reason it is not picked up. We discussed whether this was a \"feature\" or not and also discussed if it has to do with customized loggers (and potentially the change from NEXUS-9327). When testing NEXUS-9327 I did not include restarting in the test Despite that discussion I did not check older NX3 at this time, nor did I check NX2. Debug was off during this test.. While reviewing group ordering, I uploaded the same npm project into two different hosted directories and had those hosted directories in a group. I noticed that the json information in the UI for the project via the group showed the second project that I had uploaded (see screen). However, because of the ordering I expected it to show the first json. The metadata did show the proper ordering so that ticket passed (see screen). I spoke with and he said to file and he would review debug. He noted that the json is(may be) going away with which may make this difficult to repro and or test. Test done with debug off. npm is new to Fabtastic and I did not check any other repo types in NX3. I did not check NX2 at all.. While demoing Tuesday, the team noticed that on Search the sign that usually is at the end of the row on search to indicate that you can click and see more was not in the last \"column\" but in the second to last column. This does not occur on normal search and in fact seems to only occur when you have a component twice in different repositories like attached screen (dated 10 1). This was demoed in NPM and that is how I reproduced it - creating two npm hosted repos and publishing the same package to both and then searching on the name. In addition, I tangentially noticed similar behavior on the Capabilities screen right out of the box. The differences seem to be that it does not take any special circumstances to get it to break and the is in the second column instead of the \"last\". See attached screen (dated 9 30). I was waffling whether this should be two issues or one. I conferred with who said start with one. Daniel suspects as I do, that the Capabilities issue (at least) is recent regression. I have not checked older NX3 or NX2 at this time. Test performed with debug off. Nothing in the log or JS console.. Can't create external LDAP Role mapping. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. Just noticed that if I delete a nuget asset then repush the nupkg to get the asset back it gives me the below error. If I delete the repo and push there is no error nor is there an error the first time, so I assume this Nexus and not the package. In the offchance this is behavior, I wanted to note I found the error strange. It reads like it's missing a download count however that doesn't make any sense to me since those kinds of attributes would seem to always be read or never (not the second time and fail). I did not check older NX3 or NX2 at this time. I was on MacOSX using curl to push, an unlikely use case however I did that both times (the first successful and the second errorful). I also did not check Windows at this time. ERROR admin - Unknown error Missing:. A comment with security level 'Developers' was removed.. While reviewing NPM, I noticed looking at browse search results all the json details were smushed together making IMO a tough reading experience. In fact, I believe it's much easier to read the json file itself (the contents are the same but the are not stripped). noted that 'we implemented \"nice\" display of attributes only for 1 level' and if extended it would show nicer. He also noted that some docker attributes have the same issue. This is an improvement ticket in that regard. I included a screen of current npm as well as a screen of current NuGet (which looks much better; though not a fair comparison provides a vision of something to strive towards). NPM browse search is new to NX3 and to Fabtastic so no back checking was done. I do not recall seeing the docker portion myself (implemented in m5, new to NX3), so did not attach screens cases however if I run across it, I will try and remember to do so.. I noticed that after saving a Capability change on the Summary tab that the Save Discard buttons remain enabled. This does not happen on the Settings tab, so I surmise this may have been fixed one place (by NEXUS-8833?) but not another. Similar tickets have definately existed (see some linked). There are no errors in the JS Debug was off during this test. I did not check older NX3 or NX2 at this time.. While running through security, I noticed that if you have just Roles permission, you get a warning that you cannot read privilges. While this is true, it is not necessary to create a role. Similarly, I think the placement of the warning is confusing. You get the warning before you enter the place where the fact you cannot read potentially matters (drilling down into creating the role). Note, that the users page has a similar issue when it comes to listing roles however that page CANNOT be used without, so there is no ticket for that. The combination of the ability for it to be used and confusing warning are causing me to file. See attached screen, let me know if unclear. I had debug off during this test. No errors appeared in the js console. Below appeared in the I did not check older NX3 or NX2 at this time. ERROR joedragons - Failed to invoke action method: java-method: User is not permitted: Method) at Caused by: Not authorized to invoke method: public at 26 common frames omitted. Clicking to run and running a scheduled task shows repository field briefly as required. A comment with security level 'Developers' was removed.. See attached (from Blobstores page). On smaller columns in IE(11), the sort arrow collides with the text. I noticed this first on where the default column sizes are pretty small (lots of data) and the initial sort (Timestamp) is affected. This does not happen in Chrome (Windows7) so this seems to be an IE specific issue. Working browsers have the arrow on the right and if the column gets too small, not shown at all. Being that the sort arrow is not first and on the same line, this is what I would have expected. Workaround, widen the column. I am pretty sure I have seen this before but did not see a ticket. Did not test older NX3 or NX2 at this time. Debug was off during this test.. A comment with security level 'Developers' was removed.. I noticed that if I went to Custom Search from any of the other child searches (Docker, Maven, NuGet, Raw) I got a continual loading mask that did not go away. If you go from Search parent or outside stuff (such as Welcome or Browse) it works. This occurs with Debug on and off and nothing in the log js console shows (though I mull if it's really continual that's why). This occurs with contents in the repos or with a fresh (content free) install. None of the other child searches seem affected in this way. I've attached a screen since it's about the same info as a vid, but if you want a vid let me know. I did not check older NX3 or NX2 at this time.. A comment with security level 'Developers' was removed.. Theres a delete button when viewing an asset in a group repository. We dont support delete in that scenario, so the button shouldnt be there, and if we do try to use it an NPE is thrown since the Asset id doesn't exist in the group repo bucket. Acceptance Criteria: - Remove the button from group repositories! NOTE: - The information to remove this easily is not currently available, we'd have to figure something out to indicate your are in a group repository INFO admin - Deleting asset: null ERROR admin - Failed to invoke action method: java-method: null Method) at Source) at Source) Method). A comment with security level 'Developers' was removed.. Support Zip page prompts for discard. I noticed when I created a Support Zip (via Admin Support) that when I removed some of the check boxes (I left \"System information report\" as well as the two Options) then closed the browser or navigated away I was prompted to discard changes or go back. This page is not able to be saved to my knowledge, so I think this prompt is out of place. Test done with debug off. NX2 is not affected by this. I did not check older NX3.. noticed that on the page the Realm list dropdown initially shows no items in it unless you go to the page first. This can be reproed both by logging in directly to or by logging in normally and navigating to before going to Then click on the realm dropdown. See vid. Both of us recall seeing this or something akin before but could not find a related ticket. I suspect this affects older versions of NX3 because of this but did not back check at this time. This does not affect NX2 because the setup is different. Testing done with debug off.. Verified thanks!. In case it helps, I am not seeing this on master on the quick. So either, that may lend a solution or it sometimes does not occur.. IE(11): Errors & non-functional pages after minimal site use. A comment with security level 'Developers' was removed.. I noticed that when I went to put a repository offline, right after I went to navigate away, I got a discard changes prompt. On repro attempt, I noticed when I unselected any checkboxes on the form, the save buttons remain enabled and the discard prompts fire. If you discard however, you will return to a screen where everything is saved NOT discarded. This is pretty confusing. See attached movie, let me know if unclear. It's even more confusing that it does not appear to affect the opposite way (selecting checkboxes) or using other field types (that I saw tried). While I originally saw this on repository, I was able to reproduce using Capabilities, so it's not repository specific. I did not check older NX3 or NX2 at this time. Test done with debug off.. While on a browse repository asset detail page anonymously, I logged in as admin and saw an error. I was able to get the same error logging into a component detail page. I also saw errors (though a different one) logging in to the file list (before details) as well as the component list (before file list on browse Components). Despite the error, everything appears fine to me. This also does not occur when you directly hit the URL so seems indirectly related to what I was testing. I decided to file one ticket as the behavior is identical, despite the differences in error; I suspect there will be two very similar fixes. If you'd like this broken out let me know. If this seems familiar, NEXUS-8728 is almost the exact same thing for search but no longer occurs in search. I did not check older NX3 or NX2 at this time. This occurs with debug on or off. Asset details error: Uncaught TypeError: Cannot read property 'getView' of undefined VM258 VM258 (anonymous function) VM262 VM246 VM246 VM246 (anonymous function) VM246 (anonymous function) VM246 VM246 VM246 VM246 VM246 VM246 (anonymous function) VM246 File list and component list error: Uncaught TypeError: Cannot read property 'getStore' of undefined 2VM258 VM258 (anonymous function) VM258 fire VM246 VM246 fireEventArgs VM246 VM246 fireEvent VM246 VM246 VM246 (anonymous function) VM246 (anonymous function) VM246 VM246 VM246 VM246 VM246 VM246 (anonymous function) VM246. Errors after logging in from anonymous to some pages. A comment with security level 'Developers' was removed.. Browse Repository scroll not infinite. Earlier today I built NX3 using NX3 and had the normal 3000+ assets in my system. I noticed while reviewing something unrelated that on Browse UI, I only saw As and Bs in my component list for my dev group and central repo. Similarly, in Browse UI for assets I only saw As and Bs. I checked internal repos and more stuff than As Bs showed so the items are browsable. It appears that infinite scrolling is not infinite and it's stopping after pages. See attached vid. I thought maybe this was NEXUS-8988 but the workaround given there (going to a working repo then back) does not fix this. Also, I don't believe this is an issue with inclusion and more an issue with not being able to see everything. Because this was working with NEXUS-8988, I believe this recent regression. The behavior persists even after a browser restart. It occurs with both Debug on and off. I see no errors in nexus log or js console (or dev console). Workaround would be to search, which is lame, but I gave minor priority since it is valid.. A comment with security level 'Developers' was removed.. Finishing asset detail page testing (NEXUS-8255), I noticed that NuGet assets were being listed and downloaded in the form of If you rename the download to it's proper name (in this case original file was or even improper with a nupkg extension (tried they work. So the data is there, I think maybe just malformed slightly somehow. However, as far as download goes, I imagine it'd be pretty annoying to NuGet users trying to get their assets this way. Left major because of this. Asset details are new to Edgy so does not affect older NX3. I did not check NX2 at this time, tho I suspect unaffected. Test performed with Debug off.. Testing NEXUS-8848, I noticed that I changed from asset details to search another type (raw to maven) and got the attached error. On further exploration this error seems to fire anytime you switch from a second level detail (such as result from search or a repository from repositories) to another left nav item and does not seem search specific. Example: Select Repositories, select to edit an existing repository and select Blobstores. This error occurs with Debug on or off. Screens are with debug on. After the error occurs, you cannot see details any longer in the UI. You can navigate but no new data appears in the frame. Also expanding the dev console is largely unreadable (though since this occurs with debug off, I doubt this is related). Thus I am leaving this major. Refreshing the UI does fix this however. I did not check older versions of NX3 at this time. Since there are really no \"levels\" I recall in NX2, I doubt this affects NX2 but did not check at this time. Nothing in the Full JS: Uncaught TypeError: Cannot read property of VM2838 VM2838 VM2838 VM2838 VM2838 VM2653 VM2653 VM2653 VM2653 VM2877 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2731 VM2653 VM2653 VM2653 VM2653 VM2735 VM2735 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 VM2653 function) VM2653. Heres a list of places in the UI missing help text: + Strict content type validation (repository config) + Name (repository config, make it clear that we expect an ID, not a human-readable + Raw repository (repository config browse, need a better name and or description) + Query cache size Nexus trust store (repository config, need better descriptions) + Not Found Cache enabled (repository config, the intent is clear but not what this does) (add here!). A comment with security level 'Developers' was removed.. I just went to create LDAP and noticed that when configuring \"User and Group\", I could not save with Group Type being Dynamic or without mapping LDAP groups as roles. There was a validation firing that (if reading correctly) Group Member Format (a variable under Static Group configuration) was required. See attached and log snip below. I was able to change to Static Group configuration and create my LDAP. If you then go back and edit, you can make it dynamic group configuration or remove mapping LDAP groups as roles altogether, but you cannot remove the value from that field. If you do, it restores it to what you did before you saved. This occurs with ?Debug on and off. Editing post-creating is a pretty poor workaround and also 3 of our templates use dynamic groups so appear not to work with this as is, so leaving major. This worked in some builds of m4, so is at least semi-recent regression. I did not go back and check pre-Edgy so am not sure how recent. I also didn't check against NX2, tho this was working last time I attempted it, assuming NX3 specific. I don't believe this has anything to do with the linked issue, however, linking for thoroughness. ERROR admin - Failed to invoke action method: java-method: The field cannot be null, record: ldap mapping at Source) at Method). In order to use the Browse UI, you need read privileges (like below example). This is contradictory to search which you just need privileges (you need these for Browse UI as well). I am pretty confident this is a bug, because anonymous by default cannot use Browse UI (because of this). By default, anonymous shows it has no permission to see any repositories in Browse UI. Bringing up at least for triage; in case not a bug, don't think intuitive so I think worth documenting. Browse UI is new to Edgy so does not affect older NX3. I did not check NX2 at this time. Example:. Messages slow to fully appear sometimes. A comment with security level 'Developers' was removed.. While testing the Browse UI (NEXUS-8888 and various other tickets), I clicked into Unattached Assets and into details and got the attached errors (and it does not show more details). While NEXUS-8255 is not complete, I mentioned to and he asked me to file seperately. This is that ticket. There is nothing in the for this error (at default levels). This is a recent error, likely caused by initial NEXUS-8255 efforts, however, there were limited details shown before NEXUS-8255 efforts. Just stating this because I know this error does not occur in m4. This also does not occur in NX2.. Capabilities: Changing state does not change related aspects of UI. In Capabilities when you change the state the following items do not immediately update which could lead to confusion. * The enable disable buttons do not switch to reflect that one is no longer Create Capability - \"Base URL: Force\" (for example, any one should do; one already created probably ill advised) 3) Click to edit. Note State on the Summary tab is \"Active\". 4) Click Settings tab. Note active button is \"Disable\" and checkbox is checked (signifying Enabled). 5) Click \"Disable\" button. BUG: Checkbox remains checked (signifying Enabled) and active button remains \"Disable\". If you click back to the Summary tab, you'll note the state is still active.. After running the Rebuild Maven Repository Metadata task, I refreshed to see the status and noticed it said \"Unknown running\". This appears to be the default return. Analysis from states the task may be STARTING and suggestion is to add a state for that. I feel like this may be a recent change but maybe just unlucky timing on my side. I did not check older NX3 (task (re)added in m4) or NX2 at this time. I waffled between Bug and Improvement; bug for now but made it trivial. Debug was off when I noticed this.. when searching while searching. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. With tasks-read and tasks-create permissions, I can click the button to create a new task however, I cannot access some of the fields (including the required ones in both of the current tasks). Oddly, I can access some of the fields. Once I add \"tasks-update\" permission, the tasks become creatable. Not only does this seem odd but it's not how any of the other permissions I've tested function, so I'm filing for eval. I did not test older NX3 or NX2 at this time. Debug off during these tests.. With help from and , it was revealed that the error I received while testing NuGet was a generic 500 and that needs to be made into a specific error. I noticed this twice and will put details below, however, only one case was reproducable. A) While testing NEXUS-8714 (MacOSX), I left my HTTP Proxy configured when running the curl. This generated the error every time. Steps to repro: 1) From Security HTTP, check HTTP Proxy. Configure a non-working proxy (mine was Charles defaults without Charles on; so HTTP proxy host localhost, HTTP proxy port 8888). Save. 2) From console run curl from NEXUS-8714, \"curl -v -o B) While testing NEXUS-8611 (Windows7), I tried to use the nuget command line to install FaceSharp (nuget install FaceSharp -source NX3Proxy). This did not complete with an error 500 on the command line screen (see attached) but also with the error occurring. This was not reproducable. I suspect after successful install this was caused by a timeout that may be able to be reproduced with throttling if my suspicions are right. But as such there are no steps at this time. I did not test older NX3 or NX2 at this time, though I suspect (at least in the case of NX3) the issue is because of \"new\" NuGet (revamped in m4). Error in both cases: WARN admin - Service failure null at. I see no evidence currently that on NX3 LDAP configuration using Verify Connection the \"retry after\" and \"max failed attempts\" (latter I believe new for NX3) is working. I noticed this testing NEXUS-8655 after verifying the wait seconds before timeout field was working as I expected. This appears to \"work\" in NX2, but without \"max failed attempts\" it basically tries to connect forever (which is probably why the third field was added). I did not check older NX3 at this time. On discussion with , he asked if I would close NEXUS-8655 if the first field was working and open a distinct ticket on the second and third fields. This is that ticket. Repro steps: 1) Setup a valid LDAP (first page) but make the port an invalid port. 2) Click verify connection. The connection will try for the number of seconds listed in the first variable then nothing. I attempted low settings and retries to get this to fire faster (such as 10 2 and 1 5).. A comment with security level 'Developers' was removed.. Noticed that in NX3, when configuring LDAP, the Verify User Mapping button gives the attached error and does nothing. This also appears as a JS error in the console: \"Uncaught me is not defined ADDENDUM: This shows as \"Uncaught me is not defined - with ?debug on. This works in NX2. I did not check older milestones of NX3 but this is not regression of the ticket discovered by. I am leaving this major because this is a super easy way to make sure this configuration is working before actually working with LDAP stuff. I am not sure if there's anywhere else that does that in one button click which makes for a poor workaround.. While reviewing Crowd, I tried different values for both HTTP and Crowd specific Request Timeout and only the 0 value appeared to affect Crowd (would cause seemingly endless attempts to reconnect on a \"bad\" I asked the team what this field was supposed to do to clarify I was testing the right thing and it was inferred I should create a ticket for review. I tried values of 60, 1 and 20000 (in case millseconds regression) in the field. I tried with Crowd off and valid as well as Crowd on and \"bad\" and it immediately gave me a validation no matter what configuration (except in the 0 case). I tried less combinations on the fallback general HTTP values but my findings were those are not being picked up either. Investigation appreciated. If not just me, all the above should probably be (re)tested once a solution is implemented. I did not check older NX3 or NX2 to see if working not working at this time.. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. noticed that repositories with version policies cannot be saved. I checked master and see when I save I get a \"may not be null\" message under these. I checked through the default ones and think it just proxy and hosted maven that are affected. Alin says this is related to NEXUS-8503 and \"that is becuase disabling a field will result into those fields to not be submitted and that will not pass repository validation\". I guess when I checked that I only checked by sight, my bad Below also appears in the log: WARN admin - Validation failed; 1 constraints violated: 1) may not be null, type: class property: value: null This does not impact NX2 or older NX3 builds.. I noticed that the Online helper text (seen when creating or editing a repository) spans 3 lines and it seems it could be 1 line saving space and consolodating the page a bit. in seems to be defined as 1 string without breaks, so I assume this is a page \"issue\". We've specifically spoken about real estate on this page so filing improvement. This is recent regression to Dizzam and I suspect unintentional fallout (perhaps from ?). Spoke to about this before filing.. Chrome: Cannot use scroll wheel to view some bundles details. I just noticed that I cannot scroll through the bundles details using the scroll wheel of my mouse or the the trackpad of my laptop when in Chrome. FF works fine and the bundles list also works fine (in Chrome). Something about the bundles details. Workaround is to use the scrollbar on the right side or just mousing over it and scrolling. Copy highlight mouse dragging also works (tho is an ugly workaround). Note, keyboard also isn't a workaround but is not part of this issue as it doesn't work on the list or in FF either. Seems just that keyboard movement through pages is not supported. The bundles revamp is new to Dizzam. I did not check older versions of NX3 to see if the same issue affects Plugins. I did not check NX2 at this time.. I noticed that on the RAW search, if you click \"More Criteria\" there's an option for \"Raw Repositories\" but it contains no items. When you drill into, it does open a menu but since there are no items there's a single grey line. The non-menu type items on this page have a more expected function: you pick them and they disappear from the list. This issue is not limited to RAW. You can get this to repro with any menu item that has a second level by adding all the items in that item to the search. I did not check older versions of NX3 or NX2 at this time. Steps to repro (this is just the one the attached screen shows): 0) Do not need to login (unless your anonymous is messed up). 1) Click on + to expand Search 2) Click on Raw 3) Click on More Criteria 4) Hover over \"Raw Repositories\". BUG: Selector is blank.. While trying to repro this on other pages (per Alin's comment), I noticed that I have been able to get the Users page to \"blank out\". The behavior is similar to the desc (create, edit a lot) but not reproducable (yet) or exactly the to figure it out. Seen 4-5 times now though. Attaching screen in case anyone has earlier thoughts. ADDENDUM: Behavior definately unreproducable UNLESS refresh (via top bar) does not reset what's causing it to happen (or it's timing related). I got it to occur by clicking admin, scrolling to bottom, breadcrumb \"back\", clicking deployment, scrolling to bottom, breadcrumb \"back\", clicking create, breadcrumb \"back\", BUG. Second attempt (post-refresh via top bar) did not break.. A comment with security level 'Developers' was removed.. FYI, today testing unrelated, I saw this behavior just switching from repo to repo (default ones) in OSS. I am not going to assume it's the same from the back and forth but wanted to relay. Am trying to come up with a reproducable case and if I can, I'll link here.. Category column disappears from Capabilities page. -While reviewing the NX3 documentation for Capabilities, I noticed that there was a section describing a Category column. I thought this hangover from NX2 but noted he saw it in OSS (I was testing -I double checked and see what he did. OSS has a Category column in the Capabilities section and PRO does -I can't think of any reason for this inconsistancy so -The category does show when inside the details of the Capability so making trivial. I did not check older NX3 or NX2 at this UPDATE: Testing unrelated today, I noticed the Category column missing from OSS. It appears on initial load, but disappears if you leave the page and return. I rechecked PRO and the same thing happens. Sorry for initial misanalysis and titling.. A comment with security level 'Developers' was removed.. Disconnect between Admin UI and nuget-hosted config. While testing pushing a NuGet artifact, I noticed that the new Admin UI had Deployment Policy set automatically for the default NuGet hosted repo as read only. Despite this I was able to push a NuGet artifact. On further investigation with , we discovered that the initial configuration displayed in the admin UI is not reflected in the database (see attached - row 5). Further, changes to that repo configuration do not update the DB, despite reflecting in the UI. Using a newly configured NuGet hosted repo works properly and is the workaround. This is new to CMA with the addition of the admin UI so no NX3 back checking is possible at this time. There are no default NuGet repos in NX2 so cannot compare there either.. The new CMA default (host) repo creation has deployment policy set as read only. The NX2 default was dependant upon the release policy (disable redeploy for release, allow redeploy for snapshot, etc). After speaking with and this did not sound intentional so filing. These policies are new to CMA so no back checking of NX3 can be performed. Workaround to select what deployment policy is correct manually. This also affects the default NuGet hosted repo and caused me to find the related (linked) defect.. Noticed that when you enter in a \"?\" or space on creation of a repository in the Name field you get a validation Seems the validation message for \"bad\" names (vs empty names) is undefined. I checked all available repo types and it affects them all. The legacy repo message is For reference, not saying that should be the new message necessarily (tho it reads fine to me if true). This is new to CMA and does not affect older versions of NX3. Nor NX2.. A comment with security level 'Developers' was removed.. While testing NEXUS-8447, I was on System Email Server in Verify SMTP Connection popout and clicked to cancel. Doing so (with no emailed filled in) caused validation to occur. A second click closes the popout successfully. Having emailed filled in and clicking cancel also behaves correctly. I guess this is likely the same fix as NEXUS-8430. It's definately similar behavior.. Saw this after about 6 hours idling. Only once, seems different but unsure if related. FYI. Screen also showed attached message, which I don't recall seeing before. I know we have a countdown and expiry but this seems neither.. Log Viewer shows entire log despite size selection. While performing UX review, I noticed in System Information the Print window not scrollable (so just shows screen height worth of lines). This does occur in m3 (checked at Daniel's request) or in NX2.. A comment with security level 'Developers' was removed.. stray null appears on System Information load in IE11. On cancel, window does not return in full view sometimes. In the left navigation of IE11, when a main area is collapsed (via the - icon or by default) a + icon does not show to reexpand it. You can click on the blank area and it will expand. I left severity major because this is potentially confusing for any who are collapsed by default and or mistake. Borderline minor with the workaround. I've attached a screen of this working in not-IE from Daniel, which may be the easiest way to explain (since absence of +s is hard to point out, tho can be screened). I did not check older versions of NX3 at this time. This does not affect NX2 as there are no + - icons there.. While doing UX review, I noticed the below pages do not have Saving masks that the rest of the pages do. After speaking with Daniel we agreed on one ticket. Tasks - Settings (when saving a Task) LDAP (saving to create an LDAP) I did not check NX2, this perhaps is an improvement but not worrying about that now.. Some pages actions have inconsistant masks. Some pages actions have inconsistant masks re: changes. Filing one ticket to update after speaking with Daniel. Staging Bundle - \"Upload mask\" appears to be the whole page not just the area.. A comment with security level 'Developers' was removed.. While testing NEXUS-8016, I had added Central to the default nuget group (nuget-group) but later decided I wanted an independant group to test, so removed Central. Later when I ran the following curl against nuget-group, I was seeing two warnings about incompatable repositories even thought there weren't any. discovered that there's a problem with removing repositories from CMA such that they will not remove until you restart and then remove them. He is digging into any other this might affect but asked me to file a ticket. curl -u -X GET -v \" I did not check older versions of NX3 at this time. Steps to reproduce: 1) Login to NX3 as admin 2) Go to 3) Edit nuget-group to include Central and save 4) Edit nuget-group to exclude Central (only include the original two nuget repos - proxy and hosted) and save 5) Run the above CURL. Note there are two WARNs in the log saying Central is included. NOTE: The first time this broken I noticed loading nuget-group via the UI after step 4, I did not see Central in the configuration (json) however on Nexus restart I did see Central in the configuration (json). I tried to repro this and it did not occur again.. TestNote: Verified first two in case someone takes this over.. Use present instead of the current year in the copyright notice. Elasticsearch seems to be more finicky that our data model allows right now, and likely spaces in Repository names is something we want to support. And after removing the space we find we don't allow uppercase letters: To reproduce just add a new Repository in the UI with a space or capital letter in the name. An unhelpful error is shown in the UI: \"Failed to start facets\" Minimally we should add validation to ensure that we don't allow invalid characters, as right now we end up with configured Repositories that cannot possibly function. Acceptance criteria: - names should be validated in the UI, and provide guidance when illegal names are tried - names should be validated on the server using the same rules as the abuse of the ExtDirect api) - names should only allow (English) alphanumeric and (dash, underscore, period) - names should be sanitized for elasticsearch usage in index names; this requires enforcing uniqueness of names as indexes are all lowercase. A comment with security level 'Developers' was removed.. While testing NEXUS-7758, I went to create a task and filtered, but realized I missed something so switched to repositories. After finding the info I needed, I returned to Tasks but my create button was greyed I was able to repro this reliably by filtering on a second level (Tasks) returning to a base level (not even filtering) and then returning. Steps below. I went to see if this was an issue in m3 but as far as I can tell there are no second level filters in m3, this is a new concept to Dizzam. This also does not affect NX2 (same reason but more basic). Borderline minor as the workaround is to browser. I do not believe this is related to where I found it but linking in case wrong and for completeness. Steps: 1) Login to NX3 (Dizzam) as admin 2) Click Tasks (admin section, under System) 3) Click Create 4) Filter by something (like \"whatever\") 5) Click Repositories (left nav item under Repository) 6) Click Tasks again. BUG: Create is out.. While testing NEXUS-7758, I created a fake LDAP just to make sure all the newly formed dialogues were working functionally. Note, my intention was not to create a real LDAP setup and I don't think that matters in this case. After filling out Connection information and clicking next, I went to fill out \"User and group\" information. In past iterations, I had picked a configuration template but this time just filled in the required variables. When I got down to Group Type, I decided to uncheck \"Map LDAP group as roles\" (figuring correctly this would hide the required field, thus in essence making it fill). On creation click, I got the following error in the log as well as a from the UI. The UI error struck me the most because almost all of our warnings are defined so you can tell what the error was. ERROR admin - Failed to invoke action method: java-method: null at Method) Method) at Method) at My original test was in Safari but I confirmed in Chrome (both MacOSX). After doing this, I found that if I left the box checked and filled in the value, everything worked (thus templates were also working). After realizing that, I checked m3 and it was working there. This also works in NX2. This seems new to Dizzam.. Subheader text contains redundancy with content. In NEXUS-7758, the capability details were merged from 4 areas to 2. One of the things that moved was the Notes (About) section. However, in the post-deploy, I noticed that the details area has a header \"Notes\" but the old details also have I checked with and we agree it's redundancy and can be removed. Because so much of NEXUS-7758 is working, filing a separate ticket to avoid failing the \"parent\" over something so small. See attached for how it is now (one example), if you need more or old screens let me know. Because of recent adjustment this is not an issue in NX2 or NX3-m3 (or earlier).. A comment with security level 'Developers' was removed.. On Login, Password appears filled in IE11. In NEXUS-7959 it was revealed ( 3) that you can double click column headers to expand contents to full width, giving this column \"priority\". I noticed when you do this with columns with shorter content (like Status) part of the words remain cutoff. I suspect this is because the column width includes the filter dropdown but the space for the contents does not (not sure tho, but that is how it appears). I did not check NX2 at this time. Acceptance Criteria: * If I double click to see contents of a column, I want to see full contents, not ellipsed contents.. A comment with security level 'Developers' was removed.. While reviewing NEXUS-7959 ( 1), from Repositories I removed the type column then added it back (having the original columns there) and noticed that many of the columns, including the lengthy name column were super small. I am not sure if this was because of NEXUS-7959 but I definitely think the resizing could be better. On refresh, everything resizes correctly, but on refresh all the hidden columns are restored as well, so that doesn't really mean much. Waffled between Improvement and Bug; feel free to swap it if you want. If unclear you prefer a movie let me know. I did not check NX2 at this time; I suspect NX3 specific.. Clarify Yum Capability helper text. Reviewing Capabilities I noticed that in Yum: Generate Metadata and Yum: Staging Generate Metadata that the Aliases field had helper text \"Format: \". I had no idea what this meant and after reviewing the book at 's prompting, I found that it means that the Aliases field is comma delineated Even knowing this, I feel this is unclear. Suggest we replace with that fact or just put an example (either in helper text or in greytext in the field itself). I did not check older versions of NX3 at this time.. Saving shows a validator briefly when condition is fulfilled fields). While reviewing NEXUS-7901, I created a task and edited it and noticed that a validator was appearing despite the fact the field was filled in. This occurs on both save and discard. If this can be prevented, I see no point in having this appear. See attached movie (shows save only).. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. Tasks: Replace removed Cron helper text. While testing NEXUS-7705, I noticed that when creating a new task when scheduling Advanced (Cron) the long guidance text describing Cron examples was gone. I asked in email if this was intentional and it was decided that rather than having long examples, there would be an entry in the help content that we could link our helper text to. I waffled between making this a task or a bug, but since the text is removed, I went with bug. This is NX3 only as the text is present in NX2. I believe this cannot be done until the link is added so added dependancy. Acceptance Criteria: - Have a cron context help link to the Nexus Book. As a user, it'd be nice to have a persistent message when I come back to a session and am logged out. Two times today, I've been idling on NX3 and on return to the screen have had a pause then realized I am logged out presumably due to idling. One benefit of NEXUS-7755 was that there was a history including that you were logged out. Right now, you can potentially just click anonymously before realizing what happened. Suggesting a message on the screen relaying you have been logged out that persists until the user clicks it off (or otherwise notes it as being seen). If NEXUS-7755 or like history is restored, then this could likely be OBE.. As a it'd be good to have a clean indicator that the server is started in the console. In training, it is mentioned that you can see Nexus has started by looking at \"Started Usability suggestion, add a line after the system processes are done Nexus has or something akin. This is not unlike the Initializing message currently present (and I personally feel would be more useful). This is just for nexus console. Nexus start has a clean(ish) message. This affects both NX3 m2 and SNAPSHOT. I had seen this a while ago but had not checked SNAPSHOT til today, thus the delay in filing.. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. A comment with security level 'Developers' was removed.. ", "contenttype": "application/json", "created": 737358, "id": 63, "language": "en", "user_name": "jtom", "email": "-"}]}