{"contentItems": [{"content": "If the end user selects everything in the editor and invokes Insert Color then Studio returns a color code value without the hash. Steps to Replicate : 1) Open Titanium Studio 2) Open a CSS file 3) Select all 4) Select Commands CSS Insert Color, select a color and click OK Actual Results : The editor inserts a color code with no hash. Expected Results : The editor is supposed to insert a color code with a hash.. Studio Editor Adds Superfluous Line Number. Please see capture at Since upgrading to Titanium Studio the Ruby editor adds a superfluous, inactive line number after a defined construct at the end of the file. Steps to Replicate : 1) Open Aptana Studio 2) Open a Ruby file or any file Studio handles 3) Add any defined construct such as a function definition, if statement or loop to the end of the file Actual Results : The editor adds an extra line number after the end of the construct. This did not happen in version Expected Results : The new line numbers should only extend to the end of the construct.. The JavaScript editor will show a syntax error contingent upon the order of the typed characters. Steps to Replciate : 1) Open Aptana Studio 2) Open a JavaScript file 3) Enter 4) Note the syntax error to the left 5) Delete the addition from Step 3 and enter a \";\", then prepend this with Actual Results : Studio reports a syntax error after Step 3 however not after Step 5 Expected Results : Entering the same content should cause the same validation results.. Global methods appear in content assist for quoted string object. of the wiki Web Acceptance Suite says global methods should not appear in Content Assist list for quoted string objects, however if you enter this in a JavaScript file : \"message\". (quotes and dot operator included), the methods eval and String, which are classified as Global Functions at : will appear in Content Assist. Steps to Replicate : 1) Open Aptana Studio 2) Open a JavaScript file 3) Enter (including quotes and the dot operator) \"characters\". Actual Results : Content Assist will include the methods eval and String, which is classified as a Global Function at : Expected Results : Wiki item states Content Assist from quoted string objects should not contain Global methods.. If you have a pair of braces enclosed by quotes and containing a matched pair, deleting the inner and outer characters in a certain sequence will cause a newline between the braces to move the caret one space forward instead of adding a (possibly indented) newline. Steps to Replicate : 1) Open Aptana Studio 2) Open an editor 3) Enter a double quote (or a single quote if the editor matches these), brace and any character the editor will auto-match so you have something like the sequence \"\" 4) Delete the first quote, then the second quote, then the enclosed pair so the caret is at the pipe : 5) Enter newline Actual Results : The caret will move forward as if you entered the right arrow key. Expected Results : The editor should add a (possibly indented) newline between the braces.. XML Outline Does Not Clear Upon Replacing Current Content With Erroneous Content. Please see capture at The XML Outline does not clear if you replace all current content by pasting in syntactically erroneous content. Steps to Replicate : 1) Open Aptana Studio 2) Open XML file 3) Add content that will register in the Outline 3) Select the entire file and paste in syntactically erroneous content Actual Results : The Outline freezes in its initial state. Expected Results : The Outline should clear when this happens.. If you FileSystem node. 2) Select Context Menu Rename. 3) CTRL+C folder name string. 4) CTRL+V in place. Actual Results : Please see capture at Even if you close the dialog window, Studio recursively adds the folder and its contents as subfolders, perhaps to maximum folder depth. Expected Results : this action should not have any effect on the file system.. This item manifested after pasting the set of all HTML tags from the website : Into the HTML editor and arranging them in a valid order (list is included below to speed replication) : Steps to Replicate : 1) Open Aptana Studio 2) Open saved HTML file 3) Paste above list of HTML tags into editor and begin to arrange in valid order. I continue to witness performance issues and Studio Actual Results : When I discovered this Sunday evening, several malfunctions occurred sequentially. First was a NPE, then a Heap error, and finally Studio turned unresponsive until shut down from the task manager and opened with a new workspace without the offending file, which does not contain an excessive number of tags Studio is representing this as an unbalanced tree. Below is the stack trace for the second error : !ENTRY 4 0 !MESSAGE Unhandled event loop exception !STACK 0 Java heap space at Method) at Expected Results : Files this size should not consume excessive resources.. The JavaScript window object content assist menu is missing many properties and methods. Steps to Replicate : 1) Open Aptana Studio 2) Open a saved JavaScript file 3) Type (without the double-quotes) Actual Results : The content assist pane only contains the methods Object, constructor, eval, isPrototypeOf, toLocaleString, toSource, toString, unwatch, valueOf and watch, the object prototype and the user type undefined. Expected Results : The JavaScript window object content assist menu should include closed, defaultStatus, document, frames, history, innerHeight, innerWidth, length, location, name, navigator, opener, outerHeight, outerWidth, pageXOffset, pageYOffset, parent, screen, screenLeft, screenTop, screenX, screenY, self, status, and top, and the methods alert, blur, clearInterval, clearTimeout, close, confirm, createPopup, focus, moveBy, moveTo, open, print, prompt, resizeBy, resizeTo, scroll, scrollBy, scrollTo, setInterval, and setTimeout.. If the end user invokes the command \"Convert HTML to HAML\" without the appropriate Ruby Gem installed, Aptana returns an error via the scripting console. Steps to Replicate : 1) Open Aptana Studio 2) Open a saved HAML file 3) Invoke the command Commands HAML Convert HTML to HAML Actual Results : The editor returns this message to the scripting console : Expected Result : The editor could return a concise error message.. Aptana Studio 3, build: Virtual Machine with Windows XP No confirmation sequence for this item : closing.. Aptana Studio 3, build: Ubuntu Confirmed PHP editor outline shows proper parent child relationships of nested nodes (please see attached capture. If you enter syntax errors in an XML document, there are no warning icons in the left gutter. Steps to replicate : 1. Open Aptana Studio 2. XML XML Template) and open new file. 3. In the XML editor, select all text and enter the following file content : Actual Results : There are no syntax errors reported in the left gray sidebar. Expected Results : The left gray sidebar should report invalid syntax.. Please see capture at The string in the JavaScript ruble are not evident in the Commands menu. Furthermore, the list of keys in the do not match the drop down menu list. Steps to Replicate : 1) Open Titanium Studio 2) Clone the JavaScript ruble and select the development branch 3) Edit the file, save and cycle Studio Actual Results : The file contains the edited values, however the JavaScript drop down menu has not changed. Expected Results : The commands menu should contain the new values.. ", "contenttype": "application/json", "created": 737358, "id": 40, "language": "en", "user_name": "jwitt", "email": "jwitt@shastaqa.com"}]}