{"contentItems": [{"content": "After upgrade the Biography text field either does not exist at all it is 1 or 2 pixels in height Upgrade paths: 1. build 290 2. build 290 3. build 290 run the above upgrade paths Log in as any user Go to that users profile Open to the Biography text box Actual Result: 1. Just dots no actual textbox appears There is a .JS error Uncaught is not function) (anonymous function) b 2. The Biography text box renders as a 1 or 2 pixel height text box 3. The Biography text box renders normally Expected Result: The Biography text box will render as it does on clean install after an upgrade.. SI: Web Request Cache Provider. Setup a 4 head web farm Drop a skin installation zip file into Install Skin path log into the site as host Append to the default URL Skin installs It shows up as installed under Host Extensions Installed Extensions It is in the and drop down lists on the Themes page (Admin Advanced Settings Themes) There are no errors in the Event Viewer or the file. See linked test case. Clean installation and 2 sites upgraded to latest Add 2 Registered Users Add the WebAPI test module to the site Create a new page Add the WebAPI module to it In separate browsers log in as the Registered Users and hit the WebAPI page Run Dev Tools or Firebug in the browser and do a Click the button View the cookie output in Dev Tools Firebug Expected Result: You'll see Value Raw Data. Try to create a page using every name listed as a. Install previous CTP (I used CTP 4 & CTP 7) Drop the upgrade package over top of the 2 CTP sites append to the URL of the site Put focus into the browser URL box Hit Enter The upgrade does complete There is an error in the UI - Executing Error! (see for more information) The log file - attached - has: (0x80131904): The object is dependent on column 'PortalID'. The index is dependent on column 'PortalID'. ALTER TABLE DROP COLUMN PortalID failed because one or more objects access this column. at exception, Boolean Action`1 at stateObj, Boolean Boolean asyncClose) at runBehavior, SqlCommand cmdHandler, SqlDataReader dataStream, stateObj, Boolean& dataReady) at methodName, Boolean async, Int32 timeout, Boolean asyncWrite) at completion, String methodName, Boolean sendToPipe, Int32 timeout, Boolean asyncWrite) String script) in 139 Error IF EXISTS( AND type in (N'U')) DROP TABLE dbo. After you hit link the site loads The same errors as listed above appear in the file There are no errors in the UI or log files when an upgrade is run. Install or upgrade to latest Platform 8 build (I used 634) Log in as Host or Administrator Go Admin Page Management Open each area and view the UI Some areas of the UI are left justified Some areas of the UI are not properly algined - Small & large icon areas of Page Management Appearance UI should match Platform. Install latest Platform 8 build (I used 608) Set Xcillion Template and add an Object Qualifier on the database After installation check the log file There's 104 KB of errors in the file 1st error listed below repeats 3 times 2nd error repeats a minimum of 12 times -03 - Could not load provider - Could not cast 1 to property UseDecorate of type String was not recognized as a valid Boolean. at value) at value, Type IFormatProvider provider) at settings, PropertyInfo property, attribute, String propertyValue) in 259 End of inner exception stack trace at settings, PropertyInfo property, attribute, String propertyValue) in 272 at mapping) in 169 at source, Action`1 action) in 861 at args) in 173 at cacheItemArgs, in 494. Install or upgrade to latest Platform 8 build Log in as Host Create a new page Set the new page to Edit mode Hover over Edit Content (pencil icon) Click on Images Click on Upload File Icon (looks like an oil barrel) Drag n' drop at least 10 files into the Drop file(s) here area of the UI Now you created the re-sized image Actual Result: We can resize the picture and delete the re-sized image but unable to delete the original image. Please refer to screencast : error in log file: - The process cannot access the file because it is being used by another process. at errorCode, String maybeFullPath) at path, Boolean checkHost) at file) in 47 Should be able to delete any image to which you have permissions. CKEditor should not be set as default Html Provider on Upgrades. Install or upgrade to Platform 8 build 542 or later using Log in as Host Go Host Extensions Scroll down to Providers Uninstall current CK Editor Provider Install latest build of CK Editor Provider from Create a new page Put the page in Edit mode hover over the edit (pencil) icon Click Edit Content Click the Image icon in the Editor Click the File Upload icon Drag n' drop images to the \"Drop file(s) here frozen Upload File Dev Tools Expected Result: freeze. Found while regressing DNN-7890 Install or upgrade to or later Log in as Host Go Scroll down to Uninstall current Install latest build of from Create a new page Put the page in hover over the Click Click the Image icon in the Editor Click the icon Drag n' drop images to the \"Drop file(s) here 404 Not found Expected Result: spinner icon* to show loading of the images is proceeding No 404 errors on missing images. Upgrade to latest Platform 8 build (I am using 540) Log in as Go In the tab click to expand Set AND s to use Basic Actual Result: The drop downs for all the are empty See. HTML Editor Manager CK Editor - Upgrade - Tool bar drop downs unpopulated. Install latest Platform 8 build (I am using 540) Log in as Go Manage Users Registered User Administrator Host Advanced Settings HTML Configuration Manager Main Settings Toolbars: Administrators Registered Users Basic Save HOME Pages Create new page Permissions Display Name Registered User Add Edit Module Update Host Administrator Edit mode Edit Edit Content Registered User Edit mode Edit Edit Content Host Admin Basic Toolbar Registered Users Registered Users Custom Toolbar* they always get the default toolbar. HTML Editor Manager CK Editor - Tool bar settings not respected for non-Host Admin Users. Install or upgrade to latest Platform 8 build (I used Build 535 Log in as Go Install latest build from Log Out Log in as Create a new page Set page to mode Hover over Select In the Editor click the icon In the tab click the button Nothing happens Standard Windows browse pop up renders. Editor not displaying. Install or upgrade to latest Platform 8 build (I am using 518) Log in as Create a new page or set an existing page to Hover over and select Click on the icon In the box click on button Upload at least 3 images Click the icon (immediate right of icon) At far right of the image preview click the (Z A icon) Actual Result: Sort does work regardless of which view I set or how many uniquely named images are in a view the sort order will always stay ascending. As with Edit Rights on a page Put a preexisting or new page into Edit Mode Over over Edit (Pencil icon) Select Edit Content Type in a couple of lines of text or add an image Click the Source button top left of the tool bar See The contents of the Rich Text Editor appear with the HTML code needed to render the proper formatting and taking up the same real estate as before Source button was clicked. CK Editor - Source button renders text on just half the CK Editor pop up. Cloud - Errors when uninstalling CK Editor Provider from Platform. CK Editor - Adding Image creates 2 dozen 404 errors on GIF's. Install or upgrade to Platform 8 build 430 Log in as Host Create a new page Set the new page to Hover over (pencil icon) Click on Images Click on (looks like an oil barrel) Drag n' drop at least 10 files into the area of the UI Now select 1 uploaded image At top right of the pop up click on icon In either the or spinners click either the up or down arrow Nothing happens, neither counter increments or decrements jQuery UI error in Dev Tools Firebug: TypeError: is not a Expected Counters and the selected photo is resized and saved if you click \"Resize Now\" If you click \"Cancel Resize\" all changes are discarded and you're returned to the Image pop up. Install or upgrade to Platform 8 build 430 Log in as Host Create a new page Set the new page to Hove over (pencil icon) Click on Click on (looks like an oil barrel) Drag n' drop at least 10 files into the Actual Result: Expected List of images is scrollable. CK Editor - Add a pre-defined template and click \"Preview\" get a 404 Not Found error & broken image. In Platform 8 any build log in as Host Create a new page Set page to Hover over Select In CK Editor click on (to the right of the print icon) Select Click button bottom of the pop up Actual Result: Template loads Broken Image icon is loaded After you click button bottom of the pop up you'll see this in Dev Tools Firebug: \"NetworkError: 404 Not Found - Expected Result: Template loads Placeholder image appears No 404 error. IE 11 - CKEditor throws a .JS error when color picking. which is now blocked by this bug I vaguely remember more than a single bug about this in years past in and Platform 8 I am unable to upload any icon file into DNN. In a Platform up to Platform 8 latest build log in as HOST Go to any place in the application that allows file uploads Try to upload an icon file - drag n' drop or browse to the file An error message pops up If I check I see .ico is listed In Dev Tools Firebug you'll see: POST 400 Bad Request 546ms (line 8526) \"NetworkError: 400 Bad Request - The file type is listed in it should be uploaded. BLOCKED - New default skin Xcillion. Duplicate of DNN-7731. Create a site w linked SQL database upload Platform 8 latest build Do not edit for database access Hit the site URL appears input password x 2 scroll to bottom of the page and input the correct SQL database information Click \"Install\" Actual Result: 18% the installation will \"stall\" Click \"Retry\" Installation completes 100% Click \"Visit Website\" Home page renders Error in triggered - Object reference not set to an instance of an object. at package) in 187 at in 5460 at providerPath, Version version, Boolean writeFeedback) in 5402 After you log in as Host you'll see there are 6 missing modules in the website: Event Viewer Languages Lists Newsletters Recycle Bin Site Wizard Expected Result: 1. Installation does not halt 2. No errors logged even after HOME loads 3. There are no missing modules. BLOCKED - Azure installation - Error in upgrade scripts. DDR Menu should use Client Resource Manager. Localization - If you cancel deployment of a Language Pack you get a in the UI. Install latest Platform build into Azure Websites Log in as Host Go Admin User Accounts Add a new user Check the UI Actual Result; New user created properly appears above the pagination control Expected Result: New user created properly No weird leftover HTML code in the UI Does NOT reproduce in Platform local or on-premise sites. BLOCKED - Extract Configuration manager into a separate module. BLOCKED - Extract Dashboard into a separate module. BLOCKED - Extract Console into a separate module. Appears to be an artifact of the fix for Content-3674 SCREEN CAST: Create a new Azure Content 8 site Log in as HOST Create Registered User, Content Editor, Content Manager and Administrator accounts Open IE 11, hit F12, then log in with any of the new users you created Leave this site up for 20 minutes Go back and try to use the site Actual Result: You have timed out so nothing is available However, when you try to perform some activity the page is completely frozen. You cannot navigate anywhere within the site is not triggered as it should be Even F5 or Ctrl-F5 is not allowing access to Expected Result: You're logged out and directed to the HOME page I'm only able to replicate this in IE 11 at this time If I get a regression case in another browser I'll update this issue.. Found while regressing DNN-7207 In a Platform 8 site log in as host Go Host Extensions Click on \"Available Extensions\" tab Under \"Modules\" click \"Install\" button for HTML Module Tick the box for \"Repair Install?\" Click the blue \"Next\" button until the installation is complete Now create a new page Remove the HTML module that is on the page when it's created Hover over \"Modules\" and click \"Add new Module\" Scroll right until you get to \"HTML Module\" Drag n' drop onto the new page Hover over the \"pencil\" (edit) icon and cacheItemArgs, in 547 Expected Result: The HTML Editor pop up renders There's no errors in Dev Tools Firebug or in any log file Notes: I do not see this behavior if I simply click the linked text \"LinkText\" in the body of the HTML module. Followed the steps above Tested and verified in Platform and Evoq w without localization enabled and as Host Admin users.. CLONE - Search: words does not work for content in DAM module.. In a Platform 8 build (I used 150) log in as host or admin Go Admin Dynamic Content Type Manager Create a NEW Content Type and Save it View the pop up message Actual Result: Alert \"The Content Type - undefined - was successfully Expected Result: Alert \"The Content Type - - was successfully Lorraine will need to document this pop up for DNN Help site. Screen Cast: In a Platform 8 build (I used 150) log in as host Go Admin Dynamic Content Type Manager Create a NEW Content Type and Save it Click \"Content Types\" image left side of the page In the \"Content Fields\" area click \"Add Field\" Fill in all the text fields and select any data type Click \"Save\" Actual Result: nothing is saved. The Content field area has no new rows in it Expected Result: New row containing the Content Field you added. Found while regressing DNN-5841 ScreenCast - reproduce in clean installation scenario Using IE8 hit a site that's upgraded to as Anonymous user In the search text box top right of the page enter 3 characters you know exist somewhere in the site EG: soc tes Once the search resolves and you get a result with a drop down list click on \"See More Results\" at the bottom of the results list Actual Result: The Search Results page does not open An error is generated: Webpage error detailsUser Agent: (compatible; MSIE Windows NT SLCC1; .NET CLR .NET CLR .NET CLR Fri, UTCMessage: 'undefined' is null or not an objectLine: 94Char: 25Code: 0URI: Expected Result: Search Results page. BLOCKED - Provide Multi-language Support for Adding Editing Content Fields. Blocked - SI: User registration fails because of non-existing culture value is passed. BLOCKED - Add a new Template for a Content Type. SMTP Server config test email does not have 'DNN' in the email subject line if installed in fr-FR. Evoq Products - clean install or upgrade log in as an authorized user Append to the site URL and ute Expected Result: You end up on a Google results page that shows this issue in the results set ;). BLOCKED - Implement OAuth Authorization Code Grant flow. BLOCKED - Implement OAuth Implicit Grant Flow. Blocked - Icon not reset in Admin - Page management. EVOQSOCIAL: Installation progress UI stopped at 29%. BLOCKED - Allow user to create AppID App Secret. Blocked - Create HMAC Authentication Attribute. I saw this the very first time I went to deploy any Language Pack I selected Spanish and clicked the \"Deploy\" button Now that it's changed state in the system I cannot reproduce the behavior In latest Platform build log in as HOST Go HOST Extensions In Language Packs areas click \"Deploy\" for ANY available Language Pack After initial pop up renders click the \"Cancel\" button at bottom left Actual Result: An error appears in the pop up In this error shows up: - is currently The directory is not empty. at fullPath, String userPath, Boolean recursive, Boolean at fullPath, String userPath, Boolean recursive, Boolean checkHost) at sender, EventArgs e)\". Found while regressing DNN-6377 Install latest Platform build as FQDN site w remote SQL database Log in as Host Create a new page and give View permissions to Registered Users Put the Member Director on the page Create 2 new Registered Users Open up 2 different browsers Log in as the new R U's in each browser Hit the Member Directory page Each R U friends the other If you perform the friend activity for both R U's within a couple seconds the R U who friends last will see an error in the UI: \"An error occurred while processing the request: error\" If you have Dev Tools Firebug running this error will apear: 500 (Internal Server Error) In the file you'll see an error similar to this: - Relationship already exists for Initiating User '3' Target User '2' RelationshipID '1'. at initiatingUser, UserInfo targetUser, Relationship relationship) in 345 at initiatingUser, UserInfo targetUser) in 105 at postData) in 289 Expected Result: The Friend Request is made and completed without error. When using the profanity filter, the value that is matched on is treated as a regular expression, not as text. I'm assuming that this is unintentional. h3. Steps to reproduce Go to Site Settings and turn on the Profanity Filter in the User Account Settings tab Go to the Lists page (under either Admin or Host) and edit the list Add an entry where the text is (any value is fine) Log out and click the Register link Attempt to register with \"find this\" or \"findXthis\" in the username or display name h3. Actual Result - message indicating that the name is invalid h3. Expected Result - the registration is successful. After installing DNN portal, trying to navigate to \"Help- Getting Started\" link will lead you to 404 error page with the below path.. Admin - Users - Edit User Accounts - Security Role drop down does not work in Chrome. DAM - Tab title shows as if you view Admin File Manager. THIS DOES NOT REPRODUCE in release code Install latest build as FQDN site w remote SQL db Log in as Host Set SMTP server to send to a known, good SMTP account Run the SMTP server test to verify email is received the email account Create 1 new Registered User In a separate browser log in as new user Go edit the user profile to add Salutation, First and last Name and country plus add a Biography Save these changes As Host go Host Scheduler Click edit for \"Messaging Dispatch\" job Tick the check box for \"Catch up Enabled\" Save Check file Actual Result: Every 10 seconds this error will be logged: - Object reference not set to an instance of an object. at userId) at template, String messageBody, PortalSettings UserInfo recipientUser) So now, the site file grows exponentially function emails out of the system continue to work as do new user registration emails Expected Result: Editing this job should never result in errors. function emails out of the system should continue to work as do new user registration emails. Go Admin Taxonomy Create tags for Simple Application & Website Create tags for Hierarchy Application & Website Save all tags Create a new page and verify the tags created appear in the Tags drop down (don't add any) Go to a pre-existing, copied or newly created page and check the Tags drop down Add any visible tag Go to tab and click (causes a postback) Now return to tab Expected Result: Regardless of tag selected it always persists once selected If you save the selection, navigate away and return the tag selection persists. A comment with security level 'Developers' was removed.. Install Suite in Azure Websites Log in as Host using CHROME Version m w Dev Tools active Create new user and assign them to Administrators Group In new browser hit the site and log in as Admin As both Host and Admin hit Admin Advanced Settings Lists View Dev Tools output Actual Result: GET 404 (Not Found) (anonymous function) GET 404 (Not Found) (anonymous function) Expected Result: No 404's or any other errors Notes: I only see this in Chrome not any other supported browser Upgrade to Version m and the both 404 errors go away. 404 page management not expsed in UI. This same test works in but not in Install latest build Log in as HOST Create another user assign them to Administrator Role Open new browser and log in as Admin In both browers go Admin Advanced Settings Site Redirection Management Click \"Create\" Click the drop down in the pop up Actual Result: Drop down does not drop down In Firebug or Dev Tools this error shows up: TypeError: is not a function (line 678) Expected Result: Drops down showing a selectable list of pages within this site Works in is broken in. Found while regressing DNN-5153 Control Panel visibility for Module Editors depends on for the of the modules in the page, which does not make any sense. To test the problem: install DNNFAQ from codeplex and verify on host Extensions that the for the module is set to -1 create a page and put the DNNFAQ on it. Verify that there's no other module on the page set the module have edit permissions for Registered users under admin - Site settings, verify the control panel visibility is set to be \"Module Editors\" create a new regular user login as the user now hover over \"EDIT\" and click \"Edit Page' Actual Result: Once you click \"Edit Page\" a pop up appears. It never fully renders It goes away The page is never set to \"Edit Mode\" Expected Result: The page is set to \"Edit Mode\" The Registered User is able to edit the module SCREEN CAST:. Site Redirection Management - Log in via Mobile device is error prone. BLOCKED - BMP images cannot be set as profile picture. This is reproducible in Plaftorm build 352 I registered 2 new users I set FName LName to \"Public\" with text for each more than 3 characters I saved the change I opened a NEW browser and logged in as a Registered User Hit the Member Directory page The listing for the user with FName LName is NO different than the user with default empty FName LName entries. is not localized on edit profile property screen. Install latest Social install package as FQDN site w remote db and dnn as Object Qualifier Load the site via the Load Tool: Log in as Host Hover over 'Pages' Select \"Create new Page' Enter all required fields and use 2 words with a space between the 1st and 2nd word for the Page Name and Page URL Tricky Dicky Instead of TrickyDicky OR Tricky Dicky Click \"Create Page\" button Actual Result: I get a 404 error in the pop up - see attachment When I clear the pop up the Home page does not auto-refresh and the new page is not listed in the Nav area When I manually refresh the Home page then the new page appears in the Nav area Expected Result: Page is created and the Home page refreshes when you've clicked the \"Create Page\" button Page is immediately accessible via the Nav area Page loads without any error. Regressed in Platform used this bug to try to regress DNN-19668 and I get a slightly different error: - error has Couldn't load menu style Illegal characters in path. at path, Boolean at access, control, String pathListOrig, Boolean Boolean needFullPath, Boolean copyPathList) at access, String pathListOrig, Boolean Boolean needFullPath, Boolean copyPathList) at access, String path) at virtualPath, VirtualPath Boolean at path) at manifestUrl) at menuStyle) at menuStyle) at e)\" - Missing localization key. userlan: - error has Object reference not set to an instance of an object. at writer)\". Install latest Platform build as FQDN site w remote db Log in as Host Add 1 user Go Admin - File Manager Create a new folder Upload a bunch of docs to this folder Synchronize File Manager (sub-folders and this folder) Create a new page Edit the page and in HTML editor add at least 2 documents Add a paragraph of text with a specific phrase of at least 3 words Save all Take the page out of edit mode Go Admin Advanced Settings Search Admin Run Re-indexer Hit site in different browser and log in as user you added in Step 2 Search for the specific phrase you added to the HTML editor EG: \"Live is fun\" with the quotes! Actual Result: Search finds the results for \"is\" and \"fun\" Search does return results for the phrase \"Live is fun\" Expected Result: Search finds and returns the exact phrase \"Live is fun\" and the corresponding page Search does not find and return matching words within the phrase This was logged in the linked issue Social -27041 but was ignored not commented on when that issue was worked.. Install Platform latest build as FQDN site w remote db Log in as Host Add a bunch of files via Admin File Manager Synchronize the File Manager (Sub-folders and this folder) Create a new page Set page into Edit mode Hover over the pencil icon top right of the HTML module Click \"Edit Content\" In the HTML module hover over the Media manager (paper clip icon) Select \"Document Manager Select 1 of the files you previously added via File Manager Repeat file add so you have at least 2 files linked in this HTML module Click \"Save\" Take the page out of Edit mode Go Admin Advanced Settings Search admin Click on the \"Re-Insex\" button Once re-indexing has completed click on the \"Awesome Cycles\" logo do a wildcard or doc* no error is thrown and you get a proper response in the \"No Result\" if no match A list of matching results. Cannot add a module to a non en-US copy of an en-US page. Setup: installed as FQDN site w remote db At least 5 languages installed 1 of which is 3rd party from: Party Packs I used the Mexico (Spanish) LP Log in as HOST Click any language flag to reset your language from English (en-US) On the Home page hover over \"Pages\" and Modules dropdown select \"Add Module: Hover over any module and left click then drag and drop onto the page Actual Result: I cannot add any module onto this copied page This behavior works if I switch back to English and reload the copied page but not on a non en-US copied page I get NO errors anywhere Not in the browser Not in the file Not in the Log viewer of the site Expected Result: Drag and Drop always works regardless of language used SCREEN CAST:. Install latest Platform, Content or Enterprise as FQDN site w remote db Log in as Host Go Host Host Settings Other Settings Scroll down and tick the box for \"Enable Content Localization\" Click \"Update\" button bottom left of the page Go Admin Advanced Settings Languages Click \"Install available languages\" button Click \"Deploy\" button for 1 or more languages and run through the install pop up Now go out and get Party Install this LP While the localization process is ongoing view the \" text Actual Result: NaN% Expected Result: A time value of seconds minutes and seconds hours, minutes and seconds EG: 5 seconds 5 minutes and 34 seconds 2 hours 10 minutes and 49 seconds. Using IE 10 do a FQDN install w remote db using dnn as Object Qualifier After installation click \"Set Advanced Configuration Settings\" in the 'Welcome to Your Installation' pop up Set the SMTP server, save the setting and click \"Test STMP\" button After you get a positive response that the config email was sent click the \"Cancel\" button In the 'Welcome to Your Installation' pop up click the 'X' at top right Actual Result: I get a Script error in Dev Tools: SCRIPT5011: Can't ute code from a freed script The pop up does not close Every time I try to close the pop up the script error repeats Expected Result: No script error The pop up will close and page will render Clicking F5 twice will finally clear the pop up and load normally. Install latest Platform build Log in as Host Go Admin Site Settings Actual Result: In the UI: A critical error has occurred. Attempt by method to access type failed. In file: - Attempt by method to access type failed. at ) definition) at definition) at definition, at definition, at definition, at definition, IEnumerable`1& exports) at definition, at definition, at provider, ComposablePart part, definition, at partManager, IEnumerable`1 imports, at partManager, ComposablePart part) at partManager, ComposablePart part, Boolean at part) at action) at batch) at attributeParts) at e) control, Int32 index) at Boolean - Object reference not set to an instance of an object. at e) - Object reference not set to an instance of an object. at e) Expected Result: Site Settings loads without error and is usable. is called for all versions from. ", "contenttype": "application/json", "created": 737358, "id": 26, "language": "en", "user_name": "KenGrierson", "email": "-"}]}