{"contentItems": [{"content": "This is not a regression as it can be reproduced with titanium sdk When an android app is run with live view, errors indicating that cloudpush module information cannot be found are thrown on the console when the app tries to re-launch with the changes when the app is run again on the device, it installs and launches successfully with the new changes made. Steps to reproduce: 1. Run the attached (include cloudpush module in Liveview enabled on to a device 2. Make changes in eg: remove one of the commented lines on line 49 or 54 and save 3. Run the app again by clicking 'Run As' and select the device again Actual results: 1. App is launched on device with a button \"Register for push notification\" o`n the center. 2. the following error is produced in the console and device displays the splashscreen 3. The app launches successfully. Expected Results: 2. The app should be re-launched with the new changes.. Don't allow to edit organization name in the Splash screen org prompt dialog. Studio org selection prompt allowing to edit the org name Org selection combo should be read only - this also applicable for auth code selection dialog. Studio should rely on CLI to find updates. Non-modal dialog for submitting JIRA ticket from the studio. As we are removing Samples View from Appcelerator Studio (TISTUD-7602), we should also remove the Samples view core and UI plugins from studio.. Need to update the Studio crash reporting feature dependency eclipse plugins in the jenkins box for master and slave machines. mylyn eclipse emf Google guava Both master and slave need to be updated. Need to find the effective mechanism to do this - either setting up a local jenkins slave in the Singapore office or directly modifying in the slave machine.. Update Studio Jenkins with the studio crash reporting eclipse dependency plugins. With and nightly installed, Studio update says Latest Titanium SDK already installed and does not install Renaming the folder to or the original does not fix it. Removing the folder does. I traced it back here, but can't really tell why it thinks is already installed: Looking at the code for and it should find as my latest SDK. So then something must be wrong with which uses Logs to help debug the current issue:. Avoid force update if studio doesn't find the required cli information in the file If doesn't have required CLI information, studio is forcing to update everything. : Studio shouldn't ask for force update if CLI version info is not defined in the means, \"Remind me later\" button on the update wizard should be enabled. This is the effect of TISTUD-7705. * Why don't we have an option anymore to link an existing Xcode project? !Screen Shot at. Remove hardcoded node version from studio, rather show it as \"Latest\" in the update wizard. 1. Make sure you are not on the node version which is supported by studio. Anything lower than is min node version supported) 2. Check for Appcelerator updates from Studio through \"Help- Check for Appcelerator Updates\" option 3. Studio will show update wizard with various updates which are available. 4. Look for node version, it shows is the latest version but it installs when I choose to install. : As studio can't identify the latest node version from link, it's better to show \"Latest\" as a version text and install whatever is available.. eclipse error reporting test plan:. JIRA ticket creation will fail from studio if we select the severity to 'None'. JIRA ticket creation will fail from studio if we select the severity to 'None'. Request from We've long had an enhancement request related to making this wizard \"smarter\" about fields like this in terms of: Remembering previous values for company URL app id prefix. It's small, but useful improvement. - - Like what is typical for java package names. Studio freezes for a while when we open a file where the project org does not belong to the current logged in user. iOS app is getting failed with Mac OS El Captain(I am not sure whether it's an OS issue or not, but debugging used to work properly with an earlier version). Below is the error which is thrown. 1. Create an alloy classic app 2. Run with \"Profile or Debug\" for iOS Simulator App is unable to run either in debugger or profiler mode. And, app is not getting launched in simulator. Please find the console log:. The Status controller now shows user name along with their active organization in the tooltip. It tries to load organizations and then, show the active org name in the status. Since loading the orgs happens in UI thread, it slows down the startup time of Studio (it spends more time loading in splash screen). For showing username org in the status bar, we should load orgs in the background thread. So, we should never loads the orgs in the main thread.. During the studio startup, studio prompted an error message \"Unable to locate the CLI utable. Please restart Studio or use Help Check for Appcelerator Studio Updates to install Titanium CLI \" This happens when system does not have appc core setup but having node and npm modules. I can see this only in windows operating system.. \"Unable to locate the CLI error during the studio startup. On Login splash screen \"Remember my Email Address\" label foreground color looks black on windows and white on mac os. Ideally it should be white. Looks like Windows os doesn't respect the foreground color for Button Button with checkbox Expected: \"Remember my Email Address\" text name on splash screen should appear in white color in Windows OS.. During the studio update check, verify whether system is having minimum required version to If the minimum required version is not found then show the update site wizard with node as a prerequisite.. Installers: Update with the new version. Update with the new version Current url: New url: Let's use generalized url so that we need not change every time in the installer URL: update the existing url to point new version. is thrown when Xcode does not have any watchos 2 simulators. Please find the attachments for iPhone log and studio log. If anyone tries to use Studio with SDK then it completely fails to parse ti info output of iOS. It should have defined the version range of compatible SDK's, and if the installed SDK doesn't fall under the range, then it should prompt the user to update Studio or, SDK accordingly. Similarly case for Studio has the prerequisite of SDK. Watchos2 app section is getting disappeared from tiapp editor after creating a new watchos2 app. Watchos2 app section is getting disappeared from tiapp editor after creating a new watch os2 app through ti app editor. Steps: 1. Open any sdk editor. To get it back, we have to close the editor and re-open it. Actual: Watchos2 app section is getting disappear after creating a watchos2 app. Expected: Watchos2 app section should not disappear and it should show the app location in tiapp editor.. Consolidate titanium user and titanium360 user in studio. Currently In the studio codebase we are maintaining titaniumUser and so as part of this ticket will consolidate the functionality of both.. Remove Samples View from Appcelerator Studio. Please find the output below.. 1. Logout logout -D) 2. During the studio startup, it will ask for the login credentials. 3. Enter wrong user name and password Example: enter wrong user name \"kkk\" and password 4. Studio again prompt with login dialog since we entered wrong credentials. 5. This time enter correct credentials 6. Studio will login and observe the logged-in user name in status bar, it will show the wrong user name \"kkk\", which I entered for the first time.. Merged into master and cherry-picked into release and development branches.. Can we show notification message on the eclipse bottom right. Something like how we show Studio updates are available. This notification dialog will disappear automatically after 2 sec. Please find the attached screenshot.. ", "contenttype": "application/json", "created": 737358, "id": 86, "language": "en", "user_name": "kkolipaka", "email": "kkolipaka@appcelerator.com"}]}