{"contentItems": [{"content": "Distribute - iTunes Store option opens Xcode Device window instead of Organizer window. titanium build command fails for the flags and if there are no path values specified. The behavior of flags are described in following table based on the test result. command behavior ti build -d CLI crashes ti build (if current directory is a project directory) build success ti build ( if current directory is not a project directory) CLI crashes ti build -A CLI crashes ti build build success with default android path ti build (without valid android path settings) Invalid SDK path error is thrown and prompting for new For more details, please refer the attached screenshots. This is since issue is occurring in CLI GA as well.. JS content assist does not show dotted properties in Technically this is since GA also shows the same behavior. But GA Release works as expected. h5. Steps To Reproduce 1. Create a classic default app 2. Paste the following code in file 3. Place your cursor at the end of line 8 in file 4. Press Ctrl+Space shortcut h5. Actual Result Content-assist is not open. It's just placing the word instead of opening several suggestions in h5. Expected Result Content-assist window should open. It works fine in GA release.. Yosemite: update is not listed in Studio update wizard. Unable to preview mobile web projects in Android Emulators. (!) This is a since same scenario is observed in GA. h5. Steps to reproduce 1. Create a mobileweb app 2. Run in emulator ( Run As Mobile Web Preview: h5. Actual Result Console log says project is built successfully. There is no sign to failure but . Please see the Following log is observed in Studio log file h5. Expected Result Mobileweb app should run in Emulator as it's appearing in Context menu.. Code Processor is not working If I don't have Android SDK set up on my machine. (!) This is since issue is there in GA as well. h5. Steps To Reproduce 1. Remove the Android SDK path from your Studio Preferences (Studio should not detect any Android SDK from your machine) 2. Create a project 3. Run code Analyze for any platform (iPhone or Mobileweb) h5. Actual Result Code Processor fails with an error message. Please see the Following log entry is observed in Studio log file h5. Expected Result It should generate proper html report.. Studio shows an Empty Preferences window when there is an error message at pervious load. It's an intermittent behavior. I can always reproduce this on my machine with RC studio. But I couldn't reproduce for Studio GA in my machine. Anyhow, we observed the same scenario in another machine with GA Studio. h5. Steps To Reproduce 1. Open the studio. 2. Go to Preferences Studio Platforms iOS 3. Delete the Xcode from your machine 4. Press the refresh button from your studio preferences window Now it should show an error message (refer attachment 5. Press OK button on Preferences window 6. Open Preferences window again ( Use Menubar option Preferences Studio Platforms iOS. Don't use shortcut to open preferences window. It doesn't contain any memory regarding last opened h5. Actual Result Empty Preferences window is opened. Please see Screen Shot at and Screen Shot at h5. Expected Result Studio should not open Empty Preferences window. It could open a window like h5. Workaround Open the Preferences window using shortcut (Cmd + , ) in Step 6.. In Appc-Studio Alloy menu shows class names instead of actual component names. For example: It displays instead of For more idea about the issue, please refer the attached screenshots. This is a since it does not occur in Appc-Studio GA. h5. Steps to reproduce: Install Appcelerator Studio and create an alloy project. Right click on the project and select on. Linked the issue TISTUD-3101. Verified the fix. Closing the ticket 1. Created 4 Alloy projects and 4 Classic projects into workspace. 2. Cleared the studio log file. 3. Opened all the .js, .xml and .tss file into editor. 4. deleted all 8 projects from workspace and from disk. 4. Error log is still empty and no other error signs observed. Test Environment: Component Version Appcelerator Studio Titanium SDK Node ACS Alloy CLI OS OSX Xcode 6-beta6. ", "contenttype": "application/json", "created": 737603, "id": 92, "language": "en", "user_name": "kvelummaylum"}]}