{"contentItems": [{"content": "You need to enable \"isSecure\" in Page settings, AFAIK this is by Design, if you enable \"force SSL\". the Flag is not really self-explaning and not sufficient. If you continue the life-cycle of a file on a website, there will be a time when a cleanup is planned and a cleanup workflow identifies files to be deleted, another flag would be needed or \"Deleted\". Instead of a boolean flag I suggest a \"PublishState\" (tinyInt), where the different states can be stored (and a master table FileStates, where states are explained).. Given the delayed release of the upgradeable build support should be backported from DNN 8 to DNN to support a beta release of DNN This should port DNN-6919 and DNN-6998 to DNN. SI: Soft Deleted Modules Show When Adding Existing Modules In Other Site Group Portals. Wrong version Number for Extensions covered in Core Language Packs. 1. install DNN in German or Spanish 2. check Host Extensions, (hide section \"Modules\" and) expand section \"Extension Language Packs\" Expected: All Language Packs for Core Modules state version Actually: All Language Packs for Core Modules state version Install Platform as FQDN site w remote SQL database Log in as HOST Add Aura Theme package Set Aura as the Theme across the application Add Member Directory to a page Add Rev-Index to a page Upgrade this site to Platform latest build Log in as HOST Go Host Extensions Click on the \"Available Extensions\" tab Expand \"Languages\" Deploy German language Go Host Host Settings Other Settings Enable Languages - tick the check box for \"Allow Content Localization?\" Click the blue Update button at bottom left of the page Go Admin Languages Enable German (Version Click the blue button at top right of the localization grid to set localization Go Host Extensions Scroll down the page and expand \"Extension Language Packs\" Actual Result: There are multiple entries here seems like 1 for each major module? They all show as version? DDR Menu Device Preview Management Digital Asset Management Client Capability Provider HTML Journal Member Directory Message Center RadEditor Manager Razor Host Site Redirection management Social Groups Taxonomy Manager URL Management Expected Result: 1 Entry for de-DE (German) version. SI: clearing datetime user profile property field does not work. DNN-5712 sounds to be a similar situation. Value of DNN control always returns true. So DDR menu settings IncludeContext and IncludeHidden are now always true and displaying every page in menu. DNN-6468: Also all are 2 times submitted to the database when saving Even if they are the same. In this was 0 times if value were the same. See SQL update setting N';Exec N';Exec N';Exec N';Exec. Cache settings in Default Website Templates. Search results module CSS incorrectly injected. DNN adds a misnamed FK, which is not preceeded by proper deletion of object with same name, which prevents the script to re-run. Later in the script, a new FK is added w o deleting the previous one. the upgrade script deletes an index, w o checking for it to be existing. this might affect re-run.. File Manager Missing After Upgrade. Typo in contains improper HTML tag. file key contains \" P\" instead of \" p\". it would be helpful to ensure, all html tags in all resource files are lowercase and xhtml compliant and ). there appears to be a typo in file Key MS Word in not recognizing the word \"nubmer\". Same error in. should support parameter value of -1 for robustness: CREATE PROCEDURE Int Host files ASGO. SQL update script needs to check existence and add a FK with proper name: ( AND name ALTER TABLE DROP CONSTRAINT GO ALTER TABLE ADD CONSTRAINT FOREIGN KEY REFERENCES GO See update file attached to DNN-3782. Optimize Procedure - Performance - readability - for paging see DNN-3593 For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4326\".. Optimize Procedure. Optimize GetOnlineUsers to suppress duplicate columns etc. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4321\". (UserPortal columns removed, duplicate columns suppressed, portal groups support added). Optimize for Performance. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4317\".. Improve stored procedure to use a single select statement. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4315\".. Please improve procedures - - - - - - - - to make sure to add null instead of -1, where appropriate. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4313\".. Please add view for performance and easier editing of procedures. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4312\".. Please improve performance of view vw Users. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4311\".. Optimize View vw Lists for better performance and reading. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4310\".. Optimize Views and to use inner join (based on FKs from DNN-4288 and DNN-4291). For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4309\".. Please add a new helper function UserIsInRole, that returns, whether a user is currently member of a role or social group. This avoids redoing all checks for membership being effective in procedures with the risk of forgetting it. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4308\".. Please add helper function that can be used to inject displayname easily into any result set, that includes UserId, without the need of linking to user table. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4307\".. Please add Helper Function which splits a single string. passed as parameter with delimiter into a temp table with all IDs contained, that can be joined with other tables. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4306\".. Please add a new helper function MasterPortalId to retrieve master portal for a portal. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4305\".. Optimize Function For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4304\".. Helper Function GetSortSQL does only support a single sort field, limiting it's use. I suggest adding Function SortFieldSQL with same signature, which may be called using True, ''), 'ORDER BY or ('Order By True, True, ''), '', '', ''). For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4303\".. Add Helper Functions and TemplatedString. Add Helper Function for easier string handling as in .Net or TokenReplace: 'Hello returning 'Hello World!' Add Helper Function for same purpose with up to 5 params, by 'LastName', 'FirstName', '' '' '') returns \"Order By LastName, FirstName\". For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4302\".. Function should return results properly sorted. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4301\".. Add a new function to determine, whether a user may view content of another users property, if extended permissions (per social group or relationship) are specified. Function will be used in stored procedures to retrieve proper profile property content. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4300\".. Add a helperfunction to retrieve RoleID of Administrators for a website, which can be used in Stored Procedures. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4299\".. Table TabUrls is missing an FK on tabs to implement cascade delete. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4297\".. Table Tabs has two misnamed indexes, which are not following DNN naming conventions. These should be combined and extended for optimized access. For implementation see TurboSQL script vor DNN (attached to DNN-3782), search for \"DNN-4296\".. Index should include columns for performance. Add an index for to improve search indexing in DNN and above. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4293\".. should include columns for performance. Add index on For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4292\". Adjust names of foreign key contraint from Permission tables on users. There are foreign key constraints from Permission tables on users table, which do not follow current naming convention. For please see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-4291\".. The copy page does not work from a language different than en-us If you trying to copy page from different than the default language you have only possibility to create a new page not copy of the page. Without Content localization enabled, we should have the same copy of page from any language This issue was introduced in before in we have a different behavior the copy pop-up is opened, it is empty, and we dont have possibility to make copy with content. But the actual structure with module is copied in Steps to reproduce: 1. Install the latest DNN 2. Add a new language (deutsch) 3. Go to About Us page 4. Click Pages- Copy page Actual result Expected result the copy page pop-up is open 5. Close pop-up 6. Click on German flag 7. Click Pages Copy page Actual result Create a new page pop-up is opened Expected result the copy page pop-up is open. typos in keys and. \"Choose File\" in XmlMerge missing translation. Lists: for hierarchical lists, omit parent list path in list tree. When adding a list, you may specify the parent, but not the item of the parent to be used (Field is locked). Instead, list name should be locked, because parent name is used as list name in this case. Steps to reproduce: Install DNN Login as superuser go to Lists in Host menu click Add list select Parent list \"Countries\" Ignore input field validation Expected behavior: you are able to select country, you want to add a region for Current behavior: no parent selectable :(. if a user is removed from a single website of a DNN install, are not deleted, which needs to be fixed. For implementation see TurboSQL script for DNN (attached to DNN-3782), search for \"DNN-3594\".. Perfomance and other Issues in Stored Procedure. ", "contenttype": "application/json", "created": 737603, "id": 30, "language": "en", "user_name": "leupold", "email": "-"}]}