{"contentItems": [{"content": "Web Browser : Viewing the analytics in the studio browser window crashes the studio after closing the window.. 1. Create an alloy app & set a breakpoint in the file in the app 2. Run debug on device & emulator result: 1. The app gets installed & the debug session starts successfully but the breakpoint is not hit & the app does not halt at the breakpoint. Result: 1. The breakpoint should be hit & the app should halt at the breakpoint. NOTE : I used the default alloy app from studio template for testing.. Android : Studio does not have an option to create & support an android keystore with different keystore & key password. any app in studio for android device. the build & launch process. Result: 1. We get error & the build process fails: Result: profiling process should be successful & not fail because of error.. a project not created in the studio you are using, from any where in the filesystem or put it in the workspace & then import scenarios) studio go to \"project clean\". Result: do not see the app in the app list to be cleaned. a double confirmation, build the app so that it has a build folder & now try to still wont see the app in the to be cleaned list. Result: should see the imported app in the list to be cleaned.. Appc studio shows some messed up UI in multiple studio views. tried updating from an older version as well as downloading a fresh install of appc studio & can reproduce the issue. to or download appc studio studio,select workspace & do login etc. studio opens up look at the different windows like project explorer click on any project in the project explorer & observe. Result: see some messed up UI in multiple views(please refer screenshot for more details). Results: should not see any messed up UI.. Description: 1. BlackBerry has changed the flow of how we can get and install BB 10 NDK because of which no new user(who is setting up his machine for BB development) can make use BB for development in titanium or appcelerator studio. it used to be done the change): get the BB 10 NDK from the BB developer website link : provided in the appcelerator docs for BB. the NDK manually. studio to the NDK folder installed in the above step in preferences & viola everything was fine. new flow & how does it affect building apps using studio for BB: we go to the link to download the NDK, there is no way we can download just the discreet NDK. have to download first (rather forced to) the momentics & from within momentics install our desired BB NDK. issue with this is , the momentics installs the NDK inside the package contents of momentics app which is not possible to put in studio preferences (Also its not a good work flow for a new developer). Because of this we are not able to setup studio for BB 10 development. 2. They also have changed the flow to get the signing keys. Now it is done through momentics or through the website. In both cases you have to register for blackberry ID & then only can get the signing keys. Description: 1. First make sure you have the tizen sdk installed & have configured tizen sdk in the studio 2. Go to create new app in titanium or appcelerator studio 3. Select the appropriate type of app classic or alloy 4. Notice the tizen deployment target Actual result: 1. The tizen target is greyed out Expected Results: 1. The tizen target should be enabled after its configured in studio pref's. I was testing tizen setup instructions for the tizen release & had tizen required software installed before I saw this issue. Description: the nightly studio to the latest an app target as android in Actual result: build fails. log is as follows; Expected Result: build should succeed on device & simulator. Description: on create new titanium app the desired template next in the 'deployment targets' options Actual result: see 2 target options for 'Tizen' & 'MobileWeb' Note: You will see the duplicate targets in the for the older app's created on previous versions of studio Expected Result: should see only one target option for tizen & mobileweb respectively. This has happened to me 4-5 times as of now Description: the version of studio mentioned in the environment & run some apps the performance of studio Actual Result: studio becomes sluggish & we get the out of memory error We get the following errors in the log: Expected Result: studio should run properly. BlackBerry : The 'BlackBerry' folder in resources is not created when we select other targets along with blackberry,it throws errors. Opening for already present apps after updating to studio beta gives us error 'Could not open the editor: An unexpected exception was. ", "contenttype": "application/json", "created": 737603, "id": 98, "language": "en", "user_name": "lokeshchdhry"}]}