{"contentItems": [{"content": "A comment with security level 'Developers' was removed.. improve use and performance implications. Currently we disallow fetching of tarballs from incomplete NPM packages, where a package is considered as incomplete if it has at least one version which doesn't define a tarball distribution. We should instead just disallow fetching of tarballs whose specific version is incomplete, rather than ban the whole package whose versions might all be complete except for one incomplete version. Recreate instructions: Accessing chokidar package root should pass: curl ' Accessing chokidar package root should now fail: curl ' * Accessing chokidar tarball should also fail: Original cause: the npmjs registry root declares basic version metadata for all packages, and Nexus distributes this partial metadata across the package roots when the registry root is fetched. If you then request a particular package root (say chokidar) Nexus will overlay the full package metadata with the partial metadata from the registry root. For almost all packages this means that the partial version metadata from the registry root is replaced with full version metadata from the package root. However, the chokidar and phantomjs packages each have a version listed in the registry root that doesn't appear in their package root. This leaves an incomplete version in the merged package root, which then causes nexus to fail to serve any tarballs from that package. Acceptance test: with this fix these last two failures are fixed.. At the moment we always merge the downloaded package root with previously cached content. This can end up leaving bad entries in the cache even after they have been removed from the upstream proxy. See NEXUS-8625 for more details about the original cause of the bad metadata. We should instead replace the cached content with the downloaded content.. support distinct artifactMaxAge and metadataMaxAge settings in NPM. See NEXUS-8221 and NEXUS-8178 The bad checksums are based on the first 8 bytes of the item plus the full content of the item. The task should search the item context and attributes for checksums that match and regenerate them.. Create a task to find and fix bad checksums affected by the extra link detection check. Note: databases created by OrientDB are compatible with OrientDB. Typos in \"Smart Proxy: File Event Sink\" capability About. Update the example email address. provide a method to rebuild the npm metadata from storage data for hosted repositories. CLM server password is not removed from support tool zip configuration. Querying NuGet proxy with no $top parameter causes excessive caching. I noticed this when manually testing NuGet with curl. The code that runs the new pass-through queries against the NuGet proxy will automatically page through all results that match the query rather than stop at the first page. This means that if you get the \"Packages\" feed using curl with no query parameters it will attempt to page through the entire NuGet proxy feed and not come back for several minutes. This could explain the longer query times occasionally observed in the field, because we'll be fetching all matching entries rather than stopping at the first page of results. However, the next time the query is run it would be faster because we've pre-fetched all subsequent pages. If possible we should take exactly what's returned from the NuGet upstream feed and not follow \"next page\" references. This should just be a matter of tweaking the feed scraper.. Unpack and start Nexus Delete the internal user * Exception will appear in log:. Improve sorting of NuGet results when no order is specified. Provide our own implementation of Karaf's startup Lock. Code housekeeping: make sure all NuGet DB problems are logged. Not all operations are logged on failure. PermGen OOM in on Windows (caused hang during tearDown). Opened pull-request for the solution, since it is consistent with all the other Nexus tasks and is therefore also more tested. See. ", "contenttype": "application/json", "created": 737358, "id": 71, "language": "en", "user_name": "mcculls", "email": "-"}]}