{"contentItems": [{"content": "If there is a \" \" in it, which becomes a matcher in bash and therefore subsequently gets expanded into the list of in the current directory. In order to avoid this mess, we need to wrap such variables in quotes, like so: .. Add an additional template parameter to the class template.. Account for reserved resources in the quota guarantee check.. Include allocated portion of the reserved resources in the quota role sorter for DRF.. Include the allocated portion of reserved resources in the role sorter for DRF.. This ticket is regarding the libprocess gtest helpers in . The pattern in this file seems to be a set of macros: of 15 seconds for of 15 seconds (1) should be added for completeness. (2) In , we've got as well as the -specific versions: and . We should adopt this pattern in these helpers as well. Keeping the pattern above in mind, the following are missing: (3) There are HTTP response related macros at the bottom of the file, , however these are missing their counterparts. -(4) The reason for (3) presumably is because we reach for over in general due to the test suite crashing behavior of . If this is the case, it would be worthwhile considering whether macros such as should alias rather than .- (5) There are a few more missing macros, given and which aliases to and respectively, we should also add , , , and as well.. The purpose of this ticket is to document a very cryptic error message (actually a warning that gets propagated by ) that gets generated by from source code when trying to mock a perfectly function. h3. Problem The following code is attempting to mock a : The above code generates the following error message: The source of the issue here is that is an . In you can find the following function: This function gets called with the return type of a mocked function. In our case, the return type of the mocked function is . Attempting to compile the following minimal example with reproduces the error message: to as I believe this problem is solved in the newer versions.. Dynamic reservations should be authorized with the of the reserving entity (framework or master). The idea is to introduce and into the ACL. When a reserves resources, \"reserve\" ACLs are checked to see if the framework () or the operator () is authorized to reserve the specified resources. If not authorized, the reserve operation is rejected. When a unreserves resources, \"unreserve\" ACLs are checked to see if the framework () or the operator () is authorized to unreserve the resources reserved by a framework or operator (). If not authorized, the unreserve operation is rejected.. Add authorization for dynamic reservation. Add reserve and unreserve endpoints on the master for dynamic reservation. WIP, but seeking early feedback:. currently only handles and operations which exist for persistent volumes. We need to handle the and operations for dynamic reservations as well.. The protobuf message encapsulates information needed to keep track of reservations. It's named rather than to keep consistency with . Here's what it will look like:. Currently the aggregates total and allocated resources across multiple slaves, which only works for scalar resources. We need to distinguish resources from different slaves. Suppose we have 2 slaves and 1 framework. The framework is allocated all resources from both slaves. To provide some context, this issue came up while trying to reserve all unreserved resources from every offer. Suppose the slave resources are the same as above: Slave1: Slave2: Initial (incorrect) total resources in the DRFSorter is: We receive 2 offers, 1 from each slave: Offer1: Offer2: At this point, the resources allocated for the framework is: After first operation with Offer1: The allocated resources for the framework becomes: During second operation with Offer2: in the above code is: We try to a operation and we fail to find which leads to the fail at. Add user documentation for reservations. Add a user guide for reservations which describes basic usage of them, how ACLs are used to specify who can unreserve whose resources, and few advanced usage cases.. Enable the master to handle reservation operations. master's function currently only handles and operations which exist for persistent volumes. We need to handle the and operations for dynamic reservations as well. In addition, we need to add functions for the reservation operations.. ", "contenttype": "application/json", "created": 737603, "id": 53, "language": "en", "user_name": "mcypark"}]}