{"contentItems": [{"content": "Brief Description of Issue: Message boxes are not in DNN style Clear Steps to Reproduce: Install PE or EE Log on as Host Navigate to Host - Configuration Manager Select one Configuration File,such as Click Choose File and select a config file, such as and click Upload Click Execute Merge Actual Result: The popup message boxes aren&apos;t in DNN style Expected Result They should be in DNN style. Login as host, go to Host Extensions Available Extensions (x) The extension appears as a \"module\". library The extension should have a friendly name - . When installing, the first install wizard screen should display name. ( Message Text: QA Notes: Please test this for both clean installation and upgrade. Microsoft CodeDOM extension improvements. Register a new user under registration Login as Toast Notifications are displayed eventually that new users have registered. This is ok. Close the toast notification by clicking X button. Wait 30 seconds. Toast Notifications comes back again. Close it and it will come back again in 30 seconds. And again and endlessly Expected: Old behavior was the following: never* be displayed to THAT user again, unless a new notification arrives; And, when a new notification arrives, toast notification for the older notifications can be displayed along with the new notification.. Please see screencast As any user, go to My Profile Edit my profile button On the Friendds tab, is displayed correctly Edit my profile button However, on the Messages tab, is displayed with incorrect height and width (or the wrong style). Issue: When creating a new page from Page Management with the page name 'Site Map', the following error message is displayed: \"Site Map is an invalid Page Title!\" Steps to Replicate: 1) Open Admin Page Management 2) Create a new page with the page name: Site Map Actual Result Error message appears: \"Site Map is an invalid Page Title!\" Expected Result A new page with the page name 'Site Map' should be created without an error message. Q) If this is by design, is there a list of other page names that are considered not valid?. +Go to Host Extensions, or Admin Languages Default Container Default Theme Evoq products: Basic, Content, Engage Evoq Library * Sharepoint Viewer. For all products, test on clean install and upgraded sites Create a user using persona bar's create user API. For platform, verify some other API.. Implement Json Web Token (JWT) authentication handler. SI: CKEditor can't upload files even with Full Control to Root Folder. (i) Please test linked issue DNN-7862 also because this issue causes a slighly different symptom on Evoq. (i) This issue must be tested on all products: Platform, Basic, Content, Engage QA Notes: Verify that the browser does not show DNN Error as shown in the screenshot in DNN-7862 Step to repro: Register an account with 'Verified' turned on. Email is send with verification link in it. User is already logged in with yellow bar explaining of unverified status. User clicks on link in email and it fails as described in forum post User logs out and clicks again on verify link in email - Success and verified. No error in eventlog but only in logfile: - An error has occurred while loading page. (0x80004005): The Controls collection cannot be modified because the control contains code blocks ). at index) (EventArgs e) at Boolean. EVOQCONTENT: Unable to create a Page for a blank non-english child site. Please see screencast Step to reproduce Install the Language pack and enable the content localization Enable the non-english language and create the language's pages Create a child site in non-English (French, German, etc) with (Note: Blank template should be non-English) Create a Page for Child site Actual: The Page is not created and exception generated in log file In the Event Viewer, the following error is logged several times: DotNetNuke Referrer: (Windows NT WOW64) (KHTML, like Gecko) out of range Parameter name: value StackTrace: out of range Parameter name: value at dataSource) at sender, EventArgs e) Boolean Source: FileName: Method: Server-Name:. EVOQCONTENT: Icon missing for security analyzer module. EVOQCONTENT: CDF: Advanced editor is broken when CDF turned on. EVOQCONTENT: Site is absolutely unusable with CDF enabled. (i) This issue occurs in Platform only, +not+ on Engage or Content Click Add module from control panel Scroll all the way to the right (x) The last few modules (Taxonomy Manager, Vendors, View Profile) cannot be accessed. * Please see screencast (i) I can repro on all broswers: chrome, FF, IE11 (i) I used an object qualifier on my local site (i) I always install dummy serialization caching provider by default (. Install Platform latest build Go to Messages (x) The button is missing (The screenshot below is from. Install platform with dummy serialization caching provider ( Create a new regular user Edit Profile Enter a value for country (i) This error only occurs in Platform. Evoq products do not have this issue.. Remove the Alpha Version in Website Title. The text 'Root' and 'Site Root' is hard coded in the control. This is an inconsistency, firstly 'Root' is shown, then in the drop down or after to \"Home\" (Pending to confirm if this should be changed globally, or it must be customizable, as this control is already used in other places) After the drop down is opened, it can only by closed by clicking again on the control. This behavior should be changed to close ith when clicking anywhere. QA Notes for Engage: Please test that the control closes when a user clicks anywhere outside the control.. The control to upload files raises an event to notify a file upload but this event does not contain any info (file name and path or fileId) about the uploaded file, It is not possible to know what file that has been uploaded with the current API. This is raised even if the file has not been uploaded ok, but the control is asking the user to replace or keep. The event should also contain info about if the upload was ok or not, or, alternatively, only be raised if the upload was ok. Platform changes are required to add this info to the event. QA Notes for Engage: Please test that when an Asset is uploaded successfully, that it is highlighted in green (just like when a folder is created, it is highlighted in green). After installation, navigating to the website causes the following errors to be logged:. When Copying a page: Expected: The newly created page should be in Edit Mode, so that Admin can click on Publish (according to new workflow), or click on Cancel. Steps: As host, try to copy any page from the control panel Click on Copy Page button The user is redirected to the newly created (copied) page. Expected: The page should be in Edit mode, so that the Host Admin can click on Publish Cancel buttons.. SI: Creating a group fails when Social Groups module is in All Roles mode. (i) This issue is marked \"SI\" because related issue DNN-5520 is an SI issue and this issue needs to be resolved to fully fix DNN-5520. Install Social Groups module on a new page In Settings, change Default Role Group to \"All Roles\" Try to create a new group. Please see screencast Expected: When in \"All Roles\" mode, it should be possible to create groups successfully. ** Expected: The newly created groups in this mode, should belong the \"Global Roles\" Role group. If \"Global Roles\" is chosen as the \"Default Role Group\", then these groups only should be displayed. (i) Documentation: Please document that a new setting called \"Default Role Group\" is available (if not already doc'd). This is how the upload file currently looks (for example, when uploading a new profile picture): The user has to click on the text \"Click to Browse\" to bring up the file selector dialog. This is how the upload file button look like in Jira, for example:. EVOQSOCIAL: Upgrading Catalyst Error in. EVOQSOCIAL - SI: Relationship Scoring Actions. When SOCIAL is installed in a virtual directory in IIS and a child portal is created, the registered users can't log in the child portal. - Install social in a virtual directory. - Login as host - Add to the list of site aliases in Admin- Site Settings- Site Aliases - Create a child portal with name \"child1\" - if it is not set, add to the list of site aliases in Admin- Site Settings- Site Aliases in the child site - Create a registered user in the child portal - Log out - Try to log in the child portal as the registered user created before - Page is reloaded but the user is not logged in. - The user should be logged in the child site Simplified Steps: Build User is still not able to login in a child site of localhost application Create a localhost application for social Create child site Register new user Try to login as new user. * (x) User is not logged in. EVOQSOCIAL: Registered user can't log in in a child portal in a virtual directory installation. Set the site's registration to Private (in site settings) Register as a new user on the site by clicking on Register link (x) This notification has only one action - dismiss. This is incorrect. It should have two actions- Authorize and Reject. (no dismissing without taking action). (x) EvoqSocial Project: A CMX task does not appear for the CM. This CMX task should have two actions - Authorize and Reject.. EVOQSOCIAL: Messaging: Dismiss All for Notifications. We need a \"Dismiss All\" feature in Notifications I have 295 in my tab in Catalyst I don't have an hour to spend to individually delete each notification Clicking on this link should pop up a message box reading: Message: Are you sure you want to dismiss all X notifications? (where X is the total number of user's notifications) Clicking on No should do nothing; Clicking on Yes should Dismiss all notifications for the logged-in user and the page.. (i) This bug occurs in PE EE as well Install Create a page with member directory on it Register a user with username \"Jack\" Create a child portal (from main site) Create a page with member directory on it Register a user with username \"Jack\" Create a parent portal (from main site) Create a page with member directory on it Register a user with username \"Jack\" Go to the Member Directory page of any portal (main, child, parent) and login as Jack user cards with name \"Jack\" are listed. (x) All 3 user cards are treated as the currently logged in user. This is a bug. ( ) Only one user card for \"Jack\" should be displayed. Change the profile properties of \"Jack\" the display name, Email, Password. Login to a different portal (main, child, parent). (x) The profile properties of all \"Jacks\" across all portals have been changed display names, Emails, and Passwords are changed. This is a bug. ( ) Changing profile properties of a user in one portal should change the profile properties of a user in another portal with the same username. Screencast:. Install CE Upgrade to CE. Upgraded ok. Try to login to upgraded site. (x) DNN Error is displayed. At this time, the url reads: (i) Please see attached 3 logfiles (i) This is a showstopper for. Install CE Open logfile Tons of javascript error are logged (175KB). Please see attached logfile.. When a user goes to his Profile, there is a section for \"Friends\" (besides Activity Feed, Messages and My Profile). When the user clicks on \"Friends\", initially no members are displayed in this list as currently he has no friends. There is no way to search for users of the website, so that he can send out friend requests. :( The only way this can be done is if there is a member directory page somewhere on the website, where he can see all users of the website. But what if such a page does not exist on the website? ( above under The existing users can be put in a section div called \"My friends\" We should add the ability to search all users of the website via A list of \"autocomplete\" suggestions should be displayed in a dropdown upon typing a few characters in this search textbox. (this functionality already exists in member directory) The user can then he can already send a friend request. (this functionality already works) (on) This is in line with making our product more \"Social\". Label for language languages\" to \"Switch UI (with a colon) current: ! desired: !. (i) In host settings, password history (advanced settings membership mgmt) not already enabled. Register a new user Login as this new user Go to My Profile and attempt to change password (x) Password cannot be changed red error message is displayed on the page. This is a bug. ( ) Password change should be successful. (x) A password reset email is sent to the user. This is a bug. ( ) User wanted to change password (not reset), so a password reset email should NOT be sent. (i) In host settings, password history (advanced settings membership mgmt) User can change his password now.. Steps to reproduce: Register a user. Login as this registered user. Change profile picture Login as host - delete this registered user (but not remove) Restore this deleted user Login as this registered user. Change profile picture What's changed? (i) After user was created, user had Write permission to folder (can be verified in Admin File Managment). Screenshot (x) After deleting and restoring this user, user loses Write permission to folder (can be verified in Admin File Managment) ( ) The restore process needs to restore the Write permission to this folder and any other folders. align right, vspace 1!. User has Write permissions just after registration. 1. Install an older version of DNN Platform like or 2. Upgrade to latest version I used build 3. Go to Advanced Configuration settings under Admin. 4. In the Authentication Systems tab, (x) two copies of each auth system is present: one for the older version and one for the new version This is a bug. ( ) Only one version for each Auth System should be left upon upgrade The cleanup script should remove older auth systems. 5. In the Providers tab, (x) two copies of each provider is present: one for the older version and one for the new version This is a bug. ( ) Only one version for each provider should be left upon upgrade The cleanup script should remove older providers. 6. (EvoqContent) (x) In the Optional Modules tab, one of the modules called \"Media\" is listed twice (two versions). ( ) The cleanup script should also remove older optional module versions.. (i) Please see related issue (i) Issue found on build (Sep 3 2013) (i) Suggested dev to assign to: clicks on edit user pencil icon, not* contain the new password. This email should just say that the admin has changed your password, so please contact your admin (with a link to contact admin via email address).. ", "contenttype": "application/json", "created": 737358, "id": 22, "language": "en", "user_name": "mohit", "email": "-"}]}