{"contentItems": [{"content": "h4. Problem Description A map annotation with draggable set to true is not actually draggable. h4. Steps to reproduce Hello, We have tested this issue with iOS device. We have observed some issue. h4. Steps to reproduce 1. Create a new project. 2. Enable module to the project 3. Replace contents with : 4. Run the project in iOS DEVICE running iOS h4. Actual results The application run with displaying annotation. Tapping on the annotation will display the annotation title and sub title. Now clicking for one second on the annotation will enable the pin to drug and place anywhere in the map. Now when the pin in drugged and placed on another place, now the mapview moves freely without the pin moving with it. The pin does not stuck on a new place after it's being dragged. h4. Extra info As also raised in this community question A map annotation with draggable set to true is not allowing users to move it. Setting a click event to log the annotations properties confirms that draggable is set to true . My testing has shown that all works fine in iOS 7 and even iOS but fails in iOS. h4. Problem Description When you have a delay on an alert, with persistent set to true, you will experience a weird glitch when waiting for the alert and you pull down the phone notification window. The alert will appear behind the notification window, when you close the notification window, the alert will disappear. This doesn't happen with iOS h4. Steps to reproduce 1. Create a new mobile project Classic Titanium 2. Paste this code into 3. Run it in iOS 7 (either device or sim). 4. Click on the green square 5. Drop down the phone notification window from the top of the screen. 6. wait until the alert appears behind the current window. 7. Close the Window 8. You will see the alert dissapear. h4. Extra info This doesn't happen with iOS8. There is alternative ways to reproduce this, as well: 1. open app and tap on the green view. 2. wait for the alert to appear. 2. Double tap device home button immediately to go the recent running apps view. 3. tap the app from recent running apps list to make it foreground again. The issue appears. Looks like something to do with the way iOS 7 handles window stack.. h4. Problem Description I've discovered a bug where the app crashes when it receives some (3+) push notifications while the iPhone's screen is turned off and the app is in background. h4. Steps to reproduce 1. Create a new mobile project 2. Add this code to the app via 3. Please replace the ACS keys with your own and the GUID with your own. 4. Install to device 5. Open App Allow it to retrieve a device token (used below) 6. Send 2 notifications 7. You'll see in console logs 8. Background app with home button 9. Send 3+ noticiations 10. You should now get the crash in the console h4. Extra information After some push notifications, the 'callback' function does not get called anymore. After that, when I turn the screen back on, the app crashes completely with an error in the console. This happens on at least iPhone 5S, iPhone 6 and iPhone 6 Plus and is a critical bug since it prevents users from receiving important notifications! I've put together an example app & server and closely documented this issue at: Using this you can reproduce this error on your own. I'm using SDK btw.. iOS: App crashes after receiving some push notifications in background. h4. Problem Description Custom fonts is not working on MobileWeb, But works well on Android and IOS. h4. Steps to reproduce 1. Create new mobile project (classic titanium) 2. Add this code: 3. Create a fonts directory inside Resources 4. copy the attached font to the fonts directory. 5. Select as the Mobile SDK 6. Run in mobile web h4. Actual Results The custom fonts are not show. h4. Expected results The custom fonts should appear, as used to happen with Mobile SDK h4. Extra info I tested this and the last known working version is Mobile SDK. h4. Problem Description App crashes with when switching from textedit to datepicker h4. Steps to reproduce 1. Create a new mobile project classic titanium 2. Add this code to 3. Run the app in a Samsung S3 device (Please: make sure to use the S3 device, it's not easily reproducible in other devices). 4. Click in the Textfield 5. Start type something 6. Click on the button to open the date picker . 7. The app should crash. h4. Extra info I included the adb log of the errror threadid 10: thread exiting with uncaught exception FATAL EXCEPTION: Process: PID: 27883 Only the original thread that created a view hierarchy can touch its views. 886): Force finishing activity 886): Moving to PAUSING: ActivityRecord. Android: App Crashes with opening DatePicker after typing in a tf. iOS: Parity: Clean up tab events. Android: - setting html property makes it non-clickable. h4. Problem Description Once you set the html property in a label, the click event is lost. h4. Test Case 1. Create a new mobile project Classic titanium 2. Paste this code into 3. Run it in a device. 4. Click the label h4. Expected results After clicking the label, an alert should appear. h4. Actual results alert is not shown.. h4. Problem Description If is set to true, \"callback\" event will not be fired when clicking the tray notification that launches the app (app wasn't in the foreground nor the background). Without set to true, \"callback\" will be fired as expected. and are never fired in any case. h4. Testcase 1. Create a new mobile project (classic titanium) 2. Paste this to 3. Run in device. h4. OBSERVED PROBLEM After Enabling and in the project, we provided the Production and Development Key generated by titanium and also the ACS API key from web console in the file. We also configured the app for GCM protocol. After Running the app. An error message has shown and though GCM Authentication was successful, The Device token was not shown in the console. h4. Error Message. h4. Problem Description After a map view is loaded, and a camera is applied to the map one cannot pan or zoom on the map (touch is lost). The view get's \"locked\" in position. Removing the camera by applying a pitch of zero, does not restore it. The sample code below shows this problem. To test; Load the code. Pan and zoom the map. Then tap the \"3D Camera ON\" button to apply the camera. Now when you try to pan or zoom, is not possible. Tap the button again to set pitch to 0 and restore the map. Pan and zoom still don't work. I should note that the click event is also lost as well if you have any annotations on the map. h4. Steps to reproduce 1. CReate a new mobile project (classic titanium) 2. Add this to 3. Run it in a device. h4. Problem Description I have created a native module that has some code in an method - when importing this module in my alloy controller using , the method is called when the root activity is started when using Titanium SDK but when using it is never called. I have properly declared the module in my and my method is pretty simple: In I see the debug message in the output - but using I never see it (however I do see the and lifecycle methods are properly called. My native module depends on some initialization code in that cannot be moved to , so it's currently failing as is never called (nor is which is a bit suspect). Also, for a non-Alloy app, this does not happen of the lifecycle methods, including are called as expected. h4. Steps to reproduce. 1. Download the module from this 2. Create a titanium classic project 3. Paste this code: h4. Steps to reproduce the issue with alloy (which is easier to reproduce) 1. Create a new alloy project 2. Paste this to 3. Run it in a device.. Android: Native module onStart() lifecycle method never called for Alloy project. iOS8: Aborting upload causes file to stay in ram. h4. Problem Description When aborting a file upload the file that was loaded into ram is kept in ram. The ram does not get cleared unless the upload is completed. So every file thats uploaded and aborted is being kept in active ram on the device. If a user uploads a file and aborts the upload multiple times ram usage becomes very high and will cause the app to crash. This did not happen with the ram would get cleared when the upload was aborted. When watching instruments while preforming a upload you can watch ram using spike on each upload but never be released. h4. Steps to reproduce 1. Create new mobile project (classic titanium) 2. Please copy the Attached file to the Resources directory. 3. Paste the Sample Code to ( to test with large upload file that will automatically abort after seconds) :. h4. Problem Description There is a new WebView for iOS 8 that it's a lot faster than the WebView. It might be useful to provide a better experience to the end users. h4. Extra info h4. Benchmarks. iOS8: - requires new value for iPhone 6+ specifically. h4. Problem Description A black stripe on the bottom when using showCamera with a parameter of scale 1 and overlay rotating 90 degree. The code will show a black Stripe on the Bottom of the Screen and the app is in Landscape mode. Use a 2d matrix to transform the live view of the camera by scaling it 1 to or whatever scale you want to fill the screen. for me the camera previews full screen at scale h4. Steps to reproduce 1. Create new mobile project (classic titanium) 2. Copy this code into 3. Run it in device.. h4. Problem Description On Android, saves a file or a blob without any file extension, which makes it impossible for the photo gallery to recognize the file. The issue can be reproduced with the following code, with the picture being stored in Note that in this example, I use with a blob but I get exactly the same result with a file. I receive a success, but the image is saved without extension and I get this message in the console: action: path: h4. Steps to Reproduce: 1. Create a Classic project. 2. Paste this code in file. 3. Paste a photo to the resources folder named 4. Run this code with the testing environment. Code:. Android: Android ListView is not exposed in Titanium. h4. Problem Description When a GET request should be returning a status of \"301\" or \"302\", I have the GA SDK returning a \"200\". Switching back to the GA SDK fixes the problem. When we have tested using the following code, the status returned is \"302\" in and \"301\" in h4. Steps to reproduce a) Create a simple project. b) Update this code in c) Run this with testing environment h4. Test results In Titanium SDK: : Application booted in ms : Status 302 : This should have returned a 301 not a 200 In Titanium SDK: : Application booted in ms : Status 301 : Redirect to. iOS: HTTPClient: Invalid Status Codes returned in SDK. h4. Problem Description There is a strange behavior when using custom theme, basically if you don't use this one: it will fail (it shows a smaller screen view in android) - Check If you remove it, it will work just fine. - Check h4. Steps to reproduce 1. Create a new mobile project (classic titanium) 2. Add this Add this to your (inside Specify in which theme you going to use (excerpt): 3. Run it into device. h4. Actual results if you enable the in the custom theme, the views will be smaller. h4. Extra info I attached a full testcase in the form of a project with the name. h4. Problem Description returns as a blob in physical memory!! If the file size is large, for example, over 1GB, it could cause low memory crash. Plus, using in this case takes too much time to run in the background. iOS only allows 30 seconds. Chances are the app will be either crashed or suspended before the file is saved. I suggest: upon move the file to a temp directory and return the path instead of a blob. h4. TESTING ENVIRONMENT CLI version Titanium SDK version iOS7 h4. CODE SAMPLE h3. h4. STEP TO REPRODUCE - Create a new Project - Double-click the Project's file to open it in the Overview tab. - In the Modules section, click the Add button (green plus sign) to open the Mobile Modules dialog. - Locate and select This module is part of the Titanium SDK since Release - Click OK. - Copy the code segment above to the project file - Run the Project h4. OBSERVED RESULT If the URL is changed to download a large file, progress bar would not response and the app will crash after some time.. Android menuItem with actionView cant handle with Titanium SDK h5. TESTING ENVIRONMENT: Mac OS X Ti CLI Titanium SDK: and Android emulator and device h5. TEST CODE h5. STEPS TO TEST Create a new project Update file with sample code Run on android Click the search button, see the searchView appear and works fine. Click a row, see the alert i called) Click the search button again, now the searchView is not displayed h5. EXPECTED RESULT Its not working as expected in Ti SDK but works fine in. Android: Android menuItem with actionView can't handle (regression). h4. Problem Description Everytime I try to use a density independent image as map annotation rightButton property, I get the following error (like the image was not there): Environment: Titanium SDK: Titanium CLI: rc, Android SDK: OS X Version: Appcelerator Studio: to reproduce the issue: a Alloy project. this code in file and file. your file with Google API key. 4. Paste some image in folders this code with testing environment.. h5. Problem Description Focusing TextField in HeaderView of empty TableView causes application to crash on h5. TEST ENVIRONMENT: Ti SDK Ti CLI iOS SDK: iOS iPhone Simulator: h5. STEP TO REPRODUCE: 1. Create a default alloy project. 2. Replace with the following code: 3. Launch the app. Click on the TextFielfd to write. 4. The keyboard pops up and the application crushes h5. EXPECTED RESULT Keyboard should open to enable writing in the TextField. h5. OBSERVED RESULT After the Keyboard opens the application crashes.. h4. Problem Description Three (red, blue, green) square views should move from top of the screen (, , ) to the same target position (grey square). They move as expected after you add a stringify the view. See the video attached. I managed to recreate the issue on the GT-S7562 device as well. h4. Steps to reproduce 1. Create a new mobile project (classic titanium) 2. Add this code to 3. Comment out the line with the comment \"Comment out this line in order to see the bug in your 4. Run it in emulator to see the issue (the animation breaks down when you comment out the line in step 3 - if you add it again, it will work as expected). h4. Extra info Please check the video for more information.. Android: This animation is broken if you don't stringify the affected view.. h4. Problema Description Before navegating for awhile the map stop loading, that only happens when using Android and Google Play Services h4. Community Extra info h4. Tests Nexus 4, Android Google Play services - stopped working Nexus 4, Android Google Play services - OK Xperia Neo V, Android Google Play services - OK Galaxy Nexus Android Google Play services - OK Razr D3, Android Google Play services - OK h4. Testcase h4. Logs. h4. Problem Description The geolocation bug which used to exist inversion Jira number TIMOB-4982 has been re introduced in version The last working good version is . h4. Test Case 1. Create a new mobile project (classic) 2. Paste this to 3. 4. The map never ask for permission for the GPS access, not even if the user presses the location icon google will briefly flash \"Location could not be identified\" h4. Extra information Use case: When we open a html5 page that as a geolocation titanium does not give access to GPS on the device.. Android: Images do not scale UP properly on Android (parity issue). h4. Problem Description The 320x180 image in the testcase should be scaled UP to fill the width of the window (left: 0, right: 0) with it's height automatically adjusted to maintain the image aspect ratio. This is exactly what happens on iOS. On android, the is contstrained to the original image height, and the image's aspect ratio is maintained, thus leaving a large unfilled area to the left and right of the image. Since the size is set to the expected behaviour would be that the image is scaled up to fit the full width of the ImageView and it's size adjusted upward to fit the contents of the scaled up image. Again, on iOS this expected behaviour is exactly what happens. But on Android, you get the unexpected result of an image with limited width. h4. Steps to reproduce 1. Create a new mobile project 2. Add Android to the supported platforms 3. Add this testcase to 4. If you run this in Android, you will see red next to the image. If you run this in iOS it will be nicely filling the space, no red in the screen.. Android: does not stop file upload. iOS7: (and Icon Not Used for iOS 7 when All Icon Sizes Included in Bundle. ios7: Battery Platform event listener doesn't work after first call. h4. Problem Description I've been running into issues with the CI builds and Due to how we handle builds, I need to use for all submissions and ad hoc builds. Any of the or Master builds have this build issue. h4. Actual Results The build via is failing. h4. Expected Results The build via working just fine h4. Test Case 1. Create a new Titanium project targeting a CI build 2. Run the process as usual 3. Open in xcode and try to run in the simulator h4. Extra info When xcode tries to compile you will get the below error app property, : system wrote Traceback (most recent call last): File line 7, in import os, sys, re, shutil, time, run, sgmllib, codecs, tempfile File line 2, in from tools import ImportError: No module named tools Command bin sh failed with exit code 1 I tried this again today using the below build version. h4. HD Discussion. h4. Problem Description I have a tableview in a window. If I open that window using the tableview appears as it should. BUT if I close that window using and open it again later using the same the tableview quickly shifts up to it's position. It is almost like it is animating 20px when the window is opened. I am NOT using any animations. Sample code below h4. Actual Results After the first time, the tableview appears animated. h4. Expected results Tableview without animation h4. Test Case 1. Create new mobile project. 2. Paste this code. iOS: Tableview shifting after update. h4. PROBLEM DESCRIPTION For iOS, when you create a new mobile project in Titanium Studio and run it on device, the ipa file it generates is well over 4MB. h4. STEPS TO REPRODUCE 1. Create new mobile project 2. Compile it to device 3. Check the size of the app. h4. ACTUAL RESULTS App bigger than 4MB, even if it's an almost empty app. h4. EXPECTED RESULTS Ti only adding the needed functionality, according to the namespaces used in the app.. The installer is not able to install GIT from our URL. h2. Problem When trying to install on Windows, Git is required but can't be downloaded by the installer, thus install fails. Git is actually installed and works from the command line. h2. Logs h4. Extra info The URL in the installer uses that is redirect to: that is showing a 403.. h4. Problem Description Can't import new provisioning profiles within Ti Studio h4. Steps to Reproduce 1. Titanium Studio - Preferences - Plataforms - iOS - Provisioning Profile - 2. Add a provisioning profile 3. Refresh h3. Actual Result The imported provisioning profile doesn't appear in the provisioning profile list. h3. Expected Result Properly import and display the new provisioning profile.. ", "contenttype": "application/json", "created": 737603, "id": 89, "language": "en", "user_name": "mpmiranda", "email": "mpmiranda@appcelerator.com"}]}