{"contentItems": [{"content": "Add npm hosted, group and proxy performance ITs to the. h4. Acceptance Criteria An admin user, creating or modifying a raw repository, can optionally define a list of default 'pages' (path suffixes). Whenever a request ending in slash would otherwise 404, Nexus will check each of the pages, in the order provided. This only affects raw hosted repositories. (Proxies can rely on the 'default page' handling of the remote h4. RATIONALE Deploy a site with an to a hosted raw repo with the Maven site deployment from Then navigating to the URL of the repo you see a 400 error in the Nexus UI Even though renders the site in HTML. Note: - Make sure we have a longer term plan for how we handle and directory. New Raw hosted repos should default to 'Allow redeploy'. ACCEPTANCE CRITERIA An admin user creates a new raw, hosted repository. Nexus should default the deployment policy to 'Allow redeploy'. RATIONALE A single command of 'mvn puts the same file multiple times; if the deployment policy isn't 'allow', it will fail. When creating a hosted raw repository for Maven site deployment it should be as easy as possible. 1. create repo 2. select raw hosted 3. provide name site) Now mvn site-deploy with should just work. However this is not the case since the maven site plugin does repeated deployments of the same files and the default is to disallow redeployments on hosted raw repositories.. We don't yet have repository browse support by visiting the repository URL in the browser), which may cause confusion when users follow the repository URLs from the Repo Admin UI. ACCEPTANCE CRITERIA For browsable formats (maven, but not nuget - determine which is which), visiting the root of the repository produces a user-friendly explanation that this is meant for clients and is not yet browsable. Technical comments - this will require amending the repository recipe(s). Remove legacy NuGet repo support. Acceptance Criteria - An admin user can go into NX 3 legacy repo, and won't find any way to add NuGet repositories - Remove code, tests, references in pro and bundles. Acceptance criteria: There's a standard spot in asset metadata for storing these hashes * Wire it up so that Raw and Simple assets record these actual hashes (as opposed to ways of obtaining the expected hashes, which should also eventually be stored). Implement a repository which proxies a remote HTTP site and stores any files (of any format) in the CMA repository storage facet. Only GET requests are honored (others are rejected). Configuration parameters include the remote URL being proxied, the not-found and stored-item expiry times. This will serve as a reference implementation for more complex formats' proxy repositories.. Content for proxy repositories. As a .NET developer, so that I can get quicker and more reliable access to remote packages, I want the ability to have NuGet repos cached locally Acceptance Criteria: - Implement handlers for the various read-only NuGet gallery protocol endpoints (ODATA queries, downloading, - Implement the caching of components in component storage. - If a user requests a package we don't have by URL we should send a request to fetch the metadata from the remote proxy - Feed counts should reflect what the upstream repo reports results will be slightly different due to the algorithms we use versus - If the remote repo goes down, a user should be able to still use the proxy repo with locally available metadata and packages - Locally cached NuGet metadata should be visible in Nexus ElasticSearch results (regardless of whether we have the packages yet) - Nexus Admins will be able to configure the cache duration size for queries to remote repos so that we don't overload the remote repo - If a user Searches on the NuGet Feed search results are capped at 40 entries - Supported clients are Visual Studio 2013's package manager, the VS package manager powershell utility, the standalone command-line client, and the Nuget Package Manager.. Elaborate on the concept of source availability. In both config and instantiated sources, handle state tracking for: manual blocking * correct view behavior when sources are removed entirely. Create the simple methods for types, so that (eventually) the UI can request ViewIDs and for new views sources as users define them.. Component View Source Name-Generation. Component sources need configurable HTTP connection parameters, including: pool sizes authentication credentials policy schema downgrade policy Expose a standard way of configuring HTTP connection parameters for connection sources (presumably written into Map), and a framework for instantiating those pools and serving connections to HTTP-based component sources. Consider functionality described in NEXUS-7594. Direct request for NuGet artifact through proxy fails if artifact is not in the feed.. Given an org configures an http proxy server to access certain hosts only And Nexus is configured with this http proxy server And GET requests to a nuget proxy repository hosted in Nexus have to follow a redirect to a different host than the host they proxy in order to download an artifact When the artifact is downloaded through Nexus and the http proxy server responds with 403 because access to that host is not allowed Then Nexus should respond to the original request with 403 And the response should include the possible reason of the 403 ( source proxy server was used, the redirected to host used and that the routing through it failed with 403) Nexus currently responds with 404 and no reason to the NuGet client. This leads a Nexus admin to turn on Nexus DEBUG logging to see redirection failure instead of client user knowing they need to configure the Nexus HTTP proxy server to allow certain hosts. PULL REQUESTS: (master). ", "contenttype": "application/json", "created": 737358, "id": 70, "language": "en", "user_name": "mprescott", "email": "-"}]}