{"contentItems": [{"content": "closed by mistake. When launching app in a mode, the image layout is wrong. Rotating device to PORTRAIT results in image size reduction. It happens only on first launch. Killing the app and launching it again will result in an expected layout.. h5. To reproduce 1. Click Win2 2. Return to Tab1 h5. Actual result Portrait size window in landscape mode Note: it is a regression against iOS. h5. Description There is a visual deformation of a keyboard, when focus in a text field. h5. To reproduce 1. Run iOS Keyboard. or create the default app and replace 2. Click the text field. h5. Actual result The keyboard is deformed h5. Expected result 2: Not a distorted keyboard, which should not disappear and rotate with the device.. h5. Description When launching the app on iOS8 Simulator, I encountered that as soon as the simulator started, it hanged with the black screen for a while before the splash screen appeared. The simulator displays the home screen with the installed app icon. The second attempt to launch the app is successful. Note: the black screen appears for iOS7 and iOS8 Simulators, the return to the home screen happens on iOS8 Sim only. h5. To reproduce 1. Create the default app with appcelerator services enabled 2. Run iOS Simulator h5. Actual result The black screen for a while, the splash screen and return to the home screen. h5. Expected result The application should be launched successfully. There is no borders are displayed when running KS Controls Text Field Border Style It is a regression against Titanium SDK, build. h5. Details: Packaging an app to the iOS iTunes Store at first time archives it as a Mac App. Second attempt to package results in an expected result, which is iOS App Archive. QE and Dev will investigate and check, if it is a regression. Due to a large size, .zip files are not attached to compare 2 archives.. Android KS: text does not size to fit in buttons. Failure to build an imported project onto device with an internal error occurred during: \"Saving packaging preferences\".. When trying to build an imported from project for a iOS device, I encountered the following: An internal error occurred during: \"Saving packaging preferences\". h5. To reproduce 1. Open Appcelerator Studio 2. Import any project from 3. Run your device h5. Actual result Please, refer to the attachments h5. Expected result No errors, success, installing an app on to the device The Work Around IOS device Please, notice iOS device is showing as iTunes sync (screenshots). Somehow my username became \"Null\" when I tried to log out and canceled the process. Please, check the screenshot.. NPE on a project creation when no SDKs are installed. Debug symbols upload error occurs, when the app first installed onto device, using Studio. h5. To reproduce: 1. I used the default classic app with: The error occurs after the app is installed onto device h5. to work around uncheck the box \"Enable Appcelerator Services\" when creating a New Mobile App Project. I had an existing project with Appcelertor services enabled. h5. To reproduce 1. Package iOS iTunes Store 2. Package iOS h5. Actual result Application packaged and can be installed and run on devices However, there is the error uploading debug symbols (see attached) It happens each time you package the app.. I cannot build default project for device, using Studio. Studio log does not have any output, but \"Unhandled event loop exception\" attached in The buid command works in CLI. I am able to launch BB simulator. reproduce: 1. Create a default project 2. Set IP address and password for BB device in Studio preferences 3. Build for device h5. Unhandled event loop exception. When Titanium SDK build installed altogether with it results in the configuration error (no description). h5. To reproduce: 1. Using Studio, create the default project and check Overview h5. Actual result: No description. However, the project can be installed on device and ran. Note: the app should be started manually h5. To compare. While testing mobile web analytics, I encountered the wrong deploy type in the console output. h5. To reproduce 1. Create the default 2 tab app 2. Change label text I am a Window2) to 3. Package the app for MobileWeb 4. Run it on the device h5. Actual result 4. Label's text is \"development\" Analytics: It is a Studio issue, as i ran the CLI command and it shows the correct deploy type in the device's browser. Here is the command from Studio log showing instead of 4. Should be production. h5. Steps to reproduce 1. Set the HTTP proxy through Studio Preferences, Connect: Port: 8080 Username: qetester Password: lynx64-fixer 2. logout from Studio and try to log back in. h5. Actual Result: Studio freezes after prompting a workspace setup before login screen.. Studio freezes when trying to log back into Studio after proxy server is set. toolbar - no visual feedback on click. Tizen - Run Tizen device builds app to Tizen Emulator. When Run the app as Tizen Device via Studio, Tizen Emulator launches as a result. I had the device plugged in and Emulator up. reproduce 1. Titanium Studio Run As Tizen Device h5. Actual result Application launches in Tizen Emulator result Application should launch on the device. h5. To reproduce 1. Appcelerator Studio Help Check for Appcelerator Updates 2. Accept License and click Install h5. Actual result Nothing happens h5. Expected result Succes in update and the dialog window to restart Studio If I add and point to this url, it cannot be found Steps: (Help Install New software). An unexpected error, importing Kitchen Sink from Samples in Appcelerator Studio. Project is being imported though and it is \"workable\". I cannot reproduce the issue after the project's deletion and reimporting. h5. To reproduce Studio Samples Right click Import sample as project h5. Actual result The project is being imported, but the error occurred. Studio: Studio window cannot be focused at first time after launch. A Studio window and a Studio menu cannot be focused at first launch of Studio. reproduce 1. Launch Studio 2. Try to click anywhere inside of a Studio window or Studio menu(navbar) h5. Actual result A window cannot be focused result A focused Window around Click anywhere outside of a Studio window and back inside.. Can not terminate iOS Simulator process Step 1: In Studio debug any app as iOS Simulator, it starts the iOS Simulator as it should. Step 2: Click terminate (red square button). Step 3: notice the process will look like it has been terminated in Studio but the Simulator will not terminate. Looks like only switching consoles and terminating the process will work. Note: it is happening with Android Emulator as well.. ", "contenttype": "application/json", "created": 737603, "id": 91, "language": "en", "user_name": "oromero"}]}