{"contentItems": [{"content": "h2. Problem TextField and TextArea hasText() method not functioning. h2. Test Case. Please would someone verify and re-open? Thanks. Android: - enable logging methods to accept either an array of strings or a string. h2. Problem If initial orientation of the emulator is landscape, two events are fired when re-orienting to portrait. Thereafter, it works as expected. The same does not happen when initial orientation is portrait. h2. Test case launch app with code below h2. Logs. Android: Network - HTTPClient cannot retrieve non-ascii data. h2. Problem When loading some JSON file (UFT-8) from the web and displaying the data, the text is garbled. See attached screenshot of this problem on Note that this works fine on iPhone. The Kitchen Sink Demo of XHR has the same problem. It works on the iPhone but fails on Android. h2. Test case h2. Discussions Q&A:. Tooling: Android build process requires \"Google APIs\" even if only occurs in comments. h2. Problem For a Titanium mobile project on Android, if Titanium sees that you're using a in your project, running on the emulator will fail unless your run configuration indicates use of one of the \"Google APIs\" Android API. I assume it is scanning the source js files for this. That's fine. The problem is that if the only place you have the text is in a comment comment), Titanium does the same thing, and fails to install with the message, . I have to think that there are other things like that too. Titanium's build process should not detect things like this that are in comments, thus triggering the \"Google APIs\" requirement. I do not know if this affects iOS as well. h2. Test case h2. Logs. Android: keyboard type set as number pad permits input of non-numeric values. h2. Problem New minor version of Titanium SDK has a new look of numeric keyboard. The problem is that it allows input of non-numeric values. h2. Test case How to reproduce the issue: run this example with version of Titanium SDK, click on text field and type \" \" or \" \" symbols (or any other that is not a number). Also, it would be nice if there was key in this new keyboard that would minimize keyboard (if that is possible).. Android: UI view size property values incorrect. h2. Problem The view's size property values are intended to reflect the rendered dimensions. However, if these properties are queried too soon after rendering has completed, the old values will be output. The advice of querying property values within a window open event listener does not work. h2. Test case h2. Logs h2. Discussions See Q A topic: h2. Workaround Using setTimeout allows the size values to be updated to reflect the re-rendered view.. toImage() on device with retina display is pixellated (captured at half resolution). If you call on a view, and set an ImageView to that blob on an Iphone with retina display, then the image is displayed at normal resolution and thus is pixelated on an iPhone 4. There is a very simple fix to this already out there in the wild, see I would recommend that change is made to all appropriate UI controls which have a toImage() method. Please remember this issue is only visible when using an iOS 4 Retina Device.. Android requires that is modified (touched) to force a full rebuild, whereas iOS checks for files in the build iphone directory. To demonstrate this, follow these steps: touch (delete all files and folders within build android) after successful app launch, replace code above (does not contain maps) with the code below (contains maps) not cd (delete all files and folders within build android) no improvement is observed when the app is relaunched any number of times * once the file is touched, a \"Detected change, forcing full message is output to the console, and the app is launched as expected. Implement getPressure in Android view. The use of is losing its value in that once a window containing a table with this property is blurred, on return the search is displayed. Code example below:. Enable searchBar to animate cancel button. When a searchBar is NOT attached to a tableView, instead attached to a view on the window, the cancel button isn't animated. Nor does there seem to be a property to enable it. The cancel button IS animated when a searchBar is attached to a tableView. On the Q&A site, there is this: Hidayet Dogan, looked at the source and wrote: Could be a configurable option, I suppose, but having it match the tableView searchBar would probably make sense. The latter is not configurable.. You can't edit issues that you add? Anyway, sorry for the typo and the link error. Link should be:. h2. Problem A complex url to an image, used in an imageView do not render. The issues is not present in (21Nov). h2. Test case The following code will cause an exception: When the image lines are toggled, the app works without a problem. h2. Logs. h2. Problem Do not have the desktop sdk installed Titanium studio menu item preferences titanium studio titanium check the window for errors Note that Ti Desktop is no longer officially supported, so this validation should be removed, or result in a warning rather than error. results: the user is shown an error. Being that we have put the desktop out to pasture, it might cause unnecessary alarm to user h2. Workaround Install Desktop SDK from site. Studio requires restart for Android SDKs to be available from Run Configuration dialog. h3. Expected Behavior All available Android SDKs APIs should be available when the 'Run dialog is opened. h3. Actual Behavior Custom Android APIs copied into the folder from outside Studio are only available after closing and restarting Studio h3. Reproduce Start Titanium Studio Copy over a vendor android API addon (available from or ) From the app explorer pane, choose 'Run from the 'Run' drop down menu. Your new API is not available. Restart Studio. Open 'Run New API is now available.. Open the file in Titanium Studio. The crash can be reproduced by typing: $url on line 11 of I have to to get out of Titanium. I've included the crash log.. Unicode Code Points from the SMP are encoded according to CESU-8 rather than the expected UTF-8. h2. Problem Titanium Studio doesn't convert to UTF-8 correctly in case of Unicode code points starting at U+10000. When I a symbol located in the SMP (supplementary multilingual plane) from Safari Chrome into Titanium Studio and try to save the file, the output is not UTF-8, but CESU-8. h2. Steps to reproduce You can read the output file like this in the terminal: You will see two byte sequences (representing the high and low surrogate from UTF-16, Java's native character format) consisting of three bytes, that are encoded according to UTF-8. However, expected output is one four-byte sequence.. Create XSD for and files to provide validation. Console: Norwegian characters not correctly displayed. h2. Problem Console doesn't display Norwegian characters correctly. h2. Test case produces a console output in unicode \"Jeg kan l U00f8pe\". If the TiStudio installer is uted while logged in as a user, just as when any new software is installed, the user is prompted to provide the password. At the \"Choose Install Location\" stage, a path within the profile, of , is populated by default: ! Obviously standard users do not have write-access to this directory. We should populate this field with a directory under the user's profile, rather than the. ", "contenttype": "application/json", "created": 737358, "id": 97, "language": "en", "user_name": "pdowsett", "email": "appcelwiki@netaxiom.net"}]}