{"contentItems": [{"content": "CKEditor Provider shows a \"Not Authorized\" error on Browser component. The BRowser page of shows a \"Not Authorized\" error on Browser component when a registered user tries to browse the server. This error occurs in a child site, it doesn't happen on a parent site. Steps Create a child site Enter in that site Create a folder and deny access to Registered users Go to Host HTML Editor Manager and allow Register User to use the File Browser on provider Create a page and allow Registered Users to edit it As a registered User, enter in the above page in edit mode Edit content of a HTML module Click on Link button and after that on Browse Server button Actual A \"Not Authorized\" error is shown Instead showing the Browser page. See the attached image to see the error message Expected The Browser page should be shown and Child Site folder should be shown in the tree explorer. Issue fixed. Change looks good. Available on build. So far I suspect this is Telerik removal related, and assign to \"Telerik\" as its component. can see this error clear on IE Edge. - Open Developer Console Network - Log in as host, from menu click Pages Add New Page - Search for 404 error Result: following request get 404 error, might unnecessarily impact performance as well. Request GET. - Log in as host, goto home page and edit the page - Bring up \"Spell checker Check Spelling Grammar\". Results This Grammar checking dialog window is longer than \"Edit Content\" pop-up, it extended its UI but behind \"Edit Content\". For this instance, the \"Cancel\" button became invisible.. DCC API - file is stored under Folder Provider but managed as physical file. DCC API - Move validations from controller method into API.. DCC - Implement and for Content Fields of type List.. h2. Card As a DCC Viewer Editor, I want to be able to add content to items of type list and be able to see them. h2. Conversation This can be achieved by implementing the appropiate EditorFor methods in the class and the DisplayFor methods in the class for supporting fields of types list. This implementation will create html and javascript code to elements to the list. It mught be necessary to implement LabelFor methods in the class. DCC - Cannot add translations for a content field when creating a new one.. When different languages are enabled on a portal the name, label and description of a content field can be localized. However, at the moment of creating a new one the UI allows the user to enter the translations for each language but they are not stored at all (only the name, label and description of the language of the portal). The user can only add the translations at the moment of editing an existing content field. - Login as a superuser - Enable a second language in the site (Go to - Go to Admin - Dynamic content type manager - Edit a Content type (for example Employee) - Click on \"Add Field\" button - Enter a name, label and description a \"Language\" combobox - Enter a translation for the name, label and description - Click on \"Save\" button - The translation for the name of the content field can be seen on the grid - The name cell for the created field on the grid is empty, because the translation was not stored.. DCC - Quick Settings Implement as a JQuery plugin. Error creating new content field with invalid field type.. When a user adds a new data field to a content type, by default the selected field type is the text \"Content types\", which is not a real field type but a UI separator. It is possible to go ahead and create the data field but with an incorrect field type (there is no validation in the server side). Accessing again to the content type causes Http 500 errors. Please watch: - Log in as host - Edit a content type - Press the Add field button - Enter a name, label and description for the data field (leave field type as it is) - Press save - Reload the DCC-Manager again - Edit again the same content type - The content type information and its data fields are loaded and shown in the UI - The inputs are empty an a HTTP 500 error is logged in the browser console Not only we should not allowed invalid data fields: a server side validation for the content field data should be implemented and the errors coming it should be shown in the UI nicely (on a modal popup window, as in other parts of the DCC - Admin). I can't create fields with duplicated name, but I can modify the fields to have same name after created. Steps: - Log in as host and in DCC Manager create a new Content Type: BingType1 - Create 2 fields with different name - Modify one of the fields to have the same Name and Label with the another one. Result: It is allowed to change with same Name and Label. Expected: Should always check for Name Label's duplication.. Cannot find a superuser by email.. If we make a call to the method in the class we get a List of objects, which indicates us the roles that a specificar users has. However, the property is not filled with the actual value it has in database. Thus, it always has value. Assign a SystemRole to the Actual result All the returned UserRoleInfo objects have IsSystemRole false IsSystemRole true* The underlying stored procedure used is GetUserRoles, which makes a query on the view vw UserRoles. Adding the IsSystemRole field in table Roles to the view should fix the bug.. \"Resource cannot be found\" error when trying to Register as a new User and Cancelling. Host & Admin pages cannot be set to open link in a new window. When a user sets a host page or an admin page to be a link to other url and enables the option \"Open Link In New Browser Window\" it does not work: the link is always opened in the same browser window and the check is disabled again in the UI (although the associated TabSetting is updated in database). This last point only happens for Host pages. - Login as host - Go to Admin - Page Management - Check Manage \"Host Pages\" - Select any host page, \"Extensions\" - Click on the Link section - Select the option Link- Url - Enter a url. - Check the option \"Open Link In New Browser Window\" - Click on the Update button (Please note that the option checked in the previous step is unchecked again, which is unexpected) - Clear Cache. Tools - Clear Cache - Click on the Update Page. Following the examples: Host - Extensions - The url is opened in a new browser window - The url is opened in A decision should be made about the correct behavior: - Option 1. Hide the option \"Open Link In New Browser Window\" for Host & Admin Pages. - Option 2. Make the option to work for Host & Admin Pages as well. This issue only happens for Host & Admin Pages. In the case of Admin Pages the check remains checked but the url is not opened in a new browser window neither.. With Platform it was introduced a new caching layer in the Now when we get the PortalSettings we follow this order: Search at the HttpContext of the HttpRequest Search at the DataCache Search at the DataBase If the PortalSettings is retrieved in any of these steps we don't continue searching. However, when we update any PortalSetting and we explicitly clear the DataCache associated with that PortalSetting the previously existing PortalSettings in the HttpContext are not updated. This can cause incoherences within the same HttpRequest: a piece of code can update a portal setting with the option to clear the data cache and if afterwards it tries to get the stored value it would get the old value again. The fix should be the following: after updating a portal setting and clearing data cache the value in the HttpContext should be updated according to the new value.. EVOQSOCIAL - PortalSettings incoherence after update in the same Request. The class (in namespace) already has the method . It allows to search for all the Content Items that have the specified term. In some scenarios, it could be useful to make a search for a term only for the Content Items of a single Portal. This issue is about creating a new method with the following signature: It will perform the same search as the other method but restricted to only the ContentItems of a Tab that belongs to the portal with the provided id.. When a host user tries to add a New Page a javascript error is thrown and the action cannot be done. - Log in as host - Go to Users - Manage Users - Without changing the page, click on Pages - Add new Page - Enter the page Name, Title and Url test) - Select the \"Add to the End\" option in \"Insert Page\" - In Parent Page, select the option - Click on the \"Add Page\" button - The new page is created and added to the end of the root pages list - The browser is redirected to the new page. - The page is not created and a javascript error is logged on the console. When a users access to the search page passing a specific tag by the query string the page shows the same results twice. - Log in as Host - Create a new question with the word and the tag - Run the task \"Search - Site crawler\" in Schedule to index the content - Access to the url of searching passing by parameter the tag . You can use a url as this one: Expected result Actual result* - the page shows the question twice. Notice that the second results are inside a grid that had never been shown before.. Sometimes the log files shows the following error message: - (0x80004005): A potentially dangerous value was detected from the client ( : ). context) The url is the one that makes this error to happen, as you can see in the screenshot: Typically that error only occurs if a website is using in it's - we ship with which means that paths that contain colons don't cause the issue. The link is in that form to ensure that after a user registers (as register is a virtual page), they return to the correct portal - we could add code to detect if a single portal is installed and simply render it as a register.. When SOCIAL is installed in a virtual directory in IIS and a child portal is created, the registered users can't log in the child portal. - Install social in a virtual directory. - Login as host - Add to the list of site aliases in Admin- Site Settings- Site Aliases - Create a child portal with name \"child1\" - if it is not set, add to the list of site aliases in Admin- Site Settings- Site Aliases in the child site - Create a registered user in the child portal - Log out - Try to log in the child portal as the registered user created before - Page is reloaded but the user is not logged in. - The user should be logged in the child site. EVOQSOCIAL: Duplicated search results. The task Search: Site crawler performs the indexing of the content of the site. This process consists in the following steps: 1. Get all the that has not been indexed since last ution. A SearchDocument is each piece of content in DNN. 2. Delete the previous existing stored indexed version of each document (if it exists). 3. Index and store all the of 1. The step 2 is done by comparing some fields of the stored search documents with the fields of the new search document. The problem is that in this comparison the fields \"Keywords\" and the fields \"NumericKeys\" are used to compare. This is not correct, because they may change for the same document. Imagine this situation: - A content is added to the site and it is indexed - Afterwards, this content is edited and a new keywork is added to it - The indexing is run again and it detects that it is a new document (has a different keyword of the already indexed one) - A user performs a search using a word of the body of the content and he she gets 2 results, each one for the same content.. Changing the type of a new site doesn't delete the introduced alias. ", "contenttype": "application/json", "created": 737358, "id": 32, "language": "en", "user_name": "pedro.berna", "email": "-"}]}