{"contentItems": [{"content": "TiStudio - Git clone from address instead of. When uting the following code, if there are more than 29 rows, the app will crash when scrolling back up from the bottom of the TableView: (You may need to try more than 30 rows for the app to crash, as each device may vary this number) I have tried removing the \"className\" property from the TableViewRow, which stops the crashing, but prevents Buttons and other Views inside the TableViewRow redrawing correctly, so must be left in (as indicated by the Appcelerator Platform Docs). Due to our customers using JellyBean devices, we need the fix in or as the devices can't be upgraded to newer Android versions. This may be caused by an issue with 0-Based indexes used in or in. PROBLEM: When you want to read or write a file using and the memory used to store the data read written is leaked, leading to a crash after files for a few minutes. TEST CASE: This is how the file is read: This is how the file is written: In both cases the heap grows until the app crashes. I've attached an image which shows how the heap grows.. Implement NSUserActivity to enable Core Spotlight access. The following snippet from Apple shows this could be a Ti API.. The new iOS8 supports an destructive style, which is specified just like the cancel property. Pull-Request:. We need to update and re-build the following modules: h3. Commonly Used h3. Packaged with the SDK EDIT Removed from the list since it's android only. PR: h4. Test code: h4. Note: Test on device. I did use the search and did not find an issue already so I hope it is not a duplicate. Running the following code on iOS 8 you will notice that the message and the recipient(s) are not set in the email dialog. The dialog also seems to close automatically after a while but not sure whether it is related to this: Environment: Xcode 6 Alloy rc * iPhone 6 Plus simulator but also others are affected. ListView with a search, where the itemclick event opens a window. This defect works in the tutorial app ( ). The customer is having the same issue in their own app. 1) Wait for the elements list to open 2) Scroll down a bit, half a screen or more. 3) Click on an element (the name, not the symbol) and wait for the new window to open. 4) Close that new window by clicking the \"Done\" button. 5) Scroll back up to the top. Notice there is a white space where the Search was. At this point, it should be noted that the search is still there, it just appears blank. If you click into it, it'll appear as it should. h3. Edit: Simpler test case, copy and paste into. * h3. Test code: Reading a file from the Resources dir Creating, writing, and reading a file from the data dir Getting the directory listing from the data dir. Android: runtime error in. A client has encounter a problem in the file in the SDK. I have not been able to reproduce it. There is a \"delete account\" button than when pressed, it will fire a global app event. This event will close all the open windows, except the \"BaseWindow\" (heavyweight window in declared in including the one where the button is. The button is in a lightweight window that sits on top of the BaseWindow. After the windows are closed, a lightweight window (login window) opens on top of the BaseWidow (in place of the previously closed one). And this is where they're seeing this runtime error.. Sometimes it does, other times ditto for . (iPhone emulator) Restarting Titanium developer and deleting the build folder brought it back.. ", "contenttype": "application/json", "created": 737358, "id": 44, "language": "en", "user_name": "penrique", "email": "penrique@appcelerator.com"}]}