{"contentItems": [{"content": "This is for adding unit tests in CLI to verify the installed SDKs detection mechanism. - Install or Mock up a couple of SDKs in a temp location. - Set the temp location as one of the location for SDKs. - Now, CLI should detect the new SDKs and the new temp location as a valid one. - Remove those temp SDKs - CLI should detect the change. We can also add unit tests to verify whether CLI is able to sort the SDKs in the correct order or not.. Android: Installing an app to android emulator takes more time to build every times in windows 7.. Top menu bar receives events on Linux when other menu windows Preferences, About, Search) are open. This can result in multiple preference windows being launched. This is not a regression. This does not affect Windows 7 or Snow Leopard. This does not affect Eclipse on Ubuntu. Steps to 1. Open studio. 2. Open a menu window Preferences, Search). 3. Click on the top menu bar File, Edit, Expected Result: The top menu bar should not receive any click events. Actual Result: The top menu bar can receive events. However, the main editor frame is correctly blocked from receiving events. As a consequence, many info windows can be launched multiple times Search, About). However, the main preferences window can only have one instance.. Update with the new version Current url: New url: Let's use generalized url so that we need not change every time in the installer URL: update the existing url to point new version. Watchos2 app section is getting disappeared from tiapp editor after creating a new watch os2 app through ti app editor. Steps: 1. Open any sdk editor. To get it back, we have to close the editor and re-open it. Actual: Watchos2 app section is getting disappear after creating a watchos2 app. Expected: Watchos2 app section should not disappear and it should show the app location in tiapp editor.. Studio should handle the incompatible cache of ti info output. As part of installation process of Windows silent installer, we need to install Appc CLI stub and package in mode as well in the pre-requisites check.. Studio or higher versions should not support any BlackBerry functionality, even with previous Titanium SDKs.. Studio: Visual change in the Studio GUI in version. Cleanup downloading prerequisites with Mac Native installer. We have noticed a couple of problems with the Mac native installer and need to address them: 1. Files downloaded to temp folder should be cleaned up after installation completes 2. Download should use a buffer and flush mechanism (particularly to handle download of large files).. As per feedback from Neeraj the following issues will be handled through this ticket and Java should appear on next lines (as a column) and show the progress indicator next to each other. After installation, show a green check mark. 2. If all pre-reqs are already installed, then skip showing prereqs page.. Improve UI of Installer prerequisites plugin. Migrate the required JSON classes from socketio into jackson. Windows: Uninstaller - The uninstaller does not remove upgraded files from AppcStudio directory. Memory Leak with repeated debugging android app on device. In case CLI is not installed on the machine, then we would like to defer its installation until it is actually required. So, we should not prompt to install during the update wizard dialog either during the startup or even if the user check for updates. However if it is already installed on the machine, then we do need to check for its updates.. Defer CLI installation until the project is created. As every user doesn't use projects, there is no need to install CLI until the users are actually working with projects. So, if CLI is not installed, and the user attempts to create a project, then we should prompt and install acs CLI before we create the project.. Studio intermittently fails to retrieve the new version. The membership plans are associated with organization rather than with the user. So, if the user is part of multiple organizations, then we need to determine whether they have access to services by looking at the membership plans of all their organizations. If any of the membership plan is eligible for services, then we should allow them to install or update these services.. Studio: Unable to create project on Windows. studio UI interface is not as clean as studio. The UI for studio is not clean as studio. 1. In we see black border for windows & it does not look clean, while this is not the case for studio. 2. Also, the tabs in studio look malformed & do not blend with the rest of the window. (Please refer the attached screenshot for reference). Titanium updates are not installed when node is available, but npm is not available. Diagnostic test: Host OS: Mac OS X OS Version: OS Arch: x86 JRE Version: JRE Vendor: Apple Inc. JRE Home: Titanium Studio Version: Install Directory: Studio Workspace Directory: VM Arguments: -Xms128m -Xmx1024m Language: en US ACS App URL: ACS Login URL: XCode Version: Latest Titanium SDK: Titanium SDK Version: SDK Modules API SDK Timestamp: SDK Build Number: 222f4d1 SDK Location: Titanium SDK Version: SDK Modules API SDK Timestamp: SDK Build Number: b958a70 SDK Location: Titanium SDK Version: SDK Modules API SDK Timestamp: SDK Build Number: 787cd39 SDK Location: Browsers - Default system web browser: Unknown (N A) - Safari: Android SDK Version: Android NDK Version: Titanium CLI Enabled: true Host URL: null Version: NPM Path: NPM Version: npm -g ls titanium: Packages: env value: null Npm config prefix value : usr local ENV: SHLVL 1 USER pragma LOGNAME pragma. Pull out CoffeeScript plugins into Aptana Studio. Android is not detected on Studio Dashboard if only Android L is installed. Consolidate JSON classes into. Studio freezes momentarily and CPU usage is around 100%. Alloy: Debug on Simulator fails to hit break point. Create feature, builder, and Jenkins job for publishing irWatch integration plugin(s). h3. Issue After upgrading the XCode SDK to from and if the User launches the titanium app on iOS simulator, then the launch fails with the error 'invalid SDK version While launch the app, Studio does not validate SDK version stored in the launch configuration and it launches the app with the same old SDK version that is persisted in the launch configuration. h3. Workaround To workaround the issue, open the launch configuration and set the SDK to and then relaunch it.. Studio and does not show new iOS simulators in Run configurations. h3. Issue While debugging into the new issues reported by the user (TISTUD-5614), I have run into an issue with Studio, that it incorrectly use the obsolete cache to detect iOS simulators and SDKs. Due to this, Studio always displays simulator version such as even though or are available on the machine. h3. Workaround To workaround the issue, delete the files under and then, restart Studio. It should refresh the iOS info and show all the valid simulators.. After all the style elements are indexed, then the View file need to validate the missing style elements of 'class' and show any annotations if the class definitions are missing the corresponding style file or in the global file.. Create a Index reader to index all style elements defined in tss file. If a user defines style element such as 'class' for the a UI element in the View file, there is no way to let user define the style element block directly in the style file. Currently, they have to manually switch back to style file and then create the style data block using the 'class' element defined for the UI element. It would be easy for the user for a quick fix kind of mechanism, where they can press something similar to Cmd Ctrl + 1 on the class element value, and then create the style block in the tss file.. The View files in Alloy can contain ID types for each UI element. The types referenced in the View are probably defined in the corresponding Style file. Since Studio has knowledge of the Style code, it should allow to navigate the ID type to the Style code (similar to the F3 or method definition navigation in JDT Eclipse).. If a user defines style element such as 'id' for the a UI element in the View file, there is no way to let user define the style element block directly in the style file. Currently, they have to manually switch back to style file and then create the style data block using the Id defined for the UI element. It would be easy for the user for a quick fix kind of mechanism, where they can press something similar to Cmd Ctrl + 1 on the id value, and then create the style block in the tss file.. Alloy: Create a style section for 'id' from the View file. Studio fails to validate Android SDK after a new path is configured in preferences. Configure Android SDK - Android platform is not configured after fresh CLI install. BlackBerry: Fall back to default SDK path if the configuration file is not available. Add additional platform in the TiApp, for example to include Tizen. The platform shortcuts are not forever. If there is only one project in the explorer, then we need to unselect the project in the explorer to get the shortcuts related to Tizen. Otherwise, create a dummy project and change the selection between them to get the new platform launch shortcuts.. Android is still listed as the required SDK. The default user agents for Alloy and should refer to mobile platforms. The current default preferences for Alloy and project's user agent refers to the browsers such as Chrome, Firefox and IE. For Titanium and Appcelerator Studio, the default user agent should refer to mobile platforms (such as Android, iOS and others if required).. Studio should install npm packages locally into a folder accessible to the user without sudo permissions (to avoid problems described at TISTUD-5428) In order to accomplish this - 1) Currently we set global flag for any npm package installation. Mark all actions with npm packages without global to make them local installations. 2) The npm packages can not be in the .titanium or .npm folders under home directory. The folder name can not start with dot. 3) Remove the check for alias bin files in the usr local directory - as the local installation will not create symlink files in usr local directory. 4) Cleaning the cache sometimes requires sudo permissions - so we still need to prompt for password. However, use this password only for cleaning the cache.. Launch Profile Field Service app on iPad simulator and the launch throws an NPE error dialog : at. Investigate to generate reports from the performance tests. A few performance tests for studio3-core are already available and have been have been running now. However, if there's a regression, I think that's just silently logged in the DB right now. We need to generate reports from that data by comparing against the baseline performance) similar to : We need to investigate the required infrastructure or framework to generate the similar reports for the Studio tests.. ", "contenttype": "application/json", "created": 737603, "id": 88, "language": "en", "user_name": "pinnamuri", "email": "pinnamuri@appcelerator.com"}]}