{"contentItems": [{"content": "We should respect End Date no matter whether it is in past or not from my point of view. Issue description: Pictures shown in Edit mode are missing after page is published Steps: 1, Set up a EE site 2, Create a page in site menu 3, Add one HTML module with a sentence as content 4, Upgrade to 5, In IE 11, as CM, create a page in site menu 6, Add pictures as shown in the video 7, Modify the width of the first two content layouts, publish the page, modify and publish again, try a few times Actual results: When in Edit mode, the page shows all the pictures; after Publish, only one picture is displayed Video is attached below: Expected results: All pictures should be displayed after publishing the page. UI no response when trying to put a page in Edit mode with 3rd party skin. Issue description: UI no response when trying to put a page in Edit mode with 3rd party skin Steps: 1, Create a page in site menu 2, Install Star Chocolate skin 3, Apply the skin to the page 4, Add some layouts to the page, as shown in the attached screenshot 5, Go to other pages 6, As Host, try to put this page in Edit mode Actual results: Many times, there will be a message saying \"A script on this page may be busy, or it may have stopped Screenshot is attached with the message Expected results: There should be no such message and page will be in Edit mode quick. Issue description: Cannot access site with Runtime Error during upgrade Steps: 1, Create a VM with CustomerSites - TEST template 2, Get host privilege using for site 3, Create a superuser 4, Unzip PE package into site folder 5, Run upgrade by browsing the site again 6, Visit the site 7, Unzip PE package into site folder 8, Run upgrade Actual results: Runtime Error Expected results: Site can be successfully upgraded. Issue description: Page with future Start Date is not accessible by CM or Host Steps: Set up a site Create a user and assign the user Content Manager role As CM, create a page and put it in site menu As Host, go to Page Settings - Advanced Settings - Other Settings - Start Date, and set a future date ** Or check the Disable checkbox Try to access the page as Host or CM Actual results: A message - Page cannot be found, no page content is displayed Expected results: Even a page is set a future Start Date or is disabled, the page should be still visible for CM and Host. 404 page management not exposed in UI. Issue description: Job retry does not work as expected per Lapse Time Steps: 1, Install a site with FQDN 2, Go to Admin - Search Admin - Advanced Crawlers tab, and modify the one entry in URL Paths to be one which does not exist 3, Clear cache 4, Go to Host - Schedule, and click Edit icon for Search URL Crawler 5, Enable the job, set Frequency as 2 minutes and Retry Time Lapse as 30 seconds, and click Update 6, Back to edit popup for the job, and click Run Now button 7, Wait for 20 minutes around 8, Check job history Actual results: 1, Because the URL in Search Admin does not exist, the job history should fail all the time, but it shows Success all the time 2, Retry only happened just after Run Now, and then no Retry anymore in job history Expected results: 1, Job should fail all the time because the URL does not exist, and the failure should be displayed in job history 2, Retry should be performed after each failure of a job. As the author of the message, that user should be able to see the post. I think we should not hide any private post from the author. Improve Edit Module Settings Scenario. Issue description: Non members of a social group should not be able to search group contents Steps: 1, As Host, create a page, put in page menu, delete the default HTML module, and Add Social Group module 2, Grant View permission for registered user to the page 3, Copy Permission to Children 4, Use Auto Config for Social Group module 5, Create a group 6, Create a user through Admin - User Account 7, As Host, post some items and comments to Journal module under Social Group 8, Run Site Crawler in Host - Schedule 9, In another browser, log on as the registered user 10, Join the social group 11, In search box at top right corner, type in a word which is included in a post or comment in Journal module under Social Group 12, Leave the group as the registered user 13, Clear cache and recycle app pool 14, As the registered user, type in the same word as last time and run the search Actual results: Even after the user leaves the social group, the user is still able to search the contents for the social group Expected results: Once the user leaves a social group, it should not be able to search any content from that group. As site Admin, when exporting the same module, there is no content exported, and there is no error. Issue description: File name should be clickable url in notification under folder workflow mechanism Steps: 1, Log on as Host 2, Create a page and put it in page menu 3, Delete the default HTML module and add DAM module to the page 4, Grant View permission to registered users for the page and DAM module 5, Create a standard folder under Root and upload one file into the folder 6, Right click the folder in folder pane, select View Folder Properties, check Enable including sub folders for Workflow, and Save 7, For the same folder, in Permission tab of View Folder Properties, grant Browser Folder, View Folder and Add permissions to registered user 8, Create a registered user and grant it Administrator role 9, In another browser, log on as the registered user, go to the folder created, and upload the same file again 10, Right click on the file uploaded, go to Workflow tab and publish the file as the registered user 11, As Admin, find the notification related to file approval Actual results: In the notification, the file name is not clickable url, and the notification does not explain Expected results: The notification should show clickable url, by clicking the url, Admin can go to the to finish the approval process. Usage of Email Delivery Schedule settings is wrong. Issue description: File name cannot be displayed in DAM with group mode Steps: 1, Log on as Host 2, Create a page, put in page menu, delete the default HTML module 3, Grant View permission to registered users for the page 4, Add Social Group module to the page 5, Auto Config for Social Group module 6, Create two social groups 7, Go to Group-Activity page of each social group and add DAM module to the page and set DAM as group mode 8, Go to the parent page for all social groups, and click Copy Permissions to Children 9, Create two registered users through Admin - User Accounts 10, As the two registered users, log on to the site and join the two social groups 11, Go to DAM module as registered user, click the upload button to upload a file Actual results: User cannot see the file name in DAM because the column for file name is too narrow Expected results: User should be able to see at least part of the file name. Issue description: \"Site Management is currently unavailable\" when deleting child site in cloud environment Steps: 1, Log on to cloud site Website Address Website Login AK5X9A host 2, Create a child site 3, Click Edit icon for the child site and add description 4, Click Delete icon for the child site 5, Go to Host - Site Management again and click Delete icon Actual results: 1, After step 4, an error popup 2, After step 5, child site is successfully deleted Expected results: There should be no error after step 4 and the child site is deleted successfully. Here is the information from Support: For a simple folder, Folder permissions are as followed: - Admins has Permission to everything - All Users has access to View and Browse Folder permissions only - Registered Users, Subscribers and are usually left empty.. Here is the information from Support: Module permissions on 95% of the time are inherited from Page.. In the event that a user role has been granted FULL CONTROL EDIT rights for a Page, it overrides all other individual permission settings for that user role, and modifying individual permissions will set FULL CONTROL EDIT to \"Not Specified\". In the event that a user role has been denied FULL CONTROL EDIT rights for a Page, it overrides all other individual permission settings for that user role, and modifying individual permissions will set FULL CONTROL EDIT to \"Not Specified\".. Issue description: LP cannot be installed in cloud environment Steps: 1, Log on to cloud site: Website Address Website Login AK5X9A host 2, Go to Host - Extensions - Available Extensions - Language Packs, and try to install German and Spanish LPs Actual results: 1, The message on screen says \"502 - web server received an invalid response while acting as a gateway or proxy server\" 2, A new entry under Language Packs section is created for German LP after installation failure, then the entry is gone after installation of Spanish, and a new Spanish entry is added with Install button at the most right column, as shown in the screenshot Expected results: LP is successfully installed without error. Confirm with dev, there is no easy way to test it as QA. Issue will be closed based on Charles' code review. ", "contenttype": "application/json", "created": 737603, "id": 33, "language": "en", "user_name": "robert.cui", "email": "-"}]}