{"contentItems": [{"content": "Content validation fails when pushing images from Docker on RHEL CentOS 7. Pushing images from Docker into Nexus fails with a content validation error. Disabling file content validation seems to fix this problem. I've captured this in a Charles Proxy session, output is attached.. Create a \"p2 update site\" proxy repository with this URL for the remote: This fails due to the fix for NEXUS-7839: WARN admin - Could not download feature referenced by update site aaa Repository UID path may NOT contain relative tokens: This is due to this entries like this one in the This is a regression from Nexus. As of version the download nuget feed task is no longer needed for nuget proxy repositories. We stopped scheduling this automatically in that version, and told people to remove the task in the release notes. But still, I very often see customer configurations that have this task running. We're planning a community outreach to get people to remove this task from their instances. While I was writing up the content for that it occurred to me that the negatives associated with this task for both the end user and are very significant: Over time causes size of the nuget h2 database to grow so large that queries And really, there is almost no benefit to running this task. I'm thinking we should disable this task in Change the name of the task to \"Download NuGet Feed (DEPRECATED) Change the default implementation to be a no-op. produces OBR metadata which cannot be parsed by felix. Configure proxy to Configure proxy server in nexus. Make these requests: curl -s -v -4 gets 404 curl -s -v -4 gets 200 but nexus sends TWO requests to remote - see NEXUS-7616 ( this creates a file at ) cat bower Then request: curl -s -v -4 Nexus returns 500 response. jvm 1 INFO admin - Applying Nexus Configuration due to changes in made by jvm 1 INFO admin - The Remote URL of repository \"npmjs\" (id npmjs) has been changed, expiring its caches. jvm 1 INFO admin - Scheduled task started :: Expiring caches for repository npmjs from path null and below. jvm 1 INFO admin - Scheduled task finished :: Expiring caches for repository npmjs from path null and below. (started runtime jvm 1 INFO admin - Applying Nexus Configuration due to changes in made by jvm 1 INFO admin - Applying Nexus Configuration due to changes in made by jvm 1 INFO admin - Saving model jvm 1 INFO admin - Saving model jvm 1 DEBUG anonymous - CookieSpec storage!, caused by: Could not create the directory hierarchy in repository \"npmjs\" to write caused by: Not a directory jvm 1 DEBUG SYSTEM - Close connection. Create a set of yum enabled repositories: Because \"GroupB\" only has one member mergerepo is never run against it. it contains no yum metadata. This breaks running mergerepo against \"GroupA\", it will fail every time with error: Could not merge repos: Could not setup merge repo pkgsack: Cannot retrieve repository metadata for repository: repo1. Please verify its path and try again I think the simplest fix for this would be: Implement NEXUS-6801 (prevent generation of sqlite metadata) If a group only contains one member copy that member's metadata and rewrite the URL in the file. Add a mode to staging which allows explicit profile selection, and also enforces repository targets. Set up a two nexus instances, one proxying the other with smart proxy + preemptive fetch. Artifacts deployed to the remote are downloaded 3 times. Retrieval: DEBUG SYSTEM - GET - ms DEBUG SYSTEM - Storing file to DEBUG SYSTEM - Storing file to. OBR virtual repository metadata update triggered by smart proxy preemptive fetch fails.. A virtual OBR repository shadowing a maven release proxy repository is not able to update it's metadata in response to a smart proxy preemptive fetch due to lack of privileges. WARN *SYSTEM - Could not sync shadow for event , A storage exception occured! at Source) Source) Caused by: A storage exception occured! 40 common frames omitted Caused by: Access denied on repository ID 'obv', action 'read'! 41 common frames omitted. Fire up Nexus and retrieve this URL: This works. Now try the same with Nexus This will fail, the artifact is rejected by file content validation. I'm not sure why, the magic number is correct, and various zip programs I tried (including jar) unpack it without complaint. jvm 1 INFO admin - Proxied item evaluated as INVALID during content validation sourceUrl. Print message in log if high-strength JCE is not installed. Not having JCE has been known to cause problems with some installation We should detect if it is installed, and if it isn't log a message at startup. Apparently calling this will work for this purpose: It will return 128 if no JCE is installed, 2147483647 if it is.. Requesting a folder which does not exist in a proxy repository's local storage causes a file to be created in storage.. Nexus is returning 501 for MKCOL now, previous versions returned 405. Update: Seems the issue here is monitoring software looking for 50x responses. This change causes a steady stream of false alarms for some setups. Update 2: This is causing build slowdowns, since the builds are attempting to create each parent directory individually in response to 501 rather than just giving up as it did with the 405 response.. If \"application server settings (optional)\" is not checked than page can't be saved.. We are running nexus and jenkins on the same tomcat server. When setting the proxy settings in nexus, these settings are saved in proxy system properties. These properties are shared for everything running in tomcat. Nexus requires the non proxy hosts to be configured as regular expressions. This leads to a system property This is however not a valid value according to (This is a list of patterns separated by ' '. The patterns may start or end with a '*' for wildcards. Any host matching one of these patterns will be reached through a direct connection instead of through a In short: if nexus uses it's own proxy configuration standards, it should not modify, nor use the system properties.. Need workaround for cases where trial installer cannot be run.. We've found that the Linux installer cannot always be run successfully. Typically causes of this are lack of X11 libraries (NXCM-4628) or strange http proxy setups. For cases where the installer fails we need a way to provide Nexus Pro + trial configuration without a full installer. This could be the standard pro distribution + a trial configuration bundle for instance.. The scheduled task drop down is not sorted, which makes it painful to add new tasks (very difficult to find some of them).. File content validation for XML files fails if file only contains whitepace. Nexus upgrade does not propertly back up changed configuration files.. Upgrading to latest Jetty 7 would eliminate these. Fixed in Nexus For older versions see here:. Upgrade lucene to newest version (that we think is stable).. Upgrade to Jetty 8. Nexus doesn't run under IBM java. Nexus won't start when running under IBM java. Tried both version and Logs attached.. Attributes upgrade logs exception when it doesn't encounter. Attributes upgrade blows up when isn't at root of old directory: jvm 1 ERROR - - Unable to perform file read from legacy attributes directory: jvm 1 (No such file or directory) jvm 1 at Method) jvm 1 at jvm 1 at jvm 1 at jvm 1 at jvm 1 at jvm 1 at jvm 1 at jvm 1 at jvm 1 at jvm 1 at jvm 1 at jvm 1 at. The NFC for an M1-M2 shadow repository is 15 minutes. If you have an M1-M2 shadow of an M2 proxy repository Nexus makes a remote network call through the M2 proxy repository every time this limit is reached. Note that we ship with an M1-M2 shadow of maven central.. Placeholder issue for SUPPORT-1109, once we get latest logs we'll be able to start work on this.. Requests to an auto-blocked repository are added to NFC. I added a proxy repositories for and Immediately after, I tried to change the \"public\" URL to use \"https\". The save timed out. It was nearly 5 minutes before I could get it to go through.. Suppress generation of maven 3 metadata when older maven versions are detected. The role-request XML payload is not documented correctly. This should be:. There was to be a fix in so that the task wouldn't fail if it couldn't delete a directory: NEXUS-4122 I see this wasn't done. I'm glad you at least found a workaround.. ", "contenttype": "application/json", "created": 737603, "id": 64, "language": "en", "user_name": "rseddon"}]}