{"contentItems": [{"content": "Spring flo issue with unexpected char. As a developer, I'd like to move k8s SPI to it's own repo.. Move k8s SPI to a separate repo. Counter sink does not accept SpEL expressions. Execution list page includes child jobs in pagination scope. Add consistent support for \"undeployed\" state across the deployers. As a developer, I'd like to add support for status consistently across all the deployers, so I can present the correct status instead of the current . This is applicable for existing streams without any deployment context associated with it.. As a developer, I'd like to add status for CF SPI, so I can represent the correct status instead of the current state.. Update documentation the difference between the message bus here, ie that on Redis you should only deploy one instance consuming from a tap or topic.. As a developer, I'd like to submit a PR for existing work on Mesos SPI.. Move Mesos SPI to a separate repo. SPI level design specs are documented for design review. Spike: Explore options to scale modules from shell. Upgrade to Lattice release. Create admin artifact and CI build for YARN. As a developer, I'd like to create separate repo for YARN SPI, so I don't have to bundle all SPI variants under one admin project.. POM for each hadoop distro is available * New CI build is added. Create admin artifact for each Hadoop distro. As a developer, I'd like to split artifact packaged with hadoop distro specific libraries, so I could avoid adding all variations of hadoop libraries under one project.. Add 'undeployed' status for YARN SPI. As a developer, I'd like to add status for YARN SPI, so I can represent the correct status instead of the current state.. Utility function exist and overridable for custom modules Implementation details are documented with an example. Resolve remaining gaps with CI. Guide to repeat it for other SPIs documented. Launch GF cache server for integration tests. Turning on HA via Ambari plugin requires custom configuration. Add support to build Admin with individual SPI deployers. As a developer, I'd like to break the build lifecycle to bundle SPI deployers individually, so I don't have to build with all the deployer variations as one whole thing.. project build includes option to build by SPI deployer. how do we operationalize data flow on YARN? (scripts?) what's the security story? * HA, FT and Scale - are we feature parity with XD?. Moved to GH issues.. Multiple module instances consuming from taps or topics get duplicate messages on redis Message Bus. Port Log as sink. JMX MBean name clash when using labels with deployment. maven repo includes module with respective details. Prevent streams with duplicate name. As an user, I'd like to deploy on Mesos.. As an user, I'd like to have tab completion on shell, so I can interact with the modules and its available options.. As a user, I'd like to have the flexibility of property access through SpEL, so I can build stream definitions with inline property overrides.. Spike: Explore options to setup bare-metal deployment of using Lattice. As a developer, I'd like to explore options to bootstrap and setup Lattice based infrastructure for bare metal deployment.. POC prototype available for review. Include flag in REST endpoint. * Existing JOB REST API includes flag to identify parent-child relationships within the workflow. As an XD user, I'd like to have a REST endpoint that returns job composition , so I can use it to differentiate visual representation between parent-child relationship and standalone jobs.. Add support to restart job composition. Expose status for each job within the composition. maven repo includes module with respective details. maven repo includes module with respective details. maven repo includes module with respective details. maven repo includes module with respective details. maven repo includes module with respective details. Add TAP support for Rabbit binder. Support for is available for rabbit binder and I'm able to successfully tap the primary pipeline data for parallel ad-hoc analysis. As a user, I'd like to continue to use XD features in Spring Cloud Data Flow.. As a user, I'd like to use to orchestrate data pipelines using Spring Cloud Data Flow.. Support for Gemfire as module deployer. As a user, I'm unable to push admin app to CF due to SSL certification errors while bootstrapping. Consider adding as a CF SPI dependency. Adding CF trusted certificate as dependency doesn't help either:. As a user, I'm not able to shutdown from Admin UI with the following stream definition deployed. More details .. Enhance test coverage for YARN SPI. Spike: Explore options to support YARN integration tests. As a XD developer, I'd like to upgrade to SI Spring Boot and AMQP dependencies, so I can take advantage of the latest improvements.. As a XD developer, I'd like to move from modules repo to XD proper.. Move to XD proper. Add support to load Hadoop distribution of choice. As a user, I'd like to have the option to choose Hadoop distribution of choice, so I can load the right Hadoop libraries in the CP.. Unit tests included to simulate successful load. As a developer, I'd like to refactor CC SPI deployer with CF java-client, so I can improve the overall design and performance.. , , , stream operations ute successfully. Property overrides for modules can be successfully injected via external config files. As a developer, I'd like to pass any overrides via external config file, so I can influence and override the default module (ex: module resolution from a different maven coordinate).. Add property override support for modules via external config file. As a developer, I'd like to add support for having different binder types for module's channels, so I can plug , , or as the source or sink to read and write respectively.. Spike: Study support for different binder-types for module channels. * Explore and document options for pluggable bindes to support redis, kafka, or rabbit. As a developer, I'd like to add test coverage to test commands in isolation, so I don't have to run full stream deployment based functional tests. More details .. Spike: Investigate options for composed jobs repository. As a XD developer, I'd like to explore repository options for \"composed jobs\", so I have the leverage to read write composed job definitions.. POC prototype available for design review.. Suport to compose batch jobs. As an XD user, I'd like to compose multiple jobs via Flo, so I don't have to write a custom job module to orchestrate them.. Spike: Study scope to add support for hdfs commands in shell. release version is included in the banner. As a user, I'd like to create a new banner, so I can embed and display the banner when the shell server boots-up. Perhaps use this ?. Correctly report state of module instances. Caveats and bootlenecks captured. Following sections were captured: Deployment variants Module development workflow * Shell UI. * gh pages branch exist for and repos. SCD Admin will have connection information for a task and job repository. This information will need to be transferred to the Task Launcher. The scope is to study the following options: should be an option? * If nothing specified, the default is always YAML?. Spike: Study options for loading reusable configurations. Create a Rabbit Kafka Available Rule in. Can take from previous implementation in Should have a way to enforce not skipping tests based on an environment variable. Consider moving this coverage to SI \"commons\" or equivalent.. As a developer, I'd like to create a new project to contain all the rules associated contract, so it is isolated from core and reusable by test coverage as needed. Consider moving this coverage to SI \"commons\" or equivalent.. As a developer, I'd like to create auto configuration for binder so I can automatically configure the Spring application based on the dependencies.. Port Trigger as source. As an user, I'd like to have the option to deploy modules in YARN, so I can leverage this implementation to spin-up OOTB modules as Apps in YARN.. Document migration strategy from to. Port gemfire-server sink as module. Port Rabbit as source. As a developer, I'd like to move module from XD to repo, so I can use it as to build streaming pipeline.. maven repo includes module with respective details. Port FTP as sink module. maven repo includes module with respective details. As a Spring XD developer, I'd like to port module from XD to repo, so I can use it as modules to build streaming pipeline.. Port File as sink. Port Router as sink. As a Spring XD developer, I'd like to port module from XD to repo, so I can use it as module to build streaming pipeline.. As a Spring XD developer, I'd like to port module from XD to repo, so I can use it as module in streaming pipeline.. As a developer, I'd like to derive a strategy for module metadata via , so I can implement command in shell to list all the module properties.. Add support for 'module info' to list module properties. As a XD user, I'm trying to access URI (- GET jobs but it fails with 403 forbidden error for the role with view access. More details . Another URL with the same error:. As a developer, I'd like to implement undeploy operation for (single JVM), so I can use this target to undeploy a running stream. More details in . Its a prerequisite to determine consistent undeploy strategy for both and .. * Multiple libraries can be successfully loaded through BOM coordinates. Resolve the glitch loading multiple libraries using BOM template. Spike: Investigate the inclusion of message bus binding libaries. Implement undeploy operation for CC SPI. Add test coverage for CC SPI. As a CF user, I'd like to use Spring XD on CloudFoundry, so I can leverage the benefits of CloudFoundry while running streaming and batch pipes using Spring XD.. As a Spring XD user, I have a development installed on windows. Post upgrade, the custom modules no longer show up by just placing them in the directory. Instead I have to use the 'module upload' command to install the modules. More details in .. Migrate from XD. As a developer, I'd like to investigate the right approach to port as the provider to support module from XD, so I can decide better handling of HDFS dependencies, which needs loaded and available in root CP at the runtime.. Add PHD HDFS as module. Add support to resolve and add JARs to Boot loader. As a developer, I'd like to resolve and then add module dependent JAR's to Boot loader, so I have an approach to handle external libraries (ex: database drivers) required by OOTB modules.. Unit test coverage to simulate the lading of external JARs * Best practices doumented. As a developer, I'd like to adapt redis from XD to so I can build streaming pipes using modules with simple counters to feed dashboards.. Port Redis counter as sink. * Invoking after successful creation lists the stream. * stream works as expected without an externals transport middleware. As a user, I'd like to use in-memory streaming repository, so I don't have to spin up transport or analytics store; instead the pipe takes advantage of in-memory as the peripheral to run streaming pipelines.. Add in-memory streaming repository. As a developer, I'd like to establish the foundation to expose REST-APIs to interact with the and likewise perform CRUD operations to maneuver streaming and batch pipelines.. Some streams can't be created using FLO. As a user, I'd like to refer to documentation while migrating to release.. ambari install procedure and config changes are updated with * install procedure updated with. Update installation instructions. Create basic TaskLauncher. h2. Narrative As Spring XD, I will be able to launch Spring Boot jar files as Diego Tasks. h2. Back story The will be responsible for listening for launch requests, looking up the definition in the , and launching it. The first implementation of this would be a Receptor based The scope here is to produce a basic version of and incrementally evolve into comprehensive launch capabilities.. Spike: Investigate integration options with ipython. As a developer, I'd like to setup a CI workflow to build, bundle and upload the image to DockerHub, so I don't have to worry about having a local-private docker registry for It could be nice to have the image uploaded to existing DockerHub location.. As a Spring XD developer, I'd like to port OOTB modules from XD to model, so I can reuse and build messaging microservices. Prioritized list .. Port FTP as source module. As a Spring XD developer, I'd like to port modules from XD to repo, so I can use them as modules to build streaming pipeline.. maven repo includes module with respective details. As a developer, I'd like to setup CI builds for builds, so I can incrementally build and test code commits automatically.. As a Spring XD user, I'd like to capture module (aka: ) metrics directly, so I can relay that information via REST-APIs and not depend on the current coupling of 's. Currently, there are two different ways we could consume this information from applications. SI's and SBoot's APIs are the few to explore as part of this scope.. Pagination component is behaves coherent across all pages in. Potential POC prototype code included * Next steps (feature stories) captured. As a Spring XD user, I'd like to use based implementation of XD Admin SPI (based on so I can run data pipeline use-cases running on CF. Relevant repos: Please refer to XD-3194 or XD-3229 as sample ( google doc ) that were completed in the last sprint.. Move serialization codec from XD to. As a developer, I'd like to move 'serialization codec' from Spring XD repo into SI, so I can update Spring XD to inherit the via maven dependency.. As a developer, I'd like to move message-bus from Spring XD repo into so I can update Spring XD to inherit the via maven dependency.. Installation methods and example targets are documented Working POC as demo-ware is included. As a developer, I'd like to brainstorm and investigate various techniques around installation of XD modules from a maven repo, so I could define the module from CLI to have the module downloaded from the repo and installed to a running Spring XD runtime.. Move branch to EC2 CI infrastructure. Enable component model for. As a developer, I'd like to create an annotation () driven programming model for modules, so instead of explicitly defining I O channels as beans on the module, for classes annotated with , the application would be responsible for creating the actual channel beans and channel adapters vs. the developer creating concrete channel instance types.. Spike: XD Admin SPI to discover modules. As a user, I'd like to investigate the possibility of modules themselves to service discovery, so I could use Spring XD runtime (running on CF) to discover and orchestrate such modules through streams.. Spike: Kickoff distributed Receptor implementation of Admin SPI. As a Spring XD user, I'd like to use Diego based Receptor implementation of XD Admin SPI (based on so I can run data pipeline use-cases running on CF Lattice Diego.. Spike: Kickoff singlenode implementation of Admin SPI. As a developer, I'd like to develop a singlenode (in a single JVM) implementation of XD Admin SPI (based on Module Launcher), so I can run data pipeline use-cases locally.. Improved test coverage included to cover gaps * Including S-Bus as dependency inherits the relevant APIs required by Spring XD. Move serialization codec from XD to. Move input output from XD to. Improved test coverage included. As a developer, I'd like to move input output type conversion from Spring XD repo to so I can implement a custom module which produces or consumes a custom domain object.. Improved test coverage included to cover gaps * Including S-Bus as dependency inherits the relevant APIs required by Spring XD. Move message-bus implemenation from XD to. Handle stream job deployment status recalculation failures. Split core dependencies between and XD proper. Spike: Investigate the use of config server for modules. * Current MASTER branch successfully migrated to EC2 infrastructure. As a developer, I'd like to migrate the current MASTER branch CI builds to EC2 instances, so I can manage them all in one-place reliably.. Move MASTER branch CI builds to EC2 based infrastructure. Spike: Investigate and the XD fit. Spike: Explore options for batch modules to be short lived. Update Master Environment for CI Acceptance Tests. Refactoring of the to split apart the concepts of repository and deployment. For reference see XD-2835, XD-2671, XD-2877 and XD-3070.. * Changing the number of variable n in should spin-up n number of 's. As a developer, I'd like to have JMX turned-off by default, so I can take advantage of the performance throughput benefits.. As a developer, I'd like to upgrade to release of Reactor, so I can inherit the latest optimizations to further improve XD performance. Spike: Support graceful shutdown of modules in a stream. POC outcomes documented * Next steps listed. As a user, I'd like to have the option to gracefully shutdown the stream, so when it is undeployed while in the middle of its operation, we would want to complete its journey to the sink before XD stops the stream. One of the streams has a custom module that performs archive extraction. When this stream is undeployed while in the middle of extraction, It looks like the message goes to the DLQ. However we would like the message to complete its journey to the sink of the queue before xd stops the stream. Is this possible?. The above stream should consume form the mail source and write it to logs. The unicode requirements for the and needs documented. Gmail specific requirement (such as: 993) needs documented. Add a new source module to capture video frame from camera or video files. As a user, I'd like to refer to the documentation, so I can configure HDFS backed module registry (XD-2287) as recommended.. Deploy stream in a single xd-container. Add a new variation of DSL parser for Flo. Share it with the customer for feedback. Add polling twitter source. MVP test coverage included * MVP version of the receptor client submitted for CF incubation. As a user, I'd like to use the Java receptor client, so I can interact with Diego runtime using the Java receptor REST APIs.. Submit java receptor client for CF incubation. Documentation for. Add a CoAP source module. Document performance benchmark results. As a developer, I'd like to document performance benchmark results along with the infrastructure specifics, so I can publish the blog for to use it as a reference while setting up Spring XD cluster.. Code samples to demonstrate the various reasoning exist within the docs. Create samples and document Kryo optimization guidelines. Parameterize import options for Sqoop. As a Spring XD user, I'd like to create streaming pipelines, so I can take advantage of latest specs from both XD and Spark Spark Streaming.. Upgrade Spark version to. Spark tests pass * XD certification docs updated. Create persistent stream repository. As a developer, I'd like to create persistent repository for streams, so I could leverage the persisted metadata and reestablish the streaming pipe under failure conditions.. Sqoop Module not running. Create a reference architecture for high throughput RT analytics using XD and Kafka. As a user, I'd like to upgrade to Spring Boot release, do I can leverage the latest improvements and bug fixes. We should also sync-up the following dependency updates to :. Improve HA support for Rabbit. As a user, I logged in with ROLE CREATE and I get an error while trying job creation from admin ui. I can create job from the shell successfully. Trying the same workflow with ROLE ADMIN results with the same error as well. I don't see anything in the logs about the error itself.. OOTB batch job available both in the shell and admin ui * Includes respective required and defaults wrt metadata. As a developer, I'd like to create a Kafka use-case, so I can study, demonstrate, and verify kafka + xd play that's built for scale and performance.. Create a generic simulator for data ingestion * Should be verify to deploy the use-case using Kafka as the transport. Create a POC for gpfdist sink. Once installed, sink module shows up in shell Should be able to verify data population in GPDB -Publish design approaches wrt automatic creation of external tables and when to perform the actions-. Research how to accommodate dynamic partitions when scaling containers. Improve the performance of jdbchdfs batch job. As a developer, I'd like to continue Lattice Diego POC so that I can identify the scope, risks, and the overall design for a pluggable SPI in XD runtime.. section: Ref. architectures use-cases section: Performance Benchmarks section: Competitive analysis. As a PM, I'd like to have a static to organize the collateral such as samples, tutorials, links, perf. benchmarks and ref. architectures so that it's easy for anyone to quickly get up and running on XD.. Create \"gh-pages\" to organize samples, links and tutorials. As a developer, I'd like to measure performance numbers for a simple stream so that I can characterize the overall throughput.. Measure performance baseline for a simple stream. Uses Kafka as a message bus * Overall throughout measurement can be listed as \"x msgs sec\". As a developer, I'd like to add a mongodb source using an xml and a property file supporting mixing in of parameters so that I can use this module to ingest data from Mongo.. Add a MongoDB source. Add Kafka load generator source. As a developer, I'd like to document the changes to message headers so that users can refer to the section if there are any serialization errors when reusing the batch-jobs in release. Perhaps this could be part of section in our wiki.. As a developer, I'd like to bench Kafka as message bus using in-built perf-testing utilities so that I can use that as a foundation to build XD use-cases and measure performance. I'd like to reproduce baseline performance metrics as identified by the Kafka .. Reproduce baseline numbers for Kafka. Upgrade to SHDP GA release. As a developer, I'd like to upgrade to SHDP GA so that I can sync-up with latest features.. Update XD's SHDP dependency to the maintenance release. As a user, I'd like to have the description for each of the modules so that I can use it to understand the module purpose and it's capabilities (presumably what is captured in javadoc for the module definition).. As a build manager, I'd like to have Spring XD RPMs published in repository so that users can directly download the bits without having to go through appsuite repo or the EULA.. Upgrade XD's SI Kafka dependency. As a developer, I'd like to benchmark Rabbit performance so that I can use the results as reference to setup XD cluster.. Setup infrastructure to run the test scenarios * Document gaps. Document test scenarios for performance testing. Placeholder for Spring XD Lab. Improve acceptance testing coverage. The scope is to address the sub-tasks linked with this story.. Prep for DEBS Challenge. As a developer, I'd like to study the taxi trips based on a stream of trip reports from New York City so that I can evaluate event-based systems in the context of real-time analytics using Spring XD.. As a field engineer, I'd like to have reference architectures built on Spring XD so that I can use that as reference building POCs. The scope is to get the raw domain specific ideas captured as first step.. Create first-cut on reference architectures for domain specific use-cases. Add a separate 'Admin' command to clean-up queues topics. As a developer, I'd like to create a example to demonstrate JDBC to HDFS data movement.. Replicate Storm examples in XD. As a field engineer, I'd like to have a comparison of Storm examples in Spring XD so that it is easy to relate from implementation standpoint.. remains as-is * Old wiki pages should be changed to explain where to go now (generated doc for reading, sub folder of main repo for cintribution).. As a developer, I'd like to build data pipeline using Kafka as as message bus in XD so that we can demonstrate some of the capabilities. Lambda architecture how to eliminate tight coupling of business logic ** how Kafka can be used for reliable reprocessing. As a developer, I'd like to run Kafka tests with Kafka Server as a separate running process so that I can improve build experience.. As a developer, I'd like to refer to wiki so that I can configure machines with recommended ulimit setting for XD's distributed setup. Recommended ulimit setting is 10K under (new) section (reason to increase ERROR - Exception deploying module (Too many open files). As a developer, I'd like to upgrade to Kafka's SI GA release so that I can sync -up with the latest bits. The scope is to backport Kafka XD changes to SI Kafka and then upgrade to the GA release.. As a developer, I'd like to build Spark Streaming as data processors in XD so that we can demonstrate some of the capabilities. Scala. Create Spark Streaming example. As a developer, I'd like to run acceptance test coverage in Windows so that I can evaluate XD The scope is to provision Windows image in EC2 and run acceptance test in the environment. Potentially also try to create this as CI build.. Spike: Research request reply support to Kafka Message Bus. The scope is to research the available options to provide request reply support for Kafka. POCs Previous Desc: The bindRequestor and bindReplier methods of the message bus need to be implemented.. Add Ambari plugin (beta) to build and install Spring XD. As a developer, I'd like to use Ambari plugin so that I can provision, manage, and monitor Spring XD cluster using the same tool I use for Hadoop clusters.. Document limitations Host Spring XD Ambari bits in public Ambari repo. Add test coverage for 'complex objects' as payload. As a user, I'm trying to list streams ( 20) in admin-ui to use the pagination; however, I ended up with blank page and the server-side errored with Version: SNAPSHOT (master build) Distributed: 1 admin and 2 containers 1) Deploy the following streams. stream create foo1 \"time log\" stream create foo2 \"time log\" stream create foo3 \"time log\" stream create foo4 \"time log\" stream create foo5 \"time log\" stream create foo6 \"time log\" stream create foo7 \"time log\" stream create foo8 \"time log\" stream create foo9 \"time log\" stream create foo10 \"time log\" stream create foo11 \"time log\" stream create foo12 \"time log\" stream create foo13 \"time log\" stream create foo14 \"time log\" stream create foo15 \"time log\" stream create foo16 \"time log\" stream create foo17 \"time log\" stream create foo18 \"time log\" stream create foo19 \"time log\" stream create foo20 \"time log\" stream create foo21 \"time log\" stream create foo22 \"time log\" 2) Go to Streams tab in admin-ui to get a blank page and the following exception in admin logs. ERROR -2 - Caught exception while handling a request Not all instances were looked at. This Hadoop scenario will not work in Windows. The scope is to the test for windows build. testWrite FAILED Caused by: Caused by: testSimple FAILED Caused by: Caused by: Java HotSpot(TM) Client VM warning: ignoring option support was removed in 3 tests completed, 2 failed FAILED FAILURE: Build failed with an exception.. As a developer, I'd like to isolate the Hadoop tests in a different project so that the DIRT project doesn't have to depend upon, thus eliminating the incorrect CP file generation in eclipse.. Import projects in STS Verify that tests run successfully. The build failed on two classes from and with error: FAILURE: Build failed with an exception. *. Document minimum memory requirement for Gradle builds. As a developer, I'd like to upgrade to Reactor RC1 release so that we can synchronize with stable dependencies.. As a performance tester, I'd like to investigate why there's high CPU startup time for both admin and container servers. Perhaps profiling would assist isolating the bottlenecks. Document reasons * List pros cons. The Step Execution Process ( page should list more lines of text for 'Exit Description' field to make sense of error messages. Investigate how much information can be collected directly from the It may be dependent on the error types. Let's have the observation documented to decide next steps.. Add support to stop existing Sqoop jobs. Acceptance test for Kafka as a message bus. Incorrect \"directory\" option described in hdfs-dataset docs. As a build manager, I'd like to setup CI infrastructure so that I can run integration tests in Windows OS automatically as we commit-trigger new builds. Gain access to powershell Kick-off CI task. Spike: Study elastic instances and scheduling in Bamboo to create Windows CI infrastructure. EC2 CI build improvements. As a developer, I'd like to include the following improvements as part of the EC2 CI so that we can reliably run the CI builds and also assert over feature Turn on * Enable 'distributed jvm test'. Add regression test. As a developer, I'd like to setup a performance testing infrastructure (rackspace), so I can start benching Kafka baselines and continue with XD use-cases.. Re-run Kafka baseline tests in new infrastructure. As a user, I'd like to have API and Documentation links in the section within It would be ideal to have the version dynamically replaced for every release.. Add batching support for Rabbit Message Bus. As a user, I'd like to have a processor module so that I can ingest data using XD source modules and process them as time-window operations. http reactor-stream This would give you 10 second time window of the min and avg values. Reactor as a module Integration with Spark streaming and reactor. Research reactor-stream integration options. As a PM, I'd like to have test coverage for both Kafka source and sink modules so that we can assert its functionality as part of the CI builds.. Add test coverage for Kafka source and sink modules. XD Mac OSX - Deployed a simple batch job in 'singlenode' - Laptop put to sleep mode - After login: notice that ZK is establishing connection - Continues to clean-up prior to redeployment, but never goes through successfully - Listing job both in UI and Shell states it is \"undeployed\" - System is running in Single Node - Laptop goes to sleep - After waking up your laptop from sleep, you cannot retrieve the list of deployed jobs anymore (in AdminUI) Only getting back a - \"Batch Job with the name abcd doesn't exist\". Placeholder to update to Apache on CI machines. I guess we just bumped the dependency; check for relevant other dependencies. Add support for PHD (XD M1 Release). Add support to install custom module archive. As a user, I'd like to use Kafka source through simple consumer API (as opposed to high-level) so that I can gain full control to offsets and partition assignment : - Study simple consumer API functionality - Document findings, approach and next steps. Research refactoring effort for Kafka source to use simple consumer instead of high-level API. Identify options * Document. Placeholder for and release testing effort. Review POC and identify scope for gpload as OOTB Batch Job. Document specs in regards to gpload as OOTB batch job * Initial thoughts around HAWQ GPDB sink. As a user, I'd like to mass ingest data from databases (and others) into so that I don't have to write custom code and as well as be able to ingest in an efficient way.. As a user, I'd like to stream ingest audio and video data so that I can apply predictive analytics algorithms for facial detection. Design specs on Motion-JPEG format , although having OOTB support, it is not platform compatible.. Add-ons for Rabbit as a Message Bus. Vary producer size. Vary consumer size. Vary prefecth size. Vary message size. As to prepare for release, we would like to upgrade to Spring Integration (RC) so that we can leverage the new features, enhancement and bug fixes.. As to prepare for release, we would like to upgrade to Spring Boot (RC1) (depends on Spring so that we can leverage the new features, enhancement and bug fixes.. Vary producers size (ECB-5). Vary consumers size (ECB-4). Infrastructure for RabbitMQ Cluster (ECB). Document user-defined permission to role mapping. Document Admin and Viewer Roles.. Document Admin and Viewer roles. Infrastructure for RabbitMQ Cluster (DB). Using the , find out the transfer rate in MB sec between three machines in a four machine configuration.. Fix the configuration problem with Filter and Transform modules. As a user, I'd like to have the ability to configure ACLs so that I can restrict access to resources accessed via Admin UI. Who can destroy the streams? * Who can view the streams? ??(defaults to all)??. As a user, I'd like to have the ability to configure ACLs so that I can restrict access to resources accessed via DSL Shell. Who can destroy the streams? * Who can view the streams? ??(defaults to all)??. Upgrade to Spring. As a user, I'd like to have Spring 'Core' upgraded to ( milestone ) so that I can benefit from performance improvements associated with 'compiled' SpEL and other enhancements.. As a user, I'd like to have a R processor, so I can efficiently perform data computations and statistical analysis in the context of streaming pipeline. Investigate the right approach that fits Spring XD model.. Make sure Spring XD's PDF reference doc has right release revision references. The scope is to make sure that a new PDF is generated (both for and M1 releases) and or revision references are correctly rendered.. Build on top of wrt the partition header to use (see. Add option to set. Add Hadoop (hadoop25) Test PHD with phd21 * Document that both PHD and PHD is supported with phd21. Add support for Pivotal HD (XD Release). Support for Mesos based deployment. As a user, I'd like to have a REST API to point and push an archive that includes custom module definitions and configurations so that I don't have to manually move and set it up. Socialize with the team to collect feedback Create new stories. As a user, I'd like to have the option to explicitly \"error channel\" so that I can stage and route the through the dedicated channel and continue ingestion. failure at either source, processor, or sink module Example Configuration: error channel definition similar to Exception\". As a user, I'd like to have the option of Cassandra sink, so I can leverage the NoSQL database to write high volumes of variable data segments in high velocity.. I should be able to upload Cassandra sink via the command from Creating streams using Cassandra as the sink is successful. As a user, I'd like to have the option of JMX source module so that I can to JMX notifications.. As a user, I'd like to have the option to write into File Roll sink so that I can store events on the local file system.. Research integration options for Sqoop 'tasklet'. As a user, I'd like to have the ability to mass-ingest data from various database systems so that I'm not restricted with the current approach that is dependent on JDBC drivers. Collaborate to determine the design * Document outcome (design specs). Two roles such as Admin or Viewer will be included Viewer to include just the GET access. Granular access to individual entity (REST API) * Shell UI Permission and integration. As a user, I'd like to have the option to configure default access control for endpoints so that I can grant access by Admin or Viewer roles.. Add support to configure Admin and Viewer Roles. The scope of this story is all the defaults. Configuring granular access control and privileges will be targeted in another JIRA.. Secure all endpoints using file based security configurations. As a user, I'd like to have the option to provide file based security configurations so that I can access the endpoints in a secured manner. Ideally, all the listed ( needs to be encapsulated within file based security layer. Reference:. DSL shell and Admin UI. Support accessing admin server endpoints over HTTPS. As a user, I'd like to have the option to enable HTTPS so that I can access XD's Admin server over secured communication.. Create a shell command processor and sink. As a user, I'd like to have the option to write into Kafka sink so that I can publish mass data into Kafka broker.. \"runtime modules\" - stream or job displays stream job name along with deployed modules and the status of the same. \"runtime containers\" What parameters you add to the stream job definition and what would be the output? JSON response should aggregate based on given stream job name along with the status. add. List Streams Jobs based with deployed modules. Provide template to create custom modules as Sprint Boot archive (example:. Custom module packaging strategy. As a user, I'd like to have guidance to create custom modules so that I can align the development practices with recommended approach. 11 20: Update: Scope of this task is to create an example to demonstrate and document the capability.. Process for creating and deploying custom XD modules. As a developer, I'd like to have the option of extending the Trigger abstraction so that I can implement my own trigger.. Research how to extend 'Trigger' interface to implement custom triggers. Spike: Research how to leverage ZK's ACLs. As an Ops, I'd like to setup security for the ZK nodes, so I could restrict access to zNodes to the right users apps.. Document design specs * POC. Design Spike: Investigate best approach to encrypt data pipeline. Consider all moving parts within the topology including the scenarios where data is at rest and as well as in transit.. Research how to handle data encryption within pipeline. Investigate setting up performance test environment on cloud providers. As an user, I'd like to have the ability to ingest data into Redis sink.. As an user, I'd like to have a native JDBC source module to ingest data directly from various databases.. Add ElasticSearch sink. As a user, I should be able to leverage native sink so that I can aggregate, search and analyze data insights in real-time.. As an user, I'd like to have OOTB sink modules to integrate with various data sources to egest data using Spring XD. Note: The OOTB support, however, is limited to currently available Spring Integration adapters. Acceptance Criteria: - User should be able to list the 'new sink' through DSL commands - User should be able to optionally choose the \"new sink\" adapters for stream creation using XD shell - User should see appropriate error messages if the required attributes are missing while creating a stream with the 'new sink' module - After successful stream creation with the 'new sink' module, the definition should be included in stream listing - REST endpoints should include 'new sink' definitions - Data ingested into 'new sink' should be validated for accurateness - Appropriate message needs logged if there's any problem ingesting data into 'new sink' module. As an user, I'd like to have OOTB source modules to integrate with various data sources to ingest data using Spring XD. Note: The OOTB support, however, is limited to currently available Spring Integration adapters. Acceptance Criteria: - User should be able to list the 'new source' through DSL commands - User should be able to optionally choose the \"new source\" adapters for stream creation using XD shell - User should see appropriate error messages if the required attributes are missing while creating a stream with the 'new source' module - After successful stream creation with the 'new source' module, the definition should be included in stream listing - REST endpoints should include 'new source' definitions - Data ingested using the 'new source' should be validated for accurateness - Appropriate message needs logged if there's any problem ingesting data using 'new source' module. Add SFTP source. As a user, I'd like to have the option to use the SFTP source module so that I can access, transfer, and mange files over any reliable data streams. Need to consider the infrastructure for testing.. As a user, I'd like to have paging support so that I can scroll through the list of streams, jobs and containers. Currently the following error is thrown when we cross 20 rows: JSON Response: Stack trace:. Add paging support for UI list views. As a developer, I'd like to have an OOTB MVC-aware HTTP module (with embedded tomcat), so I can use this module to leverage spring-mvc and features, instead of rewriting them within the existing HTTP source module. Adds full header mapping in the source (see comments) * See SO request:. Add MVC-aware HTTP source module. Research how to secure Admin's REST endpoints. As a user, I'd like to have the option to provide security configurations so that I can access REST endpoints in a secured manner. Ideally, all the listed endpoints needs to be wrapped within a security layer. Design considerations and approach for XD How users will be configuring security credentials? How Admin UI will be handled?. Acceptance Criteria: - Users should be able to gain access using - Both are mandatory - Invalid user credentials should be displayed as error messages and the user will not be able to gain access. Stream-lib - analytics operators. ELK - log analysis. Secure Admin UI to challenge users to enter username and password to gain access.. Stream partitioning metadata should allow updating at runtime - dynamically anytime. Possibly have an error channel at the stream level * The payload of the message will be the message that failed. DLE naming configs * Routing key options. As a user, I'd like to be notified when a exception is thrown in a module so that I can tap into an error channel to receive the failures for each stream module.. As a user, I'd like to have the option to delete the queues topics so that we can include an optional attribute as part of the stream destroy command to also clean-up the associated queues topics. Consider the possibility of producers and or queues still containing data * Consider the scenario even after the topics queues are cleaned-up, what to do with fanout exchange?. Consider removing the Topic Queues when deleting the Stream. ", "contenttype": "application/json", "created": 737603, "id": 4, "language": "en", "user_name": "sabby", "email": "sanandan@pivotal.io"}]}