{"contentItems": [{"content": "DB: Change Columns from NTEXT to NVARCHAR(MAX). We've made some customizations for a client which we think would be a good fit for inclusion in the core. There's a \"Lock Site\" action added to the control bar, which allows a super-user to turn off modifications to the site (probably for entering some sort of maintenance mode). For our client, the \"good enough\" way this is implemented is to disable the module actions whenever the site is locked (in addition, custom modules are able to access the locked status via a property on and do any additional changes, if desired). Testing Notes: - Test exposed on off button in the control panel - When on, verify that it disables module actions (for any user). BLOCKED - Workflow: Lost Publish button again.. HTML Module - Workflow & Module Settings Bug (Seen in Upgrades). I a bit doubt if this issue could be reproduced directly. There are a bunch of activities I already done, such as: - Load and install Inspire skins - Apply this skin to Host Host Settings - Change it back to default - Apply this skin to Admin Site Settings - See error - Change it back to default. However, when I click out Host File Management page, it shows red in the page, and same in log file. But once refreshed and re-loaded, it back to normal. Log this issue and I'd like to ask developers to do some investigation based on the error below. Get latest build of Platform 8 Setup for FQDN install w remote database Set the install to use German, Xcillion template and a prefix on the database Set the browser to use German as its base language Run the installer Error in the UI: Failure 54% minute 54% beim Parsen der reference not set to an instance of an object. at portalId, String templatePath, String templateFile, Int32 mergeTabs, Boolean isNewPortal, at portalId, String portalName, UserInfo adminUser, String description, String keyWords, template, String homeDirectory, String portalAlias, String serverPath, String childPath, Boolean isChildPortal, String& message) Log file: - Object reference not set to an instance of an object. at portalId, String templatePath, String templateFile, Int32 mergeTabs, Boolean isNewPortal, at portalId, String portalName, UserInfo adminUser, String description, String keyWords, template, String homeDirectory, String portalAlias, String serverPath, String childPath, Boolean isChildPortal, String& message) Installation completes and the site loads in German language You are logged in as user Remove Xcillion template completely. Remove Xcillion Template. +Go to Host Extensions, or Admin Languages Default Container Default Theme Evoq products: Basic, Content, Engage Evoq Library (Not part of this Jira for testing) * Sharepoint Viewer (Not part of this Jira for testing). Client Resources Version not updated when upgrading packages. We need to abstract the current oAuth work and make it a true DNN extension. This should be a Library project and it should NOT be installed by default. As a result, this also means we need to remove the host setting that it.. Noticed this with build 528, local install, with IE10. (Please also check if it is to do anything with the new editor) Pre-condition: Inline edit is enabled. - Log in as host, edit a page - Add a new HTML module on the page, on the left-top side of the module, click on a \"pencil\" icon to bring up the inline editing menu bar - Input any chars in the content area - Click on Save icon button. Result: The content won't be saved.. Noticed with IE10 with platform build 528, local install. - Log in as Host, edit any page In edit mode, there should be couple module editing and setting icon buttons on the right-top side of the module box. But all showing \"black-color square\" in IE 10. UI UX: Bottom control became invisible if CKEditor dialog window longer then Content Edit window. Step to Reproduce: Login as Host Create a New page Deploy the Banner Module on the Page Expected: It should deploy correctly and without showing error. Actual: Banner Module throw exception after deploy on new page. Remove Getting Started. All versions need to be set to. The default skin needs to be packaged like a normal extension (and not just reside in We need to update our process so that it creates an installable zip that goes into Install Skins.. New default skin Xcillion. The core has the ability to ute code on all version upgrades in addition to the version specific upgrades. This enhancement will provide the option for IUpgradable on modules to ute code on a new Install and or any upgrade, by adding the \"Install\" and \"Upgrade\". \"Install\" - will ute on any new Install \"Upgrade\" will ute on any all upgrades regardless of whether the current version and the new version are different. As the \"Upgrade\" pseudo-version code will ute on any all upgrades it must be re-entrant. - This impacts any extension installed (not the actual of the platform itself) would want to try installing a module (one that is new, also try an upgrade scenario) to make sure things install without problems (this is the regression aspect, not the actual issue) - Typical users won't notice anything, the change was in the manifest file for developers as well as the installer of the platform (to read the manifest) allows you to specify which business logic to run on install and or upgrade (for the module) - Install the DCC admin module. I noticed this twice so far, but not able to figure out the repro steps yet, most likely it only happens once when first time load up admin File Management. Environment: this is a local clean install of platform. Result: You will see some error on the UI and logs as below: * Refresh the page, you won't be able to see the exception in log, neither the error on UI. h2. Card The What's New module is used to display the change log for DNN releases. The core platform no longer maintains the change long in the What's New module and uses the Getting Started feature instead. The What's New module should be deleted. This module does not have it's own API or database structures so there is no backend to consider. h2. Confirmation In installed site (on the file system), there should be no more folder (this is for both new installs and upgrades). DAM: UNC folder provider - folder remains in DAM after it was deleted in the remote server. Screencast On the page search, Search for something (ex: Products) and hit enter to go to search results page Once you are in search results page with results for \"Products\", using the search bar in search results module search for something else (ex: Pages) Click on a search result for \"Pages\" to go to that page Now Press back button in your browser Should go back to search results for Pages: Goes back to the search results for Products: This needs to account for more than 1 page of results. Meaning, if there are 2 pages of results and the user clicks the next button to go to page 2 we need to add this as a new parameter to the URL and make sure the results view goes to the proper page when loaded. It also needs to apply any type filters that have been clicked added.. Extract Configuration manager into a separate module. Extract Dashboard into a separate module. Extract Console into a separate module. h2. Card The Vendors Module is used for managing vendors and banners within DNN. The vendors and banners modules, APIs and database structures should be removed from the core platform and extracted into a standalone solution consisting of the Vendors module and a Banners module. The Banners module will have a dependency on the Vendors module. The vendors module should create a page on the Admin menu when installed. h2. Conversation This initial conversion effort is only focused on conversion to a module and shall not include conversion to a MVC or SPA module. This module will move to a separate GitHub project in the organization. We can drop stored procedures, but should not remove the tables in the core platform. Install of this module should check to ensure the table is not dropped. h2. Confirmation This module will no longer be installed in new installs and this will also be removed from the Admin and Host menus in upgrade scenarios. This means completion of this task should remove the extension and any pages it automatically created. As part of this, the resulting module should also live in a new github repository here: Note: This is a BREAKING CHANGE. Step to reproduce: -Login as Host -Create a child site -create a new page -click on edit content to add content to new page Expected: User should able to enter the content through html editor. Actual: HTML editor is not working after click on edit content. Please refer to screenshot in attachment. SI: URL Encode Decode issue in. A query string which has an encoded equals sign will be truncated. Example: The section \"%3Dequals\" may or may not get removed from the actual address bar, but the application trying to access it will not get it. Steps to reproduce: 1. Create a new page. 2. Add a Razor Host module to the page. 3. Add the following script content to it: Razor reading query string 4. Test using a query string like 5. Test using a query string like Actual result: both will return \"test\" Expected result: the second one would display \"test equals\" Original Example (provided by community): Encoding the value using and passing the value as query string to another page returns \" on decoding. Steps to reproduce Pass the value as query string to second page. Decode the returned value using * The result is \", \" \" text is missing.. In Platform 8 (and also partially backported to support was added to enable incremental upgrades in a single version for files. This task is to enhance incremental upgrades so incremental cleanup files are also supported. The only way to test this is to have multiple cleanup files for a single version and they would be declared in the manifest (dnn file). If you have 2 dummy text files in a module, let's say and that are installed as part of a module's version (revision 0) the way you would test this is build a new revision of the module (so revision 1) that says delete and or as part of cleanup (this is in the manifest dnn file). If properly declared in the manifest upgrading the existing module to revision 1 should delete those files from the module's folder.. SI: Soft Deleted Modules Show When Adding Existing Modules In Other Portals. EVOQCONTENT - \"Resource cannot be found\" error when trying to Register as a new User and Cancelling. BLOCKED: DB Performance Improvements (Overall Improvements). Page Output caching provider is only available in Commercial products. Lack of this feature slows down sites based on Platform. DNN Corp. has decided to make this feature available to DNN Platform.. Provide Multi-language Support for Adding Editing Content Fields. Regular users shouldn't be allowed to send mass messages to Security roles. This ability should only be limited to Administrators & Super Users. NOTE: Community Managers and Group Owners are handled via separate issues.. EVOQSOCIAL: Email Delivery Schedule options do not work in My Profile. EVOQSOCIAL: Avatars in Notifications not displaying user's display name in the Tool tip. Member Directory: Users cannot search by city or country even when visibility is set to All Users. Icon not reset in Admin - Page management. Upgrade: Fatal error when Log In after EE upgraded to. Upgrade: Cannot access site with Runtime Error during upgrade. Installation progress UI stopped at 29%. SI: Request Filter not uting. h2. Card The Site Log is used to log system activity. Since it was first introduced, newer and better logging options have been added to the platform. All site log APIs and associated database schema and SPROCs should be removed from the core platform and included in the SiteLog module. h2. Conversation As part of extracting this module, upgrade logic should be added to the platform to remove any scheduled tasks and stored procedures related to this feature. The sitelog module should also be removed from the appropriate extensions tables. The sitelog table will remain to avoid any potential data loss. The Site Log module should be moved to and registered in the Forge. h2. Confirmation There should be no site or host settings referencing SiteLog settings. SiteLog related settings should be deprecated in Portal and Host classes but can be completely removed in cases where the class only exists to support SiteLog. New installs and upgrades alike should not have this module (under extensions) or the Admin pages available post Also, as part of this the extracted module should live in a new github repository here: NOTE: This will introduce a known breaking change for anyone who might call the SiteLog APIs. It will also remove a feature that might be in use on some websites.. SI: Culture Neutral Page don't show up as a menu sub item when not in the site default language (en-US). Cloud - iUpgradable problem causes content in various modules to not work. The default website template in both the Content and Enterprise packages are using the identical template (different sources) which includes the xml node for 2 pages in the template (the home page and the Our Products page). This, however, is not being picked up by the site creation as part of the import process. The end result is we ended up w multiple module instances and a layout that is stacked (instead of side by side within Content Layout). EVOQSOCIAL - UX enhancements. EVOQSOCIAL: Error in logfile: A potentially dangerous value was detected from the client. This module should be moved to a separate github repo in the organization. This will impact both installs and upgrades. It also means that the newsletter module page under admin will be removed in both scenarios.. EVOQSOCIAL: Get search modules is called needlessly multiple times. Page Creation renders a .JS error. EVOQSOCIAL: Duplicated area of search results. This is how the upload file currently looks (for example, when uploading a new profile picture): The user has to click on the text \"Click to Browse\" to bring up the file LIBRARY mockup as well). EVOQSOCIAL: Update DAM Upload Dialog Styling. EVOQSOCIAL: Forcing a password reset still makes the user go to their email and click on the link. Subscription sub description is not localized. - Add Events in Platform (for Mechanics). This is about adding events to the Platform so that listeners can know when multiple items occur so we can then hook into mechanics and log activity when this happens (similar to what we do w Users today and portals). We need to ensure there are additional events for the following (most are for Content): - Relationship Formed (added a someone) - Relationship Dissolved (removed a friend stopped following) - Folder Created (DAM Should have this today) - Folder Deleted (DAM Should have this today) - Folder Updated (DAM Should have this today) - File Created (DAM Should have this today) - File Deleted (DAM Should have this today) - File Updated (DAM Should have this today) - Page Tab Created - Page Tab Deleted - Page Tab Updated - Module Created - Module Deleted - Module Updated. SI: Relationship Scoring Actions. Currently, the Sproc gets the list of task from the user notifications. To know if a notification should be shown as a task, this Sproc has the following logic: - If the notification type has no ModuleId, it should not be shown had to add a list of exceptions to this (white list), in order to resolve SOCIAL-3227 - An additional black list filter is performed to exclude some notification types This same mechanism should be extended to use in Content's persona bar sproc), so the white black list of types is not the best option. The enhancement proposal is to add a flag to the table, to specify if the notification should be displayed in the task list: - The logic in SPROC will be simplified - The default value should be false (each notification type needs to be updated in Content Social to set this to true; taking into consideration upgrades vs. new installations) - This column, IsTask, should be created via the Platform as a bit column and have all values set to 0 (false) then add a constraint for NOT NULL. - The API that exists today (for creating notification types) should create an overload method passing a default value of 0 (and also mark existing method as obsolete; only required if the method today is parameterized) Note: The solution here must work for both Content & Social.. EVOQSOCIAL - Persona Bar Tasks Add IsTask flag to. Profanity breaks Idea creation in Social. I was trying to create an Idea in social cloud, but right after Vince update the Profanity words and turned it on, suddenly the new creation of idea all failed. Error message like: parsing - Nested quantifier *. Attached with Profanity Words Vince used.. IE stopped working if type Enter key in Journal. EVOQSOCIAL - SI: Member Directory group mode bug. Notifications Stream doesn't resize images. SI: DAM URL Upload Error. SI: Taxonomy control clears selection on postback. SI: Group Module does not show Groups for. Messaging: Dismiss All for Notifications. Again it is related to IE11. Not happen in and fine with FF & Chrome Steps: - log in as host - goto Admin Taxonomy - Click \"Create New Vocabulary\", input anything required. - Click \"Create Vocabulary\" Result: with PE & EE, the creation pop-up window keeps loading, looks like never complete, the window won't be closed. - Close the pop-up window by clicking \"X\" button Actually the new vocabulary is created.. Admin LIsts - In Chrome 404's are thrown on jQuery load. Ingore words fails if word is mixed case. Journal should convert urls to hyperlinks. add code to the installer to verify the new minimum prerequisites. I was under the impression that we already had this code - so we need to verify if it is there, and if so working - and if it's not there, add it. Verify: - SQL 2008 - .NET (Verify exact version) - IIS?. EVOQSOCIAL: User Search - Include Email and Username while Indexing. SI: Custom Profile Field Validation option broken when using Date Regx. SI: Extend SearchDocument class with DocumentIcon. SI: Display Name should be updated accordingly when user profile changed. Pre-Condition: - Go to Site Settings User Account Settings and define a display name format as - Create a New User by using this new setting Steps: - Log in as Host, goto User Manage Users - Click a Pencil icon button to edit the new created user account - Click Manage Profile tab - Change First Name and Last Name, and update it - Go back to Manage Account tab Result: FirstName & LastName in Manage Account Tab are updated, but display name didn't get updated accordingly. Expected: It shall trigger to update the Display Name as well.. Scheduler throws error from. There was a change in behavior between and that has resulted in cache files being included in the template when 'include files' is checked. The files included are the .resources ones in the cache folder and I am attaching templates generated in Social in and to verify an example. (Open these w a text editor, search for .resources, you will find them only in Expected: No cache .resources files exported as part of template. To reproduce: - As host, go to Host - Site Management and click \"Export Site\" - Add a name and description for the template (pick a site) - Scroll down and in the advanced area check \"Include Files\", leaving rest default - View exported site template with text editor, search for .resources. SI: Globally Disable Private messaging. Iconbar files are still included with DNN but it is not provided as ControlPanel option in Host Settings. Remove files from distribution (including resource file, please).. Under Admin - Site Settings and within the Advanced Settings tab, there is a Messaging section. In here, administrators can control the maximum recipient count for any peer to peer messaging (to avoid spamming). This limitiation, however, should not apply to notifications (which Subscriptions in now depend on). Notifications should be unlimited here, but as of this was not the case. To reproduce it you need something with at least 6 subscribers (use Answers in Social subscribe module wide with 6 users then try to ask a question w a 7th user). This was reported by a customer in Social and we were able to resolve it by increasing the limit set here (it also impacted all other Social modules w subscriptions and will impact platform in. Notifications: Notifications shouldn't go across Portal Profanity Filter. Steps to reproduce: 1) Create a blog post 2) try to comment on that blog post with a comment longer than 2000 words. Actual Result: There is no setting to set the word count for comments, and currently comments will be truncated at 2000 words, despite being able to type over 2000 words in the comment text box. Expected Result: There should be an option to post unlimited word comments Regression Notes: Changes here have the potential to impact Likes on comments (only). Therefore, Likes on commenting need to be regressed (the Activity Stream should suffice). Although Activity Stream should suffice for verification, we should also verify Journal (likes and commenting).. Update Site Template to Use Copies of Console Modules on user Profile Pages. The Console module should use a copy on all pages (except the main Activity Stream one) so it is easier to change settings across multiple instances. Note: We will not handle upgrade scenarios for this because it is too invasive. Testing Notes: - Login as an admin or super user. - Go to your profile page (the one w the Activity Stream journal on it) - Edit the module settings for the console module, change it to show small icons - Go to any other page shown there (friends, messages, my profile) and verify it shows the icon on all those pages. ", "contenttype": "application/json", "created": 737358, "id": 24, "language": "en", "user_name": "thecrispy1", "email": "-"}]}