{"contentItems": [{"content": "A comment with security level 'Developers' was removed.. SI: Secret Question, Answer not visible in login control. Exporting Site Fails in Platform. CK Editor breaks after upgrade. Tested on clients and local website. Steps to reproduce: Add CkEditor from Codeplex to website upgrade to go to Edit text html module Actual result: Errors are thrown and CkEditor is broken.. If Codeplex CkEditor is in place and you upgrade to Platform HTML Editor breaks. Steps to replicate: 1. Log in as Host to Platform 2. Add this code to Page Header of a page: body Body and Re-index the search 4. Run a search for that page Actual Result: Code is showing up in Search Results Expected Result: Code shouldn't be in Search Results Side Note: Re-indexed with URL Crawler turned OFF and it DID NOT resolve the issue. Issue can be seen here:. If there are too many cookies on the site, you cannot go into Edit Mode using ControlBar. Looks like cookie gets created when you go to different DNN pages. For ex: go to Admin Site Settings under Basic Settings click on Site Details(to hide show that section) and click on Apperance(to hide show that section) Two cookies will be created under and These cookies are created to restore the page layout next time user comes to that page. But if you browse through other DNN pages, a lot of these cookies are created and when you click on go to Edit Mode, it throws the login window and refresh the page and never goes into Edit Mode. All necessary steps in this WIKI has been taken so it does not happen but it still does not go into edit mode. The workaround is to Delete all the cookies.. Searching by Tag does not show results in SearchResult module rather in ContentList. Steps to reproduce: 1. Log in as host in 2. Create taxonomy tags and add them to couple pages 3. Search by Tags, for ex: Actual Result: Results will be shown in ContentList module on Results page. SearchResults module will not show anything. Expected Result: ContentList module should not be needed. SearchResults module should be able to show results when searched using Tag.. Adding redirect to Profile, Messages or Friends page throws two exceptions Steps to reproduce: 1. Log in as a Host to DNN 2. Create 3 pages 3. For each page, add Redirect(a page on your site) to My Profile, Friends and Messaging pages 4. Click on these newly created pages Actual Result: Everytime you click on a page, the redirect works but two exceptions are thrown: PortalID: 0 PortalName: My Website UserID: 1 UserName: host ActiveTabID: 64 ActiveTabName: Friends RawURL: AbsoluteURL: UserAgent: (Windows NT WOW64) (KHTML, like Gecko) DotNetNuke ExceptionGUID: Thread was being aborted. FileName: 0 0 Method: StackTrace: Message: Thread was being aborted. stateInfo) e) at e) control, Int32 index) at content) module) Source: Server Name: DNN-PC30 PortalID: 0 PortalName: My Website UserID: 1 UserName: host ActiveTabID: 64 ActiveTabName: Friends RawURL: AbsoluteURL: UserAgent: (Windows NT WOW64) (KHTML, like Gecko) DotNetNuke ExceptionGUID: Unhandled Error Adding Module to leftPane FileName: 0 0 Method: StackTrace: Message: Unhandled Error Adding Module to leftPane Thread was being aborted. stateInfo) e) at e) control, Int32 index) at content) module) End of inner exception stack trace at module) at pane, ModuleInfo module) Source: Server Name: DNN-PC30 Expected Result: No Exceptions should be thrown. SI: Blocking or Allowing for network in Login Filters does not work. Allowing or Blocking for network in Login Filters does not work. I was still able to login after blocking the network. Steps to reproduce: 1. Install and login as host to DNN 2. Set up Login Filters: 3. Block network IP Actual Result: You can still login Expected Result: You should NOT be able to login. If SSL is Enabled on the website, all links are created as Absolute. Steps to reproduce: 1. Log in as Host to 2. Use same settings as mine for HTML Editor Manager(see attachment) 3. Go to HTML Pro module, add a link, click on Save the domain will strip out and link will be Relative 4. Go to Site Settings and turn ON SSL 5 Go back to same HTML Pro module add a link click Save Actual Result: Domain is still there and link is always Absolute Expected Result: Link should be Relative as it was working without SSL. Search does not work after deleting SearchResults page and adding Results module to new page if you have another language on your website. Steps to reproduce: 1. Install DNN log in as HOST 2. Delete Search Results page Delete it from Recycle Bin as well 3. Add new language(do not localize content), Italian 4. Make Italian system language, uncheck English 5. Create new page, Add SearchResults module 6. Search for content Actual Result: Two simultaneous exceptions are thrown in Event Viewer. Search does not work. PortalID: 0 PortalName: My Website UserID: 1 UserName: host ActiveTabID: 98 ActiveTabName: SearchResults RawURL: AbsoluteURL: UserAgent: (Windows NT WOW64) (KHTML, like Gecko) DotNetNuke ExceptionGUID: Object reference not set to an instance of an object. FileName: 0 0 Method: StackTrace: Message: Object reference not set to an instance of an object. at search, String culture, Int32 pageIndex, Int32 pageSize, Int32 sortOption) at , Object , Object ) at instance, Object at instance, Object arguments) at func, Source: Server Name: DNN-PC30 Expected Result: Search should work even if default Result page is deleted.. Add An Existing Module hierarchy Not Working if the parent page is disabled or redirected. If the parent page is disabled or redirected, the child pages do not show. 1. Install Evoq Suite 2. log in as a host add couple a disabled page(so it's not clickable) or a page with redirect to another page. Add child pages to both pages you just created. 3. Upgrade site to Evoq Suite 4. Go to any page, click on Add Existing Module from ControlBar Child pages of disabled or redirected pages are not showing in hierarchy. All pages should show in hierarchy.. Steps to reproduce: a site with content from Community DNN site. Ensure that file types like docx are included in the files, and make sure the site settings do not allow docx files. a new site the template that you exported Result: DNN displays an error that docx files cannot be upload. If you go into site management, the site you attempted to create will show up. Click on edit by the site, and it will throw an additional error, and you will not even be able to access the site. WorkAround: Allow document types which are being denied, and the portal will be created.. ", "contenttype": "application/json", "created": 737358, "id": 18, "language": "en", "user_name": "tony.sandhu", "email": "-"}]}