{"contentItems": [{"content": "Blackberry: Implement value property. Blackberry: Implement method on objects to take a list of json properties as is done at create time.. This activity should be done at the \"feature complete\" stage of the project. BlackBerry: Finish size and position methods properties on R6 UI View. BlackBerry: Implement getZIndex on R6 UI View. BlackBerry: Implement getWidth, getHeight in R6 UI View. BlackBerry: Implement setLayout getLayout on R6 UI View. Blackberry: adjust UI controls based on R8. This umbrella task is to address functional delta in controls that were previously implemented using R4 release of Cascades. It could either mean implementing new functionality now available in R6, or redoing something that no longer works or was implemented as a workaround. Refer to the implementation matrix to see what elements need to be implemented. Blackberry: Implement startLayout, finishLayout, updateLayout methods. BlackBerry: Integrate Anvil unit test framework and get tests to run. BlackBerry: Support UI Controller property which value is another controller. BlackBerry: Complete Picker. Need to implement plain picker using BB drop down control. Use the implementation matrix to see what's remaining (these are things that are not implemented but supported in Cascades):. Use the implementation matrix to see what's remaining:. Use the implementation matrix to see what's remaining (these are things that are not implemented but supported in Cascades):. BlackBerry: Implement. BlackBerry: Implement the rest of Buffer. BlackBerry: Implement - Part 2. A note to myself: this task is a necessary step to be able to deploy an app to a device. This could be added to the script. This is an example of what the script should do:. BlackBerry: bring in the latest Appcelerator code into BB branch. Updating API doc is now part of the patch cycle. However, some components added in the past have not been reflected in API doc: - ImageView - TextField - (maybe, check it out) This task is to add past work to the API doc.. BlackBerry: Revisit after R6. for starting point BB push should be available after R6 release early in July.. BlackBerry: Implement BB push. BlackBerry: Implement BB Crosscut Menu. BlackBerry: Implement BB animations. Implement the rest based on TIMOB-8810 To be implemented: Properties color : String font : Font message : String messageid : String style : Number Methods getColor( ) getFont( ) getMessage( ) getMessageid( ) getStyle( ) setColor( String color ) setFont( Font font ) setMessage( String message ) setMessageid( String messageid ) setStyle( Number style ). Implement features available after Cascades R4 release.. Continue implementing new elements once Cascades R4 is integrated.. BlackBerry: Implement Blob. BlackBerry: Implement based on R4. BlackBerry: Implement - Part 1. BlackBerry: Implement. A TableView section object. Usually contains TableViewRows In iOS, this is an abstract non-iOS class used to group rows into sections. There is no native analog.. An individual row for a TableView. In iOS, to a degree, this is but is more the data than the view. For example, TableViewRow does not recycle while the cells do.. BlackBerry: Implement - Part 1. BlackBerry: Implement elements needed for KitchenSink. A tab instance for a TabGroup. A TabGroup tab instance. Each tab includes a button and one or more windows, which holds the \"contents\" of the tab. Users can select a tab by clicking on the tab button. In iOS, this actually is more of a combination of UITabBarItem and meant to go into a tab group. Android does not have a concept, so it depends on what Blackberry provides.. BlackBerry: Implement elements needed for KitchenSink. A specialized text field for entering search text. The SearchBar object is closely modeled on an iOS native search bar. As such, not all features are supported on other platforms. In iOS, a direct mapping of UISearchBar. A view that contains a horizontally and or region of content. In iOS, this is a UIScrollView with paging turned off.. A view that encapsulates a set of sub-views, navigable using its built-in horizontal swipe gestures. In iOS, this is a UIScrollView with paging turned on, combined with an optional UIPageControl. sz: and ScrollView coming later. sz: Toasts Dialogs are part of Cascades as of Sprint 1216 (and next Beta). In addition, notifications in the notifications window (ex. via Push) will be available in the next beta. Use the implementation matrix to see what can be implemented (look for elements supported in Cascades):. An alert dialog is a modal view that includes an optional title, a message and buttons, positioned in the middle of the display. In iOS:. sz: Dialogs and Toasts are available as of Cascades Sprint 1216 (R5, and available to us with R6). The 2D Matrix is an object for holding values for an affine transformation matrix. A 2D matrix is used to rotate, scale, translate, or skew the objects in a space. A 2D affine transformation can be represented by a 3 by 3 matrix: a b 0 c d 0 tx ty 1 The third column is constant (0,0,1). In iOS, this maps to but is rather primitive in 2D and 3D graphics. If using OpenGL, consider. Guide for QE developers to setup and test the Blackberry port of Titanium SDK using KitchenSink Should be placed on a separate page in this space:. BlackBerry: Get KitchenSink to work. App and AlertDialog might not be available in the platform until R6. Will have to do a temporary workaround for now.. BlackBerry: Implement Network module for Anvil. ", "contenttype": "application/json", "created": 737358, "id": 96, "language": "en", "user_name": "tpetrenko", "email": "tatyana@macadamian.com"}]}