{"contentItems": [{"content": "This is not a regression as it is reproducible with Titanium sdk When a new contact is added to the device, adding the date property along with it, following the format in the docs gives error. When the following is done: it cause the error mentioned in step 1 of the actual results, however adding the date property separately as follows: does not cause any error, however the contact does not get added to the device contacts. The birthday field works fine though it also follows the same format as the date. Steps to reproduce: 1. Run the attached 2. Open device contacts and check for Ade Crude Actual results: 1. The following error is shown: 2. No new contacts added Expected results: 1. Blank white screen appears 2. 'Ade Crude' is added to the contacts along with the anniversary dates and other details mentioned in. iOS: Volume of video player does not change when controlled by slider. Reopening to edit comment. Studio: Error displayed at the top of page only refreshes after re-opening it. When a new mobile app project is created (both alloy and classic) the VPC environment is not selected and hence the cloud service is not enabled displaying a red cross beside it at the Appcelerator Platform Service section in the However, there is no error message displayed at the top of the tiapp overview page until it is reopened(see attachment) Steps to reproduce: a sample mobile app project and observe the tiapp overview page 2. Close the and reopen it. 3. Select the VPC environment and save. 4. Close and reopen Actual Result: 1. The total no of error is not displayed at the top of the tiapp overview page and there is no red cross near the VPC environment. 2. '1 error detected' at the top of the tiapp overview page and the red cross beside the VPC environment appear. 3. Cloud service enabled but '1 error detected' at the top of the tiapp overview page and the red cross beside the VPC environment are still shown 4. No error message displayed Expected Result: '1 error detected' at the top of the tiapp overview page and the red cross beside the VPC environment appear in both step 1 and 2. 3. Cloud service is enabled and no error message should be displayed on the tiapp overview page. 4. No error message displayed.. When creating a new mobile app project, the VPC environment is not selected and the users are prompted to select one on the page when the project is created. This tool tip does not disappear when the window is changed. Look at attachment. Steps to reproduce: 1. Create a sample mobile app project with service enabled. 2. When the 'Please select the VPC environment' tool tip appears immediately switch to another chrome safari) and the mouse should not go over the page while switching to another window. 3. Go to the and remove the following line to disable performance service: 4. Switch to the tiapp overview page and click on the enable services button 5. Switch to another window safari chrome Actual Result: tip for selecting the VPC environment does not disappear. 3. Removes the performance services 4. Performance Service is enabled and 'Please choose a VPC environment name' tool tip appears 5. 'Please choose a VPC environment name' tool tip still shows up. Expected Result: tip for selecting the VPC environment should disappear. 3. Removes the performance services 4. Performance Service is enabled and 'Please choose a VPC environment name' tool tip appears 5. 'Please choose a VPC environment name' tool tip should disappear.. ", "contenttype": "application/json", "created": 737603, "id": 90, "language": "en", "user_name": "vchidambaram", "email": "vchidambaram@appcelerator.com"}]}