{"contentItems": [{"content": "If you launch the default Alloy app on Windows emulator, \" \" appears in the console. This is a from SDK Create a default Alloy project with Launch the Alloy project on a Windows emulator Wait for Alloy app to launch on the emulator. \" \" appears in the console: No errors should appear when launching the default Alloy app on Windows emulator.. When installing a fresh version of the kitchen sink from the stable branch on github, The first install on the phone crashes, if you change the SDK to the GA and run it works. if you change the Facebook module to the and run it works. After either of these it also works on SDK aswell Download a fresh install of the stable kitchen sink Change to 23 add Android config code below to the Run the application with the SDK and Facebook module The application crashes The application runs The application runs. iOS: Incremental builds fail to update with. iOS: cannot be used because it contains an alpha channel\" error is returned. To create: install appc run Remove SDK version from appc use The following error is returned: See TIMOB-19809 for the below issue: i'm getting the following error with a project that worked fine for but now fails when i try to build using master There are missing app icons You must either create the missing icons below or create an image named or in the root of your project If the image is present, the build will use it to generate all missing icons It is highly recommended that the be 1024x1024 Unable to create missing icons: - Used for iPad - required size: 29x29 - Used for iPhone, iPad - required size: 58x58 - Used for iPhone - required size: 87x87 - Used for iPad - required size: 40x40 - Used for iPhone, iPad - required size: 80x80 - Used for iPhone - required size: 120x120 - Used for iPhone - required size: 120x120 - Used for iPhone - required size: 180x180 - Used for iPad - required size: 76x76 - Used for iPad - required size: 152x152 An error occurred during build after 6s 685ms. If capabilities are enabled in iOS extension, then you will not be able to install the mobile app to device. If capabilities are enabled in iOS extension, then you will not be able to install the mobile app to device. This issue is also reproducible from Appc CLI. Create a Titanium App with Next, go into the project and create the Apple Watch App with Make sure the mobile app, watchkit app, and watchkit extension have the correct app ids: and Make sure you have development provisioning profiles for each app id with app group id enabled Make sure to app group capabilities is enabled in the watchkit extension target and watchkit app target Next, install the mobile app to an iOS device that is paired to a watch: Build will fail to install to device with the following error: Should be able to install a mobile app with watchkit extension.. Cannot build a Titanium app if the project is named \"iphone\". This is a from SDK and Create a Titanium project with Make sure to specify the project name as After project is created, run The following error will appear: Should be able to build a Titanium project if it's named iphone.. Xcode 7 - App crashes on launch if app is installed on an iOS device <. App crashes on launch if app is installed on an iOS device Create a new project from Appc CLI Install project to an iOS device < After app is installed onto device, try launching the app The app will crash on launch; see attachment for crash logs. The apps should not crash on launch.. If you do , a error message will appear. regression This issue will affect . not a blocker Steps to reproduce: Actual: error should not appear.. Content-Type header is malformed when making a POST request. This is as this occurs in 1. Create a Titanium app with the attachment and include attachment in the Resources folder 2. In on line 13, replace 5. In the app, press the button In terminal, the boundary parameter is not immediately after Content-Type The boundary parameter should be immediately after Content-Type. When variable is changed to another variable, Debugger crashes. h6. It's a regression since it works in GA h5. Steps to reproduce 1. Create a classic project 2. Copy following code in file 3. Place a breakpoint in line 15 ( var x \"foo\"; statement) 4. Debug in iOS device 5. Press the \"Shadowing\" button to trigger the breakpoint 6. In the Variables pane, change value of x to y (not string; variable) by in the Value column 7. Repeat the Step 6 again. h5. Actual Result. h5. Expected Result. When variable is changed to another object variable, It doesn't show its properties in debug variable view. Please see the attachment to see the variables view in Studio. h6. It's a regression since it works in GA h5. Steps to reproduce 1. Create a classic project 2. Copy following code in file 3. Place a breakpoint in line 15 ( var x \"foo\"; statement) 4. Debug in iOS device 5. Press the \"Shadowing\" button to trigger the breakpoint 6. In the Variables pane, change value of x to y (not string; variable) by in the Value column 7. Expand the x h5. Actual Result. h5. Expected Result. Windows: Build - Cannot build for Windows emulator or device from one Windows machine. Cannot build to Windows emulator or device from Windows OS This issue was only reproducible on particular QE Windows machine. The other QE Windows machine (not reproducing this issue) had the same setup except it was running Visual Studio Community 2013 Update 4. 0. Follow setup steps from \"Windows Preview Announcement\" email 1. Open cmd prompt 2. Create a project via CLI 3. Build to emulator device: 4. Input your publisher guid (if prompt is enabled) 5. If installing to emulator, select an emulator Build will fail for both emulator and device; see and attachments. Should be able to build to both Windows emulator and device.. iOS8: - is not supported\" message appears if you include Crittercism module. is not supported\" message appears if you include the Crittercism module in your app. Through process of elimination, I was able to determine that the Crittercism module was returning the message enabled each services (Aanalytics, ACS, SOASTA, Crittercism) one by one. 1. Create a default Titanium classic app with services enabled 2. Install app to an iOS 8 device or simulator 3. Once the app launches, press the home button to background the app 4. Then, bring the app back to the foreground The following message appears in console: The message should not appear for default apps.. CLI: Xcode 6-beta - Installing to iOS simulator will fail to build on first brand new launch of the simulator. Installing to iOS simulator will fail to build on first brand new launch of the simulator if you are using Xcode 6-betaX. However, if you reinstall the same app again to the (regardless of phone form factor), then app will install and launch without any issues. - This was reproducible from CLI. 1. Switch to Xcode 6-beta7 2. Create a Titanium or Alloy app 3. Install app to simulator or If this is the first time launching your simulator, app will fail to build (see attachment). Should be able to install app to simulators without any issues.. JS global object is undefined after calling 1. This does occur on iOS 2. This is not a regression with 1. Create a classic Titanium app 2. Download and unzip 3. Copy all contents in the Archive folder and paste them in the Resources directory from step 1 4. Next, install app to an Android device 5. After app is installed, press \"Start Automation\" button After test is complete, \"Cannot read property\" runtime error appears (see attachment). The bug is in on line 34. App should run without throwing a runtime error.. iOS: Debugger - Debugger does not work with iOS. h5. Details Debugging does not work on iOS simulators and iOS devices. h5. To reproduce 1. Create a default Titanium or Alloy project 2. Add a break point to the following places: In the default Alloy app, add break point in at line 2 In the default Titanium app, add this code and add a break point at the alert 3. Next, debug to either iOS simulator or iOS device h5. Actual result Debugging to iOS simulator: if you click on the 'I am Window 1' label, studio will not hit that break point. Debugging to iOS device: Debug on iOS device dialog will stall (see and not app will appear on device.. iOS: SDK should have under 10 compiler warnings (it currently has 159). SDK should have under 10 warnings for the EMC application. -We should have 0 compiler warnings. An SDK that produces even 1 compiler warning should never make it to -There are 64-Bit issues buried in these 159 warnings, so these issues need to be fixed before our SDK can be certified as 64-Bit -This is Apple's guide to making source code \"64-bit. iOS: Accessibility - does not work properly inside a ScrollView properly. does not work properly inside a ScrollView properly the device's VoiceOver will not read the label. This is not a regression. Issue also exist on SDK 1. Create a Titanium app with the following code: 2. Install app to device. Make sure VoiceOver is on: Settings General Accessibility VoiceOver On 3. Double-press on app to launch app 4. Double-press on the label \"Label on first Scrollview\" is not read out. \"Label on first Scrollview\" should be read out.. Steps to reproduce: 1. Run the following code on Android: Actual: A white view appears. Expected: A red view should fill the screen similarly to iOS. See attachments. TiStudio: Dashboard - \"API Docs\" does not take you to the API documentation site. Steps to reproduce: 1. Open TiStudio 2. In the dashboard, click on Actual: Link takes you to Expected: Link should take you to Note: Not a regression.. Steps to reproduce: 1. Launch Studio with internet connection disabled 2. Create a TiMobile project 3. Relaunch Studio with internet connection enabled 4. Check Actual: Two projects with the same guid are created in site. See attachments. Expected: One project should be created at site Bug not reproducible on Windows 7 machine * Bug not reproducible when working from home. Steps to reproduce: 1. Package default Titanium project for Mobile Web 2. project.. There is no way to filter the console log based on event type such as \"debug\", \"info\", \"error\", etc. Changing the Log Level has not affect. This is the same for both iOS and Android. Is there another way to filter the log based on the level of the event? Step 1: run the example app below Step 2: Open \"Run Step 3: Change \"Log Level\" Step 4: Test the log levels with the the app. h3. Associated Helpdesk Ticket. h5. Description: When launching Studio with CLI version the organisation is not recognised upon project creation, or in the bottom right hand of the Studio. However, the CLI is able to recognise organisations from the terminal. h5. Steps to reproduce: 1. Appc use 2. Launch Studio 3. Observe bottom right hand for organisation. 4. Create mobile app project 5. Observe Appcelerator Platform Services setup. h5. Result: \"Unknown Organisation\" using CLI h5. Expected Result: Studio should recognise organisations using CLI. In preprod with Node if you create a mobile app with services enabled, then the will say \"app is registered with an organization you are not part of\". If you are in preprod with Node and you create a mobile app with services enabled, then the will say \"app is registered with an organization you are not part If I create a mobile project from the CLI and import the project into Studio, I get the same bug behavior. not in production. Issue is Make sure your environment is pointing to preproduction Make sure you have Node installed Create a mobile project with services enabled Once mobile project is enabled, wait for to load \"app is registered with an organization you are not part of\" message appears in the see Should be able to create a mobile project from Studio without any issues.. A comment with security level 'Developers' was removed.. If you run \"npm ls -g appcelerator\", \"npm ERR! code 1\" is returned. regression This issue with Node Steps to reproduce: Actual: No error should be returned when you run .. If you have Node installed, you cannot log into Studio I've updated my Studio via Jenkins branch. Install Node and up. Make sure you have Node installed on your machine Make sure you update your Studio to Open Appc Studio and try to log in You will not be able to log into Studio; the log in button will become unresponsive. You should be able to log into Studio with Node. Reopening ticket. If I revert my Node version to and use Appcelerator Studio build then Studio will be stuck trying to install Node; see attachment.. Currently, if you try to update Appc CLI via Appc Studio and you had a bad install previously cancelling the previous update builds), then you will run into this issue: To improve the update process from Windows, Appc Studio should be able to detect file, delete the file, and update Appc CLI again. Remove the latest Appc CLI build from your machine Studio Appc Studio will fail to update; see attachment.. If you have LiveView enabled, then you cannot on iOS. To workaround this issue, turn off LiveView. Make sure you have a valid provisioning profile for iOS push Create a Titanium app with services enabled On make sure to setup iOS push Next, download, unzip, and copy contents of into Titanium Resources directory Enable LiveView Install app to device Once the app is launched, go to Click the button to push notification Device token is not retrieved is not registering the callback; go to and see line 76. Device token should be retrieved from ACS; see attachment.. -On Windows,- If you publish an Arrow app, the \"Unable to parse URL for publish\" appears. After you publish the Arrow app from Appc Studio, you can view the published URL with In Appc Studio, create an Arrow project Publish the Arrow app Wait for the AppcStudio to finish publishing Arrow \"Unable to parse URL for publish\" error will appear; see attachment. Should be able to publish an Arrow app from Appc Studio on both Windows and Mac.. If you publish an Arrow app, the \"Unable to parse URL for publish\" appears. Currently, if you click on the run button, there is no indication that the run button was clicked; see attachment. There should be an indication when the run button is selected.. Cannot update to the nightly builds from Appc Studio GA to use the Arrow integration. 1. Make sure you are pointing to the nightly stream: 2. Go to Help Check for Appcelerator Updates to get the nightly build Cannot update to the nightly build and the following error appears: Should be able to update to the nightly build from Appc Studio GA.. Nightly: Update - Cannot update to the nightly builds from Appc Studio GA to use the Arrow integration. A black border is appearing underneath the toolbar. This is a since the black border does not appear in GA AppcStudio on Yosemite see 1. Open AppcStudio 2. Check underneath the toolbar A black border appears underneath the toolbar; see A black border should not appear.. With Xcode if you create a project with SDK (selected in but latest SDK selected in CLI, then the incorrect iOS simulator version appears in the device drop down list. 1. Make sure your CLI has the latest SDK selected: 2. Make sure your CLI recognize Xcode 3. Next, create a Titanium project with target SDK 4. At the device drop down list, select any simulator Next to the simulator device name, appears; see attachment. The correct simulator OS should appear next to the simulator device name; see. iOS: Xcode6-beta6 - Cannot install to iOS device or launch simulator. This is a regression. Test Steps: 1. Uninstall Xcode move Xcode to a directory in which the CLI cannot pick up 2. Launch Studio with a new workspace 3. Wait untill Studio loads. Actual Result: NPE occurs.. Cannot package for Adhoc or iTunes store. Latest AppcStudio Beta build is passing \"production\" when packaging for Adhoc or iTunes Store However, AppcStudio GA is passing \" \"production\" when packaging for Adhoc or iTunes Store From CLI, use \"production\" instead of \"production\" 1. This is a regression from AppcStudio GA 2. This is not a blocker because of the workaround. this is a ticket because the workaround is not intuitive. 3. Using the latest AppcStudio build, you can still package an app for the store, , AppcStudio is passing \"production\" as well: 1. Create a default Classic or Alloy app 2. Package app for Adhoc or iTunes Store The following error appears in the console view: You should be able to package your app for Adhoc or iTunes Store without any workarounds.. If you use the above environment setup (specifically, SDK and latest CLI from then you will not be able to launch any iPad simulators. The workaround is to use \"ipad\" flag instead of \"universal\" in the iPad simulator build command: 1. Create a default app 2. Launch any iPad simulators from studio No iPad simulators will be launched. Only iPhone simulators will be launched. Below is the command that studio uses to launch iPad simulators: Studio should be to launch iPad simulators.. If you create a mobile project from the CLI and import the project into Studio, you will not be able to build the project unless you change the project nature to mobile; web is the only toolbar.. Studio does not recognize Xcode DP. 0. Download Xcode DP 1. Right-click in Project Explorer and go to New Mobile App Project 2. Pick either Alloy or Classic project and click next iPad and iPhone check boxes are not selected (see 3. Fill in the required fields and select both iPad and iPhone check boxes 4. Click next Studio will have a window that says iOS is not configured yet (see Studio should be able to recognize Xcode DP 1. If you pass the Platform Configuration screen, then you will be able to create the Titanium project. 2. I see this warning error in iOS Issues ! Xcode is too new and may or may not work with Titanium SDK The maximum supported Xcode version by Titanium SDK is Xcode. \"iPad\" appears in the iOS simulator configuration when running only to iPhone simulator. 1. Create default Titanium app 2. Select the app 3. Debug As OR Run As iOS Simulator iPhone 4. Once the simulator is launched, go to Debug As Debug Configurations or Run As Run Configurations \"iPad\" appears in the configuration (see attachment). \"iPad\" should not appear in the simulator configuration if running to iPhone simulator.. iOS: Xcode - Nightly Studio build cannot build app for iOS simulator, device, or packaging using xcode. Cannot build app for iOS simulator, device, or packaging using xcode 1. Make sure to have your xcode-select pointing to xcode 2. In Studio, create a default Alloy or classic app 3. Right-click on the project 4. Go to Run As iPhone or Run As iOS Device or Publish Distribute - Ad Hoc Enterprise Studio console view will return invalid iOS version (see attachments). Should be able to build app for iOS simulator, device, or packaging.. If you try to run project locally, the port does not appear in the console view. 1. Right-click in Project Explorer 2. Go to New Project 3. Specify a project name and click finish 4. Next, right-click on the project 5. Go to Run As Local Server Port number does not appear in the console view (see attachment) Port number should appear in the console view 1. If you repeat step 5 again, then the port number will appear again 2. Cannot reproduce just using the cli. Steps to reproduce: 1. In TiStudio, create a project 2. Publish the project 3. Right-click on the project and go to Tail Logs Actual: Terminal console would return the following: Expected: Instead of -v to specify app version, -a should be used instead: Note: To work around this, use. Details: After creating the default Titanium app, the module does not appear in the even though the ACS server is returning the 200 success in the log. The issue still appears with SDK Steps to reproduce: 1. Open TiStudio and create the default Titanium app Actual: module does not appear in the (see and ACS is not enabled for app even though 200 success code is returned (see But, if I try to again, I get the 400 error code (see Expected: After creating the default app, you should be able to see the module in tiapp.. Details: If you create the default Titanium app with ACS enabled from Studio, the guid in the does not match with the guid in If you create the default Titanium app ACS enabled, then the guid in the will match with the guid in Steps to reproduce: 1. Create default Titanium app with ACS enabled 2. Go to and find your app 3. Click on link Actual: The guid in the does not match with the guid in (see and And if you go to the my apps page does not recognize it (see Expected: The guids generated in Studio should match guid in the my apps page.. ", "contenttype": "application/json", "created": 737603, "id": 77, "language": "en", "user_name": "wluu"}]}