{"contentItems": [{"content": "will not a good implement, first is that system dashboard controls have same package id(-1), second is that one package can have more than 1 controls in it, in these cases the sp can't work correctly.. Si: EVOQCONTENT - Users not receiving notification when registration has been approved. Default Website template contains CK editor config files, it should removed, otherwise it will cause the config file out of date if ck editor did changes in default settings.. the workaound here is goto Host Html Editor Manager and check provider to ck editor provider.. Reproduce Steps: 1. install latest version and goto Admin File Management; 2. upload a file; 3. upload same file and click Replace. Expected Result: the file will upload and overwrite exist file successful. Actually Result: upload failed and error occurred: - Object reference not set to an instance of an object. at stream, PortalSettings UserInfo userInfo, String folder, String filter, String fileName, Boolean overwrite, Boolean isHostPortal, Boolean extract) in 475. Biography show full toolbar in editor for register users. Reproduce Steps: 1. install latest version and login as host; 2. create a new user and login as the new user; 3. go to edit profile page. Expected Result: CK editor for biography should use basic toolbar. Actually Result: it use full toolbar setting.. as i know control panel select modules which under Common category to show in common section, so we can set the category to Common, but no need common attribute.. EVOQCONTENT: Operating System always shows as Unknown in page Analytics. EVOQCONTENT: Contents in shared layout module are moved out of the layout after the layout and contents in the layout are shared. CONTENT: Site is absolutely unusable with CDF enabled. EVOQCONTENT: Create new page and apply with template not work in azure. EVOQCONTENT: UI no response when trying to put a page in Edit mode with 3rd party skin. EVOQCONTENT: SI: content staging module displays object reference error. Hi , that could the same reason dragging module during the panel is refreshing. , can you verify this again with latest version, there will be a loading mask to prevent this action.. Cannot add marketo form module to a new page as host. EVOQSOCIAL: HTTP 403 Error when trying to Register as a new User and Cancelling. EVOQCONTENT: Validation of viewstate MAC failed during loading pages after installation.. EVOQCONTENT: Delete page in workflow should purge the notifications as well. EVOQCONTENT: UI issue for Host HTML Editor Manager. EVOQCONTENT: Parent site cannot be created with an error. EVOQCONTENT: Module events doesn't handle correct when soft hard delete tab. When soft hard delete a tab, the modules on the tab will also deleted, but the events doesn't fire in this time: 1. soft delete tab, it only call so no event fired; 2. hard delete tab, it will check whether module is shared and call DeleteModule if not, in this case ModuleDeleted event fired. 3. when hard delete tab, the object in event args only have tabid, doesn't contain other info like Expected: 1. soft delete module from tab call ModuleDeleted event; 2. hard delete module from tab call ModuleRemoved event. 3. the tab info object in event should contain full info so that event handler can get correct info.. EVOQCONTENT: Content Layout & Templates - Not Picked-Up During Site Import. EVOQCONTENT: No response from UI when adding DAM to a page. Reproduce Steps: 1. install latest version and login as host; 2. in Host Settings, check \"Use Hosted jQuery Version?\" and update; 3. view home page and check the source. Expected Result: the jQuery used hosted version. Actually Result: jQuery still use local version. -IMO we need introduce a setting for each javascript library to set whether use CDN version, currently we use a host setting for all Javascript libraries, it may caught this. Reproduce Steps: 1. install latest build and login as host; 2. disable popup in site settings; 3. goto host extensions, try to edit an installed module; 4. click \"Update\" button. After Update button clicked, there will some invalid elements shown in page(and empty drop down in top left and 2 radio buttons in top right):. This line can't remove as it will let menu i wrong position if the browser window resized.. 1. it will not index users after upgrade to 2. exceptions during search: - Search Document error: Portal ID: 0, Tab ID: 252, Module ID: 1901, Mod. 159, Url: , Unique Key: Last Modified: Culture: searchDocument Parameter name: The property in object is invalid. at argName, String argProperty, TValue propertyValue, TValue testValue) at searchDocument, Boolean autoCommit) at the exception is not come from user indexer but from module indexer, I guess it caught by some modules doesnt set the property, so it will be the empty.. Reproduce Steps: 1. install and login as host; 2. add a new language; 3. in admin user accounts, create a new user. the user. Issues: 1. we only add language but not new site, the drop down shouldn't shown. 2. drop down's value in wrong.. Update UI to match the mock provided by Ryan); Update the logic of saved queries function: - when queries drop down: 1. if the connection name doesn't exist in connection drop down, need prompt a message to let user know and select default connection, else select the connection in drop down; 2. fit the script textbox with the query script content; 3. fit the query name textbox with query name; - when click \" ute\" button: 1. if the statement return data table(s), we need display all table(s); 2. if the statement return nothing and just an ute script, we need return whether script ute complete, and show exact error message if it failed; 3. if the statement contains \"GO\" statement, it should split as a multi-command script; - when click \"save query\" button: 1. we need check whether the name exists, if true we need prompt user whether overwrite the exist one or let user to change the name; 2. after save query, need prompt message to let user know its done; - when click \"delete query\" button: 1. need prompt confirm window to user first; 2. after delete, we need set saved queries drop down to \"none specific\", connect string to default, empty script text area and name textbox;. Business Object of saved query, mapping the columns from table. Business Controller for saved queries, it should implement function: SaveQuery - validate required properties - save the object into database - add event log for the script update GetQueries - get the list of all saved queries. GetQuery(int id) - get the query by id. Delete(int id) - delete the query by id - add event log for the script delete Test cases for Business Controller.. Table: SavedQueries -QueryId INT, Identity, Primary Key -Name nvarchar(50), not null, unique index query name -Content nvarchar(max) not null query script -Connection nvarchar(50) not null connection name which used to ute the script INT, null -CreatedOnDate DateTime, null INT, null DateTime, null 4 columns used for content item Procedures: GetQueries all queries list SaveQuery a new query or update exist one. DeleteQuery a query. ", "contenttype": "application/json", "created": 737358, "id": 19, "language": "en", "user_name": "zyhfish", "email": "-"}]}